<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content=
    "application/xhtml+xml; charset=iso-8859-1" />
    <title>
      2.2.&nbsp;Creating a New Partition
    </title>
    <link rel="stylesheet" href="../stylesheets/lfs.css" type="text/css" />
    <meta name="generator" content="DocBook XSL Stylesheets V1.73.2" />
    <link rel="stylesheet" href="../stylesheets/lfs-print.css" type=
    "text/css" media="print" />
  </head>
  <body class="lfs" id="lfs-6.6">
    <div class="navheader">
      <h4>
        Linux From Scratch - Version 6.6
      </h4>
      <h3>
        Chapter&nbsp;2.&nbsp;&#20934;&#22791;&#19968;&#20010;&#26032;&#20998;&#21306; </h3>
      <ul>
        <li class="prev">
          <a accesskey="p" href="introduction.html" title=
          "Introduction">&#21518;&#36864;</a>
          <p>
            &#20171;&#32461;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="creatingfilesystem.html" title=
          "Creating a File System on the Partition">&#21069;&#36827;</a>
          <p>
            &#22312;&#36825;&#20010;&#20998;&#21306;&#19978;&#21019;&#24314;&#25991;&#20214;&#31995;&#32479;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter02.html" title=
          "Chapter&nbsp;2.&nbsp;Preparing a New Partition">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
    <div class="sect1" lang="en" xml:lang="en">
      <h1 class="sect1">
        <a id="space-creatingpartition" name=
        "space-creatingpartition"></a>2.2. &#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#20998;&#21306;
      </h1>
      <p>&#21644;&#22823;&#22810;&#25968;&#20854;&#20182;&#25805;&#20316;&#31995;&#32479;&#19968;&#26679;&#65292; LFS&#36890;&#24120;&#23433;&#35013;&#22312;&#19968;&#20010;&#19987;&#29992;&#20998;&#21306;&#19978;&#12290; &#25105;&#20204;&#25512;&#33616;&#65292; &#23558;LFS&#31995;&#32479;&#26500;&#24314;&#22312;&#19968;&#20010; &#21487;&#29992;&#30340;&#31354;&#20998;&#21306;&#19978;&#65292; &#25110;&#32773;&#65292; &#22914;&#26524;&#20320;&#26377;&#36275;&#22815;&#30340;&#31354;&#30333;&#30913;&#30424;&#31354;&#38388;&#65292; &#23601;&#30452;&#25509;&#21019;&#24314;&#19968;&#20010;&#12290; </p>
      <p>
        &#26368;&#23567;&#30340;LFS&#31995;&#32479;&#65292;&#22823;&#32422;&#38656;&#35201;1.3GB&#30340;&#20998;&#21306;&#12290;
        &#36825;&#26679;&#25165;&#26377;&#36275;&#22815;&#30340;&#31354;&#38388;&#23384;&#25918;&#21644;&#32534;&#35793;&#25152;&#26377;&#30340;&#28304;&#30721;&#21253;&#12290; &#28982;&#32780;&#65292;&#22914;&#26524;&#20320;&#25171;&#31639;&#23558;LFS&#31995;&#32479;&#24403;&#20570;&#20027;Linux&#31995;&#32479;&#65292; &#20320;&#21487;&#33021;&#38656;&#35201;&#23433;&#35013;&#20854;&#20182;&#30340;&#36719;&#20214;&#65292; &#36825;&#23601;&#38656;&#35201;&#39069;&#22806;&#30340;&#31354;&#38388;  &#65288;2-3GB&#65289;&#12290;  LFS&#31995;&#32479;&#26412;&#36523;&#24182;&#19981;&#21344;&#29992;&#36825;&#20040;&#22823;&#30340;&#31354;&#38388;&#12290; &#22823;&#37096;&#20998;&#25152;&#38656;&#31354;&#38388;&#26159;&#29992;&#26469;&#25552;&#20379;&#36275;&#22815;&#30340;&#20020;&#26102;&#31354;&#38388;&#12290;&#32534;&#35793;&#36719;&#20214;&#21253;&#20250;&#29992;&#21040;&#22823;&#37327;&#30340;&#30913;&#30424;&#31354;&#38388;&#65292; &#31561;&#36719;&#20214;&#21253;&#23433;&#35013;&#20197;&#21518;&#65292; &#36825;&#20123;&#20020;&#26102;&#31354;&#38388;&#20250;&#34987;&#25910;&#22238;&#12290;</p>
      <p>
        &#22240;&#20026;&#32534;&#35793;&#36807;&#31243;&#20013;&#65292;&#24182;&#19981;&#24635;&#26159;&#26377;&#36275;&#22815;&#30340;&#21487;&#29992;&#20869;&#23384;&#65288;RAM&#65289;&#65292;&#25152;&#20197;&#26368;&#22909;&#25226;&#19968;&#20010;&#23567;&#30340;&#30913;&#30424;&#20998;&#21306;&#20316;&#20026;<code class=
        "systemitem">&#20132;&#25442;</code>&#20998;  &#21306;&#12290;&#20869;&#26680;&#20351;&#29992;&#20132;&#25442;&#20998;&#21306;&#23384;&#25918;&#19981;&#24120;&#29992;&#30340;&#25968;&#25454;&#65292;&#20197;&#20415;&#25226;&#26356;&#22810;&#30340;&#20869;&#23384;&#30041;&#32473;&#27963;&#21160;&#36827;&#31243;&#12290; LFS&#31995;&#32479;&#21487;&#20197;&#21644;&#23487;&#20027;&#31995;&#32479;&#20351;&#29992;&#21516;&#19968;&#20010;&#20132;&#25442;&#20998;&#21306;&#65292;&#22240;&#27492;&#65292; &#33509;&#23487;&#20027;&#31995;&#32479;&#24050;&#32463;&#26377;&#20102;<code class=
        "systemitem">&#20132;&#25442;</code>&#20998;&#21306;&#26102;&#65292; &#23601;&#27809;&#26377;&#24517;&#35201;&#20026;LFS&#31995;&#32479;&#20877;&#21019;&#24314;&#19968;&#20010;&#20102;&#12290;</p>
      <p>&#21551;&#21160;&#19968;&#20010;&#30913;&#30424;&#20998;&#21306;&#31243;&#24207;&#65292;&#27604;&#22914;<span class=
        "command"><strong> cfdisk</strong></span> &#25110; <span class=
        "command"><strong>fdisk</strong></span>&#65292; &#29992;&#21363;&#23558;&#22312;&#19978;&#38754;&#21019;&#24314;&#26032;&#20998;&#21306;&#30340;&#30828;&#30424;&#21517;&#23383;&#20316;&#20026;&#21629;&#20196;&#34892;&#36873;&#39033;&#65292;&#22914;&#20027;IDE&#30828;&#30424;&#21517;&#23383;&#23601;&#26159; <code class="filename">/dev/hda</code> &#12290; &#21019;&#24314;&#19968;&#20010;Linux&#26412;&#22320;&#20998;&#21306;&#65292;&#38656;&#35201;&#30340;&#35805;&#65292;&#24744;&#36824;&#35201;&#21019;&#24314;&#19968;&#20010;<code class="systemitem">&#20132;&#25442;</code>&#20998;&#21306;&#12290; &#22914;&#26524;&#24744;&#36824;&#19981;&#30693;&#36947;&#22914;&#20309;&#20351;&#29992;&#36825;&#20004;&#20010;&#24037;&#20855;&#30340;&#35805;&#65292; &#35831;&#21442;&#32771; <code class=
        "filename">cfdisk(8)</code>&#25110;&#32773;   <code class="filename">fdisk(8)</code> &#25163;&#20876;&#39029;&#12290;</p>
      <p>
        &#35831;&#35760;&#20303;&#36825;&#20010;&#26032;&#20998;&#21306;&#30340;&#21517;&#23383; (&#22914; <code class=
        "filename">hda5</code>)&#12290;&#26412;&#20070;&#23558;&#31216;&#20854;&#20026;LFS&#20998;&#21306;&#12290;&#20063;&#35201;&#35760;&#20303; <code class=
        "systemitem">&#20132;&#25442;</code> &#20998;&#21306;&#30340;&#21517;&#23383;&#65292; &#36825;&#20123;&#21517;&#23383;&#23558;&#22312;&#21518;&#38754;&#30340;<code class="filename">/etc/fstab</code> &#25991;&#20214;&#20013;&#29992;&#21040;&#12290;      </p>
      <div class="sect2" lang="en" xml:lang="en">
        <h2 class="sect2">
          2.2.1. &#20854;&#20182;&#20998;&#21306;&#38382;&#39064;
        </h2>
        <p>
          &#23545;&#31995;&#32479;&#20998;&#21306;&#24314;&#35758;&#30340;&#38382;&#21367;&#32463;&#24120;&#21457;&#24067;&#22312; LFS &#37038;&#20214;&#21015;&#34920;&#19978;&#12290;&#36825;&#26159;&#19968;&#20010;&#39640;&#24230;&#20027;&#35266;&#30340;&#35805;&#39064;&#12290; &#22823;&#22810;&#25968;&#21457;&#24067;&#29256;&#40664;&#35748;&#20351;&#29992;&#25972;&#20010;&#30828;&#30424;&#65292;&#24182;&#20998;&#20986;&#19968;&#20010;&#23567;&#30340;&#20132;&#25442;&#20998;&#21306;&#12290; &#22240;&#20026;&#19968;&#20123;&#21407;&#22240;&#65292;&#36825;&#19981;&#26159; LFS &#31995;&#32479;&#30340;&#26368;&#20339;&#36873;&#25321;&#12290;&#23427;&#20351;&#22810;&#20010;&#20998;&#24067;&#30340;&#25968;&#25454;&#20849;&#20139;&#20943;&#23569;&#20102;&#28789;&#27963;&#24615;&#65292;&#20351;&#22791;&#20221;&#26356;&#36153;&#26102;&#65292;&#24182;&#19988;&#36890;&#36807;&#25991;&#20214;&#31995;&#32479;&#32467;&#26500;&#30340;&#20302;&#25928;&#29575;&#20998;&#37197;&#20250;&#28010;&#36153;&#30913;&#30424;&#31354;&#38388;&#65292;&#25110;&#32773;&#20351;&#21019;&#24314;LFS &#26356;&#22256;&#38590;&#12290;</p>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
            2.2.1.1. &#26681;&#20998;&#21306;          </h3>
          <p>
            &#19968;&#20010;10GB&#30340;&#26681;&#20998;&#21306; (&#19981;&#35201;&#21644; /root &#30446;&#24405;&#28151;&#28102;) &#23545;&#20110;&#22823;&#22810;&#25968;&#31995;&#32479;&#37117;&#26159;&#19968;&#20010;&#36739;&#22909;&#30340;&#26041;&#26696;&#12290;&#23427;&#25552;&#20379;&#20102;&#36275;&#22815;&#30340;&#31354;&#38388;&#26469;&#32534;&#35793; LFS &#21644;&#22823;&#22810;&#25968;&#30340; BLFS &#36719;&#20214;&#65292;&#32780;&#19988;&#65292;&#22240;&#20026;&#23427;&#27604;&#36739;&#23567;&#65292;&#21487;&#20197;&#24456;&#23481;&#26131;&#30340;&#22312;&#30828;&#30424;&#19978;&#24314;&#31435;&#22810;&#20010;&#20998;&#21306;&#29992;&#20110;&#23454;&#39564;&#12290;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
            2.2.1.2. &#20132;&#25442;&#20998;&#21306;
          </h3>
          <p>
            &#22823;&#22810;&#25968;&#21457;&#24067;&#31995;&#32479;&#33258;&#21160;&#24314;&#31435;&#19968;&#20010;&#20132;&#25442;&#20998;&#21306;&#12290;&#36890;&#24120;&#24314;&#35758;&#20132;&#25442;&#20998;&#21306;&#30340;&#23610;&#23544;&#26159;&#29289;&#29702;&#20869;&#23384;&#24635;&#37327;&#30340;&#20004;&#20493;&#24038;&#21491;&#65292;&#28982;&#32780;&#36825;&#24456;&#23569;&#38656;&#35201;&#12290;&#22914;&#26524;&#30913;&#30424;&#31354;&#38388;&#26377;&#38480;&#65292;&#21487;&#20197;&#23558;&#20132;&#25442;&#20998;&#21306;&#35774;&#20026;2GB&#65292;&#24182;&#30417;&#27979;&#30340;&#30913;&#30424;&#20132;&#25442;&#37327;&#12290;</p>
          <p>
            &#30913;&#30424;&#20132;&#25442;&#24182;&#19981;&#24635;&#26159;&#22909;&#30340;&#12290;&#36890;&#24120;&#20320;&#20165;&#20165;&#36890;&#36807;&#21548;&#30913;&#30424;&#30340;&#27963;&#21160;&#65292;&#21644;&#35266;&#23519;&#31995;&#32479;&#22914;&#20309;&#23545;&#21629;&#20196;&#20570;&#20986;&#21453;&#24212;&#65292;&#23601;&#21487;&#20197;&#30693;&#36947;&#26159;&#21542;&#22312;&#36827;&#34892;&#30913;&#30424;&#20132;&#25442;&#12290;&#30913;&#30424;&#20132;&#25442;&#30340;&#31532;&#19968;&#20010;&#21453;&#24212;&#65292;&#24212;&#35813;&#26159;&#26816;&#26597;&#19968;&#20010;&#26080;&#21453;&#24212;&#30340;&#21629;&#20196;&#65292;&#23601;&#20687;&#35797;&#22270;&#32534;&#36753;&#19968;&#20010;5GB&#30340;&#25991;&#20214;&#19968;&#26679;&#12290; &#22914;&#26524;&#24635;&#26159;&#21457;&#29983;&#30913;&#30424;&#20132;&#25442;&#65292;&#26368;&#22909;&#30340;&#35299;&#20915;&#21150;&#27861;&#26159;&#20026;&#20320;&#30340;&#26426;&#22120;&#36141;&#20080;&#26356;&#22810;&#30340;&#20869;&#23384;&#12290;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
            2.2.1.3. &#36866;&#24403;&#30340;&#20998;&#21306;
          </h3>
          <p>
            &#26377;&#19968;&#20123;&#30340;&#20854;&#20182;&#20998;&#21306;&#19981;&#26159;&#24517;&#38656;&#30340;&#65292;&#20294;&#22312;&#35774;&#35745;&#30913;&#30424;&#24067;&#23616;&#26102;&#24212;&#35813;&#32771;&#34385;&#12290;&#19979;&#38754;&#21015;&#20986;&#30340;&#24182;&#19981;&#35814;&#23613;&#65292;&#20294;&#21487;&#20197;&#20316;&#20026;&#25351;&#23548;&#12290; </p>
          <div class="itemizedlist">
            <ul>
              <li>
                <p>
                  /boot &ndash; &#24378;&#28872;&#24314;&#35758;&#12290; &#20351;&#29992;&#32473;&#20998;&#21306;&#23384;&#20648;&#20869;&#26680;&#21644;&#20854;&#20182;&#21551;&#21160;&#20449;&#24687;&#12290;&#20026;&#20102;&#23613;&#37327;&#20943;&#23569;&#22823;&#30828;&#30424;&#28508;&#22312;&#30340;&#21551;&#21160;&#38382;&#39064;&#65292;&#23558;&#32473;&#20998;&#21306;&#35774;&#32622;&#20026;&#31532;&#19968;&#20010;&#30828;&#30424;&#19978;&#30340;&#31532;&#19968;&#20010;&#29289;&#29702;&#20998;&#21306;&#12290; &#19968;&#20010; 100MB&#30340;&#20998;&#21306;&#23601;&#22815;&#29992;&#20102;&#12290;</p>
              </li>
              <li>
                <p>
                  /home &ndash; &#24378;&#28872;&#24314;&#35758;&#12290;&#36328;&#36807;&#22810;&#20010;&#21457;&#24067;&#31995;&#32479;&#25110; LFS &#31995;&#32479;&#30340;&#20849;&#20139;&#20027;&#30446;&#24405;&#21644;&#29992;&#25143;&#23450;&#21046;&#12290; &#23427;&#30340;&#23610;&#23544;&#26222;&#36941;&#36739;&#22823;&#65292;&#21462;&#20915;&#20110;&#21487;&#29992;&#30340;&#30913;&#30424;&#31354;&#38388;&#12290;</p>
              </li>
              <li>
                <p>
                  /usr &ndash; &#22914;&#26524;&#20026;&#30246;&#23458;&#25143;&#31471;&#25110;&#26080;&#30424;&#31449;&#25552;&#20379;&#26381;&#21153;&#65292;&#36890;&#24120;&#35201;&#29992;&#30340;&#19968;&#20010;&#21333;&#29420;&#30340; /usr &#20998;&#21306;&#12290;&#22312;LFS&#20013;&#19968;&#33324;&#19981;&#38656;&#35201;&#23427;&#65292; &#19968;&#20010;5GB&#30340;&#20998;&#21306;&#21487;&#20197;&#22788;&#29702;&#22823;&#22810;&#25968;&#23433;&#35013;&#12290;</p>
              </li>
              <li>
                <p>
                  /opt &ndash; &#36825;&#20010;&#30446;&#24405;&#23545;&#20110; BLFS &#24456;&#26377;&#29992;&#65292;&#22312;&#36825;&#37324;&#21487;&#20197;&#23433;&#35013;&#24456;&#22810;&#22823;&#30340;&#36719;&#20214;&#21253;&#65292;&#27604;&#22914;  Gnome &#25110; KDE
                  &#32780;&#19981;&#23433;&#35013;&#21040; /usr
                  &#30446;&#24405;&#12290; &#22914;&#26524;&#35201;&#29992;&#65292;&#36890;&#24120;&#38656;&#35201;5-10GB&#30340;&#31354;&#38388;&#12290;</p>
              </li>
              <li>
                <p>
                  /tmp &ndash; &#19968;&#20010;&#21333;&#29420;&#30340; /tmp &#20998;&#21306;&#27604;&#36739;&#23569;&#35265;&#65292;&#20294;&#26159;&#22914;&#26524;&#37197;&#32622;&#30246;&#23458;&#25143;&#31471;&#26102;&#65292;&#23427;&#23601;&#24456;&#26377;&#29992;&#20102;&#12290;&#22914;&#26524;&#38656;&#35201;&#65292;&#35813;&#20998;&#21306;&#36890;&#24120;&#19981;&#24517;&#36229;&#36807;2GB&#12290;</p>
              </li>
              <li>
                <p>
                  /usr/src &ndash; &#35813;&#20998;&#21306;&#23545;&#20110;&#25552;&#20379;&#19968;&#20010;&#23384;&#20648; BLFS &#65288;&#24212;&#35813;&#26159;LFS&#21543; --&#35793;&#32773;&#65289;&#28304;&#25991;&#20214;&#30340;&#20301;&#32622;&#65292;&#24182;&#22312; LFS &#32534;&#35793;&#20013;&#20849;&#20139;&#23427;&#20204;&#65292;&#38750;&#24120;&#26377;&#29992;&#65292; &#23427;&#36824;&#21487;&#20197;&#29992;&#26469;&#24403;&#20316;&#32534;&#35793; BLFS &#36719;&#20214;&#21253;&#30340;&#20301;&#32622;&#12290;&#35813;&#20998;&#21306;&#24212;&#35813;&#20351;&#29992;30-50GB&#30340;&#31354;&#38388;&#12290;</p>
              </li>
            </ul>
          </div>
          <p>
            &#20320;&#24819;&#22312;&#21551;&#21160;&#26102;&#33258;&#21160;&#21152;&#36733;&#30340;&#20219;&#20309;&#21333;&#29420;&#30340;&#20998;&#21306;&#65292;&#37117;&#35201;&#26126;&#30830;&#20889;&#36827; <code class=
            "filename">/etc/fstab</code> &#25991;&#20214;&#12290; &#20851;&#20110;&#22914;&#20309;&#21015;&#20986;&#20998;&#21306;&#30340;&#32454;&#33410;&#65292;&#25105;&#20204;&#23558;&#22312; <a class="xref" href=
            "../chapter08/fstab.html" title=
            "8.2.&nbsp;Creating the /etc/fstab File">Section&nbsp;8.2,
            &ldquo;&#21019;&#24314; /etc/fstab &#25991;&#20214;&rdquo;</a> &#35752;&#35770;&#12290;</p>
        </div>
      </div>
    </div>
    <div class="navfooter">
      <ul>
        <li class="prev">
          <a accesskey="p" href="introduction.html" title=
          "Introduction">&#21518;&#36864;</a>
          <p>
            &#20171;&#32461;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="creatingfilesystem.html" title=
          "Creating a File System on the Partition">&#21069;&#36827;</a>
          <p>
            &#22312;&#36825;&#20010;&#20998;&#21306;&#19978;&#21019;&#24314;&#25991;&#20214;&#31995;&#32479;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter02.html" title=
          "Chapter&nbsp;2.&nbsp;Preparing a New Partition">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
  </body>
</html>
