<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content=
    "application/xhtml+xml; charset=iso-8859-1" />
    <title>
      LFS Target Architectures
    </title>
    <link rel="stylesheet" href="../stylesheets/lfs.css" type="text/css" />
    <meta name="generator" content="DocBook XSL Stylesheets V1.73.2" />
    <link rel="stylesheet" href="../stylesheets/lfs-print.css" type=
    "text/css" media="print" />
  </head>
  <body class="lfs" id="lfs-6.6">
    <div class="navheader">
      <h4>
        Linux From Scratch - Version 6.6
      </h4>
      <h3>
        &#24207;&#35328;
      </h3>
      <ul>
        <li class="prev">
          <a accesskey="p" href="audience.html" title="Audience">&#21518;&#36864;</a>
          <p>
            &#30446;&#26631;&#35835;&#32773;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="standards.html" title=
          "LFS and Standards">&#21069;&#36827;</a>
          <p>
            LFS&#21450;&#26631;&#20934;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="preface.html" title="Preface">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
    <div class="sect1" lang="en" xml:lang="en">
      <h1 class="sect1">
        <a id="pre-architecture" name="pre-architecture"></a>iii. LFS &#30446;&#26631;&#26550;&#26500;
      </h1>
      <p>
        LFS&#31995;&#32479;&#20027;&#35201;&#30340;&#30446;&#26631;&#26550;&#26500;&#26159;32&#20301;&#30340;Intel CPU&#12290;&#22914;&#26524;&#20320;&#20197;&#21069;&#27809;&#26377;&#26500;&#24314;&#36807;Linux&#31995;&#32479;&#65292;&#20320;&#24212;&#35813;&#20174;&#36825;&#20010;&#30446;&#26631;&#24320;&#22987;&#12290; 32&#20301;&#26550;&#26500;&#26159;&#24471;&#21040;Linux&#26368;&#24191;&#27867;&#25903;&#25345;&#30340;&#65292;&#24182;&#19988;&#23545;&#24320;&#25918;&#36164;&#28304;&#21644;&#21830;&#19994;&#36719;&#20214;&#30340;&#20860;&#23481;&#24615;&#26368;&#22909;&#12290;</p>
      <p>
        &#21478;&#19968;&#26041;&#38754;&#65292;&#26412;&#20070;&#30340;&#29992;&#27861;&#35828;&#26126;&#24050;&#30693;&#65292;&#36890;&#36807;&#19968;&#20123;&#20462;&#25913;&#65292;&#35813;&#31995;&#32479;&#21487;&#20197;&#22312; Power PC &#21644;64&#20301;&#30340;AMD/Intel
        CPU &#26550;&#26500;&#19979;&#36816;&#34892;&#12290; &#20026;&#20102;&#26500;&#24314;&#36866;&#21512;&#36825;&#20123;CPU&#30340;&#31995;&#32479;&#65292;&#38500;&#20102;&#25509;&#19979;&#26469;&#20960;&#39029;&#20197;&#22806;&#65292;&#20027;&#35201;&#30340;&#20808;&#20915;&#26465;&#20214;&#26159;&#20320;&#35201;&#26377;&#19968;&#20010;&#30456;&#21516;&#30446;&#26631;&#26550;&#26500;&#30340;&#29616;&#23384;Linux&#31995;&#32479;&#65292;&#27604;&#22914;&#20197;&#21069;&#23433;&#35013;&#30340;LFS&#65292; Ubuntu&#65292;
        Red Hat/Fedora&#65292; SuSE &#25110;&#20854;&#20182;&#21457;&#24067;&#31995;&#32479;&#12290; &#36824;&#35201;&#27880;&#24847;&#65292;32&#20301;&#21457;&#24067;&#31995;&#32479;&#21487;&#20197;&#22312;64&#20301; AMD/Intel &#35745;&#31639;&#26426;&#19978;&#23433;&#35013;&#21644;&#20351;&#29992;&#12290;</p>
      <p>
        &#19968;&#20123;&#20851;&#20110;64&#20301;&#31995;&#32479;&#30340;&#20854;&#20182;&#24773;&#20917;&#38656;&#35201;&#28155;&#21152;&#22312;&#36825;&#37324;&#12290;&#21644;32&#20301;&#31995;&#32479;&#27604;&#36739;&#65292;&#21487;&#25191;&#34892;&#31243;&#24207;&#30340;&#23481;&#37327;&#31245;&#24494;&#22823;&#19968;&#20123;&#65292;&#32780;&#36895;&#24230;&#20165;&#24555;&#19968;&#28857;&#12290;&#20363;&#22914;&#65292; &#22312; Core2Duo CPU &#19978;&#30340; LFS-6.5 &#22522;&#30784;&#31995;&#32479;&#27979;&#35797;&#20013;&#65292;&#19979;&#38754;&#26159;&#32479;&#35745;&#32467;&#26524;&#65306;</p>
      <pre class="screen"><code class=
      "computeroutput">Architecture Build Time     Build Size 
32-bit       198.5 minutes  648 MB 
64-bit       190.6 minutes  709 MB</code></pre>
      <p>
        &#23601;&#20687;&#20320;&#30475;&#21040;&#30340;&#65292;64&#20301;&#30340;&#32534;&#35793;&#36895;&#24230;&#21482;&#27604;32&#20301;&#30340;&#24555; 4%&#65292;&#32780;&#23481;&#37327;&#22823;9%&#12290; &#20351;&#29992;64&#20301;&#31995;&#32479;&#24471;&#21040;&#30340;&#22909;&#22788;&#30456;&#23545;&#24456;&#23569;&#12290;&#24403;&#28982;&#65292;&#22914;&#26524;&#20320;&#26377;&#36229;&#36807;4GB&#30340;&#20869;&#23384;&#65292;&#25110;&#32773;&#35201;&#25805;&#20316;&#36229;&#36807;4GB&#30340;&#25968;&#25454;&#65292;&#37027;&#20040;64&#20301;&#31995;&#32479;&#30340;&#20248;&#28857;&#26159;&#24456;&#26126;&#26174;&#30340;&#12290;</p>
      <p>
        &#22312;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;LFS &#32534;&#35793;&#30340;64&#20301;&#31995;&#32479;&#26159;&ldquo;&#32431;&#20928;&#30340;&rdquo;64&#20301;&#31995;&#32479;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#23427;&#21482;&#25903;&#25345;64&#20301;&#21487;&#25191;&#34892;&#25991;&#20214;&#12290;  &#26500;&#24314;&#19968;&#20010; &ldquo;&#22810;&#24211;&#65288;multi-lib&#65289;&rdquo; &#31995;&#32479;&#65292;&#38656;&#35201;&#23558;&#24456;&#22810;&#24212;&#29992;&#36719;&#20214;&#32534;&#35793;&#20004;&#27425;&#65292;&#19968;&#27425;&#29992;&#20110;32&#20301;&#31995;&#32479;&#65292;&#19968;&#27425;&#29992;&#20110;63&#20301;&#31995;&#32479;&#12290;&#22312;LFS&#31995;&#32479;&#19981;&#30452;&#25509;&#25903;&#25345;&#65292;&#26159;&#22240;&#20026;&#23427;&#24178;&#25200;&#20102;&#25552;&#20379;&#26131;&#29992;&#30340;&#22522;&#26412;Linux&#31995;&#32479;&#25351;&#21335;&#30340;&#25945;&#32946;&#30446;&#26631;&#12290; &#23545;&#20110;&#36825;&#20010;&#39640;&#32423;&#20027;&#39064;&#65292;&#20320;&#21487;&#20197;&#21442;&#32771; <a class=
        "ulink" href="http://trac.cross-lfs.org/">Cross Linux From
        Scratch</a> &#39033;&#30446;&#12290;</p>
      <p>
        &#36825;&#26159;&#20851;&#20110;64&#20301;&#31995;&#32479;&#30340;&#26368;&#21518;&#35752;&#35770;&#12290;&#24403;&#21069;&#26377;&#19968;&#20123;&#36719;&#20214;&#21253;&#19981;&#33021;&#22312;&ldquo;&#32431;&#20928;&#30340;&rdquo;64&#20301;&#31995;&#32479;&#20013;&#32534;&#35793;&#65292;&#25110;&#32773;&#19987;&#38376;&#30340;&#32534;&#35793;&#25351;&#21335;&#12290;&#36890;&#24120;&#65292;&#36825;&#20123;&#21253;&#26377;&#19968;&#20123;&#23884;&#20837;&#24335;32&#20301;&#29305;&#23450;&#27719;&#32534;&#35821;&#35328;&#25351;&#20196;&#65292;&#23427;&#20204;&#22312;64&#20301;&#31995;&#32479;&#32534;&#35793;&#26102;&#20250;&#22833;&#36133;&#12290; &#36825;&#21253;&#25324;  <a class="ulink" href=
        "http://www.linuxfromscratch.org/blfs/view/svn/">Beyond Linux From
        Scratch (BLFS)</a> &#20013;&#30340;&#19968;&#20123;Xorg &#39537;&#21160;&#12290;&#20854;&#20013;&#24456;&#22810;&#38382;&#39064;&#21487;&#20197;&#34987;&#32469;&#36807;&#65292; &#20294;&#26159;&#21487;&#33021;&#38656;&#35201;&#19987;&#38376;&#30340;&#31243;&#24207;&#25110;&#34917;&#19969;&#12290;</p>
    </div>
    <div class="navfooter">
      <ul>
        <li class="prev">
          <a accesskey="p" href="audience.html" title="Audience">&#21518;&#36864;</a>
          <p>
            &#30446;&#26631;&#35835;&#32773;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="standards.html" title=
          "LFS and Standards">&#21069;&#36827;</a>
          <p>
            LFS&#21450;&#26631;&#20934;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="preface.html" title="Preface">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
  </body>
</html>
