<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content=
    "application/xhtml+xml; charset=iso-8859-1" />
    <title>
      Foreword
    </title>
    <link rel="stylesheet" href="../stylesheets/lfs.css" type="text/css" />
    <meta name="generator" content="DocBook XSL Stylesheets V1.73.2" />
    <link rel="stylesheet" href="../stylesheets/lfs-print.css" type=
    "text/css" media="print" />
  </head>
  <body class="lfs" id="lfs-6.6">
    <div class="navheader">
      <h4>
        Linux From Scratch - Version 6.6
      </h4>
      <h3>
        &#24207;&#35328;
      </h3>
      <ul>
        <li class="prev">
          <a accesskey="p" href="preface.html" title="Preface">&#21518;&#36864;</a>
          <p>
            &#24207;&#35328;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="audience.html" title="Audience">&#21069;&#36827;</a>
          <p>
            &#30446;&#26631;&#35835;&#32773;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="preface.html" title="Preface">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
    <div class="sect1" lang="en" xml:lang="en">
      <h1 class="sect1">
        <a id="pre-foreword" name="pre-foreword"></a>i. &#21069;&#35328;
      </h1>
      <p> &#26089;&#22312;&#21313;&#24180;&#21069;&#30340;1998&#24180;&#65292;&#25105;&#23601;&#24320;&#22987;&#20102;&#23398;&#20064;&#21644;&#26356;&#22909;&#29702;&#35299;linux&#30340;&#26053;&#31243;&#12290;&#37027;&#26102;&#25105;&#21018;&#21018;&#23433;&#35013;&#20102;&#25105;&#30340;&#31532;&#19968;&#20010; linux&#21457;&#24067;&#29256;&#65292;&#24182;&#24456;&#24555;&#34987;linux&#30340;&#35774;&#35745;&#29702;&#24565;&#21644;&#24605;&#24819;  &#20307;&#31995;&#25152;&#21560;&#24341;&#12290; </p>
      <p> &#26377;&#24456;&#22810;&#21150;&#27861;&#26469;&#23436;&#25104;&#21333;&#20010;&#20219;&#21153;&#12290;&#36825;&#21477;&#35805;&#21516;&#26679;&#36866;&#29992;&#20110;linux&#21457;&#24067;&#29256;&#12290;   &#24456;&#22810;&#24050;&#32463;&#23384;&#22312;&#20102;&#22810;&#24180;&#12290; &#19968;&#20123;&#36824;&#23384;&#22312;&#65292; &#19968;&#20123;&#24050;&#32463;&#28436;&#21464;&#25104;&#20854;&#23427;&#20107;&#24773;&#65292;&#20063;&#26377;&#19968;&#20123;&#24050;&#32463;&#25918;&#24323;&#20102;&#25105;&#20204;&#30340;&#24605;&#24819;&#12290;   &#20182;&#20204;&#37117;&#20570;&#30528;&#19981;&#21516;&#30340;&#20107;&#24773;&#26469;&#28385;&#36275;&#30446;&#26631;&#35835;&#32773;&#30340;&#38656;&#35201;&#12290;&#22240;&#27492;&#21487;&#20197;&#26377;&#24456;&#22810;&#19981;&#21516;&#30340;&#21150;&#27861;&#26469;&#23436;&#25104;&#30456;&#21516;&#30340;&#26368;&#32456;&#30446;&#26631;&#65292;   &#25105;&#24320;&#22987;&#35748;&#20026;&#25105;&#19981;&#24517;&#20877;&#34987;&#20219;&#20309;&#20154;&#30340;&#25104;&#21697;&#25152;&#38480;&#21046;&#12290;&#22312;&#20986;&#29616;linux&#20197;&#21069;&#65292;&#22240;&#20026;&#20320;&#27809;&#26377;&#36873;&#25321;&#65292;&#25105;&#20204;&#19981;&#36807;&#26159;&#24525;&#21463; &#20102;&#20854;&#20182;&#25805;&#20316;&#31995;&#32479;&#30340;&#38382;&#39064;&#12290; &#23427;&#23601;&#26159;&#23427;&#65292;&#19981;&#31649;&#20320;&#26159;&#21542;&#21916;&#27426;&#12290;   &#22240;&#20026;linux&#65292; &#36873;&#25321;&#30340;&#35266;&#24565;&#24320;&#22987;&#26174;&#29616;&#12290;&#22914;&#26524;&#20320;&#19981;&#21916;&#27426;&#20160;&#20040;&#65292;&#23601;&#25913;&#21464;&#23427;&#65292;&#36825;&#26159;&#20320;&#30340;&#33258;&#30001;&#65292;&#29978;&#33267;&#21463;&#21040;&#40723;&#21169;&#12290; </p>
      <p> &#25105;&#35797;&#29992;&#20102;&#19968;&#20123;&#21457;&#34892;&#29256;&#65292;&#21364;&#19981;&#33021;&#20915;&#23450;&#20351;&#29992;&#20219;&#20309;&#19968;&#20010;&#12290;          &#23427;&#20204;&#37117;&#26159;&#20255;&#22823;&#30340;&#31995;&#32479;&#12290; &#23427;&#19981;&#26159;&#23545;&#21644;&#38169;&#30340;&#38382;&#39064;&#65292; &#32780;&#26159;&#21464;&#25104;&#20102;&#20010;&#20154;&#20219;&#21153;&#30340;&#38382;&#39064;&#12290;    &#20026;&#20102;&#20351;&#23427;&#23436;&#20840;&#31526;&#21512;&#25105;&#33258;&#24049;&#30340;&#21916;&#22909;&#65292; &#25105;&#24320;&#22987;&#26500;&#24314;&#33258;&#24049;&#30340;linux&#31995;&#32479;&#12290; &#22240;&#20026;&#37117;&#26159;&#21487;&#36873;&#25321;&#30340;&#65292;&#25152;&#20197;&#23545;&#20110;&#25105;&#26469;&#35828;&#65292; &#23427;&#19981;&#20877;&#26159;&#19968;&#20010;&#31616;&#21333;&#30340;&#31995;&#32479;&#65292; &#32780;&#26159;&#23436;&#32654;&#30340;&#12290; </p>
      <p> &#20026;&#20102;&#25226;&#23427;&#30495;&#27491;&#30340;&#21464;&#25104;&#25105;&#33258;&#24049;&#30340;&#31995;&#32479;&#65292;&#25105;&#20174;&#28304;&#20195;&#30721;&#32534;&#35793;&#20102;&#25152;&#26377;&#38656;&#35201;&#30340;&#36719;&#20214;&#65292;&#26469;&#20195;&#26367;&#39044;&#32534;&#35793;&#30340;&#20108;&#36827;&#21046;&#21253;&#12290; &#36825;&#20010;&ldquo;&#23436;&#32654;&#30340;&rdquo;linux&#31995;&#32479;&#23558;&#25317;&#26377;&#20854;&#20182;&#21457;&#34892;&#29256;&#30340;&#24378;&#22766;&#65292;&#32780;&#27809;  &#26377;&#23427;&#20204;&#26174;&#32780;&#26131;&#35265;&#30340;&#24369;&#28857;&#12290;&#24320;&#22987;&#65292;&#36825;&#20010;&#24819;&#27861;&#30475;&#36215;&#26469;&#26159;&#20196;&#20154;&#24863;&#21040;&#30031;&#24807;&#30340;&#65292;&#20294;&#26159;&#25105;&#20173;&#28982;&#22362;&#20449;&#36825;&#20010;&#24819;&#27861;&#65292; &#19968;&#20010;&#31526;&#21512;&#25105;&#29305;&#23450;&#38656;&#27714;&#30340;&#31995;&#32479;&#26159;&#21487;&#20197;&#26500;&#24314;&#30340;&#12290;</p>
      <p> &#22312;&#22788;&#29702;&#22909;&#27880;&#20837;&#24490;&#29615;&#20381;&#36182;&#21644;&#32534;&#35793;&#38169;&#35823;&#31561;&#21508;&#31181;&#38382;&#39064;&#20043;&#21518;&#65292;&#25105;&#32456;&#20110;&#21019;&#24314;&#20102;&#19968;&#20010;&#23450;&#21046;&#30340;Linux&#31995;&#32479;&#12290; &#23427;&#21151;&#33021;&#23436;&#21892;&#65292;&#24182;&#19988;&#21644;&#20854;&#20182;Linux&#31995;&#32479;&#19968;&#26679;&#22909;&#29992;&#12290;&#20294;&#26159;&#65292;&#23427;&#26159;&#25105;&#33258;  &#24049;&#21019;&#24314;&#30340;&#12290;  &#20320;&#33258;&#24049;&#32452;&#24314;&#36825;&#26679;&#19968;&#20010;&#31995;&#32479;&#26159;&#24456;&#35753;&#20154;&#28385;&#36275;&#30340;&#12290;&#26356;&#22909;&#30340;&#26159;&#33258;&#24049;&#21019;&#24314;&#27599;&#19968;&#20010;&#36719;&#20214;&#12290;</p>
      <p>&#24403;&#25105;&#25226;&#30446;&#26631;&#21644;&#32463;&#39564;&#19982;linux&#31038;&#21306;&#30340;&#20854;&#20182;&#25104;&#21592;&#20849;&#20139;&#26102;&#65292;&#26174;&#32780;&#26131;&#35265;&#65292;&#21035;&#20154;&#20063;&#26377;&#21516;&#26679;&#30340;&#24819;&#27861;&#12290; &#24456;&#24555;&#65292;&#36825;&#20010;&#23450;&#21046;&#30340;Linux&#31995;&#32479;&#19981;&#20165;&#28385;&#36275;&#29992;&#25143;&#30340;&#29305;&#27530;&#38656;&#27714;&#65292; &#32780;&#19988;&#20063;&#32473;&#31243;&#24207;&#21592;&#21644;&#31995;&#32479;&#31649;&#29702;&#21592;&#25552;&#20379;&#20102;&#19968;&#20010;&#25552;&#39640;Linux&#25216;&#33021;&#30340;&#26426;&#20250;&#12290; &#30001;&#20110;&#36825;&#26679;&#31649;&#39277;&#30340;&#20852;&#36259;&#65292; <em>Linux   From Scratch            &#39033;&#30446;&#35806;&#29983;&#20102;&#12290;</em> </p>
      <p>&#36825;&#26412; Linux From Scratch   &#25991;&#26723;&#32473;&#35835;&#32773;&#25552;&#20379;&#20102;&#35774;&#35745;&#24182;&#24314;&#26500;&#33258;&#23450;&#20041;&#30340;Linux&#31995;&#32479;&#30340;&#32972;&#26223;&#30693;&#35782;&#21644;&#36807;&#31243;&#25351;&#23548;&#12290;&#26412;&#20070;&#30340;&#37325;&#28857;&#26159;Linux From   Scratch&#36825;&#20010;&#39033;&#30446;&#20197;&#21450;&#20351;&#29992;LFS&#31995;&#32479;&#24102;&#26469;&#30340;&#22909;&#22788;&#12290; &#29992;&#25143;&#21487;&#20197;&#25511;&#21046;&#31995;&#32479;&#30340;&#25152;&#26377;&#29305;&#24449;&#65292; &#21253;&#25324;&#30446;&#24405;&#24067;&#23616;&#12289; &#33050;&#26412;&#35774;&#32622;&#21644;&#23433;&#20840;&#35774;&#32622;&#31561;&#31561;&#12290; &#26368;&#32456;&#30340;&#31995;&#32479;&#23558;&#20174;&#28304;&#20195;&#30721;&#30452;&#25509;&#32534;  &#35793;&#20135;&#29983;&#65292; &#29992;&#25143;&#21487;&#20197;&#25351;&#23450;&#22312;&#21738;&#37324;&#23433;&#35013;&#12289; &#20026;&#20160;&#20040;&#23433;&#35013;&#21450;&#24590;&#26679;&#23433;&#35013;&#27599;&#19968;&#20010;&#31243;&#24207;&#12290; &#26412;&#20070;&#20351;&#24471;&#35835;&#32773;&#21487;&#20197;&#23436;&#20840;&#25353;&#29031;&#33258;&#24049;&#30340;&#38656;&#27714;&#35746;&#21046;&#20182;&#20204;&#30340;Linux&#31995;&#32479;&#65292; &#32780;&#19988;&#20351;&#29992;&#25143;&#23545;&#20182;&#20204;&#30340;&#31995;  &#32479;&#26377;&#26356;&#22810;&#30340;&#25511;&#21046;&#26435;&#12290;</p>
      <p> &#24076;&#26395;&#24744;&#22312;&#33258;&#24049;&#30340; LFS &#31995;&#32479;&#19978;&#24037;&#20316;&#24841;&#24555;&#65292;&#20139;&#21463;&#30495;&#27491;<em>&#23646;&#20110;&#33258;&#24049;&#30340;</em>&#31995;&#32479;&#25152;&#24102;&#26469;&#30340;&#21508;&#31181;&#22909;&#22788;&#12290;</p>
      <div class="literallayout">
        <p>
          --<br />
          Gerard&nbsp;Beekmans<br />
          gerard@linuxfromscratch.org
        </p>
      </div>
    </div>
    <div class="navfooter">
      <ul>
        <li class="prev">
          <a accesskey="p" href="preface.html" title="Preface">&#21518;&#36864;</a>
          <p>
            &#24207;&#35328;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="audience.html" title="Audience">&#21069;&#36827;</a>
          <p>
            &#30446;&#26631;&#35835;&#32773;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="preface.html" title="Preface">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
  </body>
</html>
