<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content=
    "application/xhtml+xml; charset=iso-8859-1" />
    <title>
      Rationale for Packages in the Book
    </title>
    <link rel="stylesheet" href="../stylesheets/lfs.css" type="text/css" />
    <meta name="generator" content="DocBook XSL Stylesheets V1.73.2" />
    <link rel="stylesheet" href="../stylesheets/lfs-print.css" type=
    "text/css" media="print" /></head>
  <body class="lfs" id="lfs-6.6">
    <div class="navheader">
      <h4>
        Linux From Scratch - Version 6.6
      </h4>
      <h3>
        &#24207;&#35328;
      </h3>
      <ul>
        <li class="prev">
          <a accesskey="p" href="standards.html" title=
          "LFS and Standards">&#21518;&#36864;</a>
          <p>
            LFS&#21450;&#26631;&#20934;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="prerequisites.html" title=
          "Prerequisites">&#21069;&#36827;</a>
          <p>
            &#20808;&#20915;&#26465;&#20214;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="preface.html" title="Preface">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
    <div class="sect1" lang="en" xml:lang="en">
      <h1 class="sect1">
        <a id="pre-why" name="pre-why"></a>v. &#20026;&#20309;&#20351;&#29992;&#26412;&#20070;&#36873;&#25321;&#30340;&#36719;&#20214;&#21253;
      </h1>
      <p>
        &#23601;&#20687;&#21069;&#38754;&#25152;&#35828;&#30340;&#65292;LFS &#30340;&#30446;&#26631;&#26159;&#20026;&#20102;&#24314;&#31435;&#19968;&#20010;&#23436;&#25972;&#30340;&#65292;&#22522;&#30784;&#32423;&#30340;&#21487;&#29992;&#31995;&#32479;&#12290; &#36825;&#21253;&#25324;&#22312;&#25552;&#20379;&#19968;&#20010;&#30456;&#23545;&#36739;&#23567;&#30340;&#22522;&#30784;&#31995;&#32479;&#26102;&#65292;&#38656;&#35201;&#20877;&#29983;&#33258;&#24049;&#30340;&#20840;&#37096;&#36719;&#20214;&#21253;&#65292;&#20174;&#36825;&#20010;&#23567;&#22522;&#30784;&#31995;&#32479;&#24320;&#22987;&#65292;&#21487;&#20197;&#25353;&#29031;&#29992;&#25143;&#30340;&#36873;&#25321;&#23450;&#21046;&#19968;&#20010;&#26356;&#23436;&#25972;&#30340;&#31995;&#32479;&#12290;
        &#36825;&#24182;&#19981;&#24847;&#21619;&#30528; LFS &#26159;&#21487;&#33021;&#30340;&#26368;&#23567;&#31995;&#32479;&#12290;&#23427;&#21253;&#25324;&#19968;&#20123;&#37325;&#35201;&#25285;&#19981;&#26159;&#24517;&#38656;&#30340;&#36719;&#20214;&#21253;&#12290;&#19979;&#38754;&#21015;&#20986;&#20102;&#26412;&#20070;&#20013;&#27599;&#20010;&#25991;&#20214;&#21253;&#30340;&#29702;&#30001;&#65306;</p>
      <div class="itemizedlist">
        <ul>
          <li>
            <p>
              Autoconf            </p>
            <p>
              &#27492;&#36719;&#20214;&#21253;&#21253;&#21547;&#20102;&#33021;&#20174;&#24320;&#21457;&#32773;&#27169;&#26495;&#29983;&#25104;&#29992;&#20110;&#33258;&#21160;&#37197;&#32622;&#28304;&#20195;&#30721;&#30340; shell &#33050;&#26412;&#12290; &#23427;&#36890;&#24120;&#38656;&#35201;&#26356;&#26032; &#21518;&#37325;&#24314;&#19968;&#20010;&#36719;&#20214;&#21253;&#26469;&#26500;&#24314;&#31243;&#24207;&#12290;</p>
          </li>
          <li>
            <p>
              Automake            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#20174;&#27169;&#26495;&#29983;&#25104; Make &#25991;&#20214;&#30340;&#31243;&#24207;&#12290; &#23427;&#36890;&#24120;&#38656;&#35201;&#26356;&#26032; &#21518;&#37325;&#24314;&#19968;&#20010;&#36719;&#20214;&#21253;&#26469;&#26500;&#24314;&#31243;&#24207;&#12290;</p>
          </li>
          <li>
            <p>
              Bash            </p>
            <p>
            &#27492;&#21253;&#28385;&#36275; LSB &#26680;&#24515;&#38656;&#27714;&#65292;&#26469;&#20026;&#31995;&#32479;&#25552;&#20379;&#19968;&#20010;Bourne Shell &#25509;&#21475;&#12290; &#20043;&#25152;&#20197;&#36873;&#25321;&#23427;&#65292;&#32780;&#19981;&#26159;&#20854;&#20182;shell &#21253;&#65292;&#26159;&#22240;&#20026;&#23427;&#30340;&#22522;&#26412;shell &#21151;&#33021;&#20043;&#22806;&#30340;&#36890;&#29992;&#21644;&#24615;&#33021;&#12290;</p>
          </li>
          <li>
            <p>
              Binutils            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#20102;&#19968;&#20010;&#38142;&#25509;&#22120;&#65292;&#19968;&#20010;&#27719;&#32534;&#22120;&#21644;&#20854;&#20182;&#22788;&#29702;&#30446;&#26631;&#25991;&#20214;&#30340;&#24037;&#20855;&#12290;</p>
          </li>
          <li>
            <p>
              Bison            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#32534;&#35793;&#20854;&#20182; LFS &#31243;&#24207;&#25152;&#38656;&#35201;&#30340;  yacc (Yet Another
              Compiler Compiler) &#30340;            GNU &#29256; </p>
          </li>
          <li>
            <p>
              Bzip2            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#21387;&#32553;&#21644;&#35299;&#21387;&#32553;&#25991;&#20214;&#30340;&#31243;&#24207;&#12290;&#34987;&#29992;&#26469;&#35299;&#21387;&#32553;&#24456;&#22810; LFS
              &#36719;&#20214;&#21253;&#12290;            </p>
          </li>
          <li>
            <p>
              Coreutils            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#19968;&#20123;&#26174;&#31034;&#21644;&#25805;&#20316;&#25991;&#20214;&#21644;&#30446;&#24405;&#30340;&#24517;&#22791;&#31243;&#24207;&#12290;</p>
          </li>
          <li>
            <p>
              DejaGNU            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#27979;&#35797;&#20854;&#20182;&#31243;&#24207;&#30340;&#26694;&#26550;&#12290;&#23427;&#21482;&#22312;&#20020;&#26102;&#24037;&#20855;&#38142;&#20013;&#23433;&#35013;&#12290;</p>
          </li>
          <li>
            <p>
              Diffutils            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#26174;&#31034;&#20004;&#20010;&#25991;&#20214;&#25110;&#30446;&#24405;&#20043;&#38388;&#24046;&#24322;&#30340;&#31243;&#24207;&#12290;</p>
          </li>
          <li>
            <p>
              Expect            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#19968;&#20010;&#36890;&#36807;&#25191;&#34892;&#33050;&#26412;&#23545;&#35805;&#26694;&#19982;&#20854;&#23427;&#20132;&#20114;&#24335;&#31243;&#24207;&#36890;&#20449;&#30340;&#24037;&#20855;&#12290;&#36890;&#24120;&#29992;&#20110;&#27979;&#35797;&#20854;&#20182;&#36719;&#20214;&#21253;&#12290;&#20165;&#22312;&#20020;&#26102;&#24037;&#20855;&#38142;&#20013;&#23433;&#35013;&#12290; </p>
          </li>
          <li>
            <p>
              E2fsprogs            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#22788;&#29702; ext2, ext3
              &#21644; ext4 &#25991;&#20214;&#31995;&#32479;&#30340;&#24037;&#20855;&#12290;&#36825;&#20123;&#26159; Linux &#25903;&#25345;&#30340;&#26368;&#24120;&#29992;&#65292;&#24182;&#32463;&#36807;&#24443;&#24213;&#27979;&#35797;&#30340;&#25991;&#20214;&#31995;&#32479;&#12290;</p>
          </li>
          <li>
            <p>
              File            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#19968;&#20010;&#21028;&#26029;&#32473;&#23450;&#25991;&#20214;&#31867;&#22411;&#30340;&#24037;&#20855;&#12290;</p>
          </li>
          <li>
            <p>
              Findutils            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#22312;&#25991;&#20214;&#31995;&#32479;&#20013;&#26597;&#25214;&#25991;&#20214;&#30340;&#31243;&#24207;&#12290;</p>
          </li>
          <li>
            <p>
              Flex            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#19968;&#20010;&#33021;&#29983;&#25104;&#35782;&#21035;&#25991;&#26412;&#27169;&#24335;&#30340;&#31243;&#24207;&#30340;&#24037;&#20855;&#12290;&#23427;&#26159; GNU &#29256;&#30340; lex
              (&#35789;&#27861;&#20998;&#26512;&#22120;) &#31243;&#24207;&#12290;&#23427;&#34987;&#29992;&#26469;&#32534;&#35793;&#19968;&#20123;LFS&#36719;&#20214;&#21253;&#12290; </p>
          </li>
          <li>
            <p>
              Gawk            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#22788;&#29702;&#25991;&#26412;&#25991;&#20214;&#30340;&#31243;&#24207;&#12290;&#23427;&#26159; GNU &#29256;&#30340; awk (Aho-Weinberg-Kernighan).            </p>
          </li>
          <li>
            <p>
              Gcc            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547; GNU &#32534;&#35793;&#22120;&#38598;&#21512;&#12290;&#23427;&#21253;&#25324; C
              &#21644; C++ &#21450;&#19968;&#20123;&#27809;&#26377;&#34987; LFS &#32534;&#35793;&#30340;&#32534;&#35793;&#22120;&#12290;</p>
          </li>
          <li>
            <p>
              GDBM            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547; GNU &#25968;&#25454;&#24211;&#31649;&#29702;&#22120;&#12290;&#23427;&#34987;&#21478;&#19968;&#20010; LFS &#36719;&#20214;&#21253;&#65288; Man-DB&#65289;&#20351;&#29992;            </p>
          </li>
          <li>
            <p>
              Gettext            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#29992;&#20110;&#35768;&#22810;&#36719;&#20214;&#21253;&#30340;&#22269;&#38469;&#21270;&#21644;&#26412;&#22320;&#21270;&#30340;&#24037;&#20855;&#21644;&#24211;&#12290;</p>
          </li>
          <li>
            <p>
              Glibc            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#20027;&#35201;&#30340; C &#24211;&#12290;&#27809;&#26377;&#23427; Linux &#31243;&#24207;&#23601;&#19981;&#33021;&#36816;&#34892;&#12290;</p>
          </li>
          <li>
            <p>
              GMP            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#25968;&#23398;&#24211;&#65292;&#23427;&#20204;&#20026;&#20219;&#24847;&#31934;&#24230;&#35745;&#31639;&#25552;&#20379;&#20102;&#26377;&#29992;&#30340;&#20989;&#25968;&#12290; &#32534;&#35793;Gcc&#26102;&#38656;&#35201;&#23427;&#12290;</p>
          </li>
          <li>
            <p>
              Grep            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#22312;&#25991;&#20214;&#20013;&#25628;&#32034;&#30340;&#31243;&#24207;&#12290;</p>
          </li>
          <li>
            <p>
              Groff            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#36719;&#20214;&#21253;&#21253;&#21547;&#20960;&#20010;&#22788;&#29702;&#21644;&#26684;&#24335;&#21270;&#25991;&#26412;&#30340;&#31243;&#24207;&#12290;&#36825;&#20123;&#31243;&#24207;&#30340;&#19968;&#20010;&#37325;&#35201;&#21151;&#33021;&#26159;&#26684;&#24335;&#21270; man
              &#25163;&#20876;&#39029;&#12290;            </p>
          </li>
          <li>
            <p>
              GRUB            </p>
            <p>
              &#27492;&#21253;&#26159; Grand &#32479;&#19968;&#24341;&#23548;&#35013;&#36733;&#31243;&#24207;&#12290;&#23427;&#26159;&#20960;&#20010;&#21487;&#29992;&#30340;&#24341;&#23548;&#35013;&#36733;&#31243;&#24207;&#20043;&#19968;&#65292;&#20294;&#23427;&#26159;&#26368;&#28789;&#27963;&#30340;&#12290;</p>
          </li>
          <li>
            <p>
              Gzip            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#21387;&#32553;&#21644;&#35299;&#21387;&#32553;&#25991;&#20214;&#30340;&#31243;&#24207;&#12290;</p>
          </li>
          <li>
            <p>
              Iana-etc            </p>
            <p>
              &#27492;&#21253;&#20026;&#32593;&#32476;&#26381;&#21153;&#21644;&#21327;&#35758;&#25552;&#20379;&#25968;&#25454;&#12290;&#23427;&#38656;&#35201;&#21551;&#29992;&#27491;&#30830;&#30340;&#32593;&#32476;&#21151;&#33021;&#12290;</p>
          </li>
          <li>
            <p>
              Inetutils            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#22522;&#26412;&#30340;&#32593;&#32476;&#31649;&#29702;&#30340;&#31243;&#24207;&#12290;</p>
          </li>
          <li>
            <p>
              IProute2            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#22522;&#26412;&#30340;&#21644;&#39640;&#32423;&#30340;&#22522;&#20110;IPv4 &#21644;
              IPv6 &#32593;&#32476;&#30340;&#31243;&#24207;&#12290; &#36873;&#25321;&#23427;&#32780;&#19981;&#26159;&#20854;&#20182;&#36890;&#29992;&#30340;&#32593;&#32476;&#24037;&#20855;&#36719;&#20214;&#21253;&#65288;net-tools&#65289;&#26159;&#22240;&#20026;&#23427;&#30340; IPv6 &#24615;&#33021;&#12290;            </p>
          </li>
          <li>
            <p>
              Kbd            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#38750;&#32654;&#22269;&#38190;&#30424;&#30340;&#38190;&#30424;&#26144;&#23556;&#34920;&#21644;&#38190;&#30424;&#24037;&#20855;&#12290;</p>
          </li>
          <li>
            <p>
              Less            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#19968;&#20010;&#24456;&#22909;&#29992;&#30340;&#25991;&#26412;&#25991;&#20214;&#26597;&#30475;&#22120;&#65292;&#22312;&#26174;&#31034;&#25991;&#20214;&#30340;&#20869;&#23481;&#26102;&#20801;&#35768;&#19978;&#19979;&#28378;&#23631;&#12290;</p>
          </li>
          <li>
            <p>
              Libtool            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547; GNU &#36890;&#29992;&#24211;&#25903;&#25345;&#33050;&#26412;&#12290;&#23427;&#23558;&#20351;&#29992;&#20849;&#20139;&#24211;&#30340;&#22797;&#26434;&#24615;&#23553;&#35013;&#21040;&#32479;&#19968;&#30340;&#65292;&#21487;&#31227;&#26893;&#30340;&#25509;&#21475;&#12290;&#22312;&#20854;&#20182;&#30340; LFS &#36719;&#20214;&#21253;&#27979;&#35797;&#24037;&#20855;&#20013;&#38656;&#35201;&#23427;&#12290;</p>
          </li>
          <li>
            <p>
              Linux Kernel            </p>
            <p>
              &#27492;&#21253;&#26159;&#25805;&#20316;&#31995;&#32479;&#12290;&#23427;&#26159; GNU/Linux &#29615;&#22659;&#20013;&#30340; Linux&#12290;</p>
          </li>
          <li>
            <p>
              M4            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#19968;&#20010;&#36890;&#29992;&#30340;&#25991;&#26412;&#23439;&#22788;&#29702;&#22120;&#65292;&#29992;&#20110;&#20026;&#20854;&#20182;&#31243;&#24207;&#32534;&#35793;&#24037;&#20855;&#12290;</p>
          </li>
          <li>
            <p>
              Make            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#19968;&#20010;&#30452;&#25509;&#32534;&#35793;&#36719;&#20214;&#21253;&#30340;&#31243;&#24207;&#12290;LFS &#20013;&#20960;&#20046;&#27599;&#20010;&#36719;&#20214;&#21253;&#37117;&#38656;&#35201;&#23427;&#12290;</p>
          </li>
          <li>
            <p>
              Man-DB            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#26597;&#25214;&#21644;&#26174;&#31034; man &#25163;&#20876;&#39029;&#30340;&#31243;&#24207;&#12290;&#36873;&#25321;&#23427;&#20195;&#26367; man &#36719;&#20214;&#21253;&#26159;&#30001;&#20110;&#23427;&#21331;&#36234;&#30340;&#22269;&#38469;&#21270;&#33021;&#21147;&#12290;&#23427;&#25552;&#20379;&#20102; man &#31243;&#24207;&#12290;</p>
          </li>
          <li>
            <p>
              Man-pages            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#22522;&#26412;&#30340; Linux man &#25163;&#20876;&#39029;&#30340;&#23454;&#38469;&#20869;&#23481;&#12290;</p>
          </li>
          <li>
            <p>
              Module-Init-Tools            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#31649;&#29702; Linux &#20869;&#26680;&#27169;&#22359;&#25152;&#38656;&#30340;&#31243;&#24207;&#12290;</p>
          </li>
          <li>
            <p>
              MPFR            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#29992;&#20110;&#22810;&#20493;&#31934;&#24230;&#36816;&#31639;&#30340;&#20989;&#25968;&#12290;Gcc &#38656;&#35201;&#23427;&#12290;</p>
          </li>
          <li>
            <p>
              Ncurses            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#23383;&#31526;&#32456;&#31471;&#22788;&#29702;&#24211;&#12290;&#23427;&#36890;&#24120;&#29992;&#20110;&#25552;&#20379;&#19968;&#20010;&#33756;&#21333;&#31995;&#32479;&#30340;&#28216;&#26631;&#25511;&#21046;&#12290; </p>
          </li>
          <li>
            <p>
              Patch            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#19968;&#20010;&#26681;&#25454;<span class="emphasis"><em>&#34917;&#19969;</em></span>&#25991;&#20214;&#26469;&#20462;&#25913;&#25110;&#24314;&#31435;&#25991;&#20214;&#30340;&#31243;&#24207;&#65292;&#34917;&#19969;&#25991;&#20214;&#36890;&#24120;&#26159;&#29992; <span class="application">diff</span><strong> </strong>&#31243;&#24207;&#21019;&#24314;&#30340;&#12290; &#19968;&#20123; LFS &#36719;&#20214;&#21253;&#30340;&#32534;&#35793;&#36807;&#31243;&#20250;&#38656;&#35201;&#23427;&#12290;</p>
          </li>
          <li>
            <p>
              Perl            </p>
            <p>
              &#27492;&#21253;&#26159;&#36816;&#34892;&#26102;&#35821;&#35328; PERL &#30340;&#35299;&#37322;&#31243;&#24207;&#12290;</p>
          </li>
          <li>
            <p>
              Pkg-config            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#19968;&#20010;&#24037;&#20855;&#65292;&#23427;&#22312;&#37197;&#32622;&#21644;&#32534;&#35793;&#21487;&#25191;&#34892;&#25991;&#20214;&#30340;&#36807;&#31243;&#20013;&#65292;&#36890;&#36807;include&#30446;&#24405;&#21644;/&#25110; library&#30446;&#24405;&#26500;&#24314;&#24037;&#20855;&#12290;&#24456;&#22810; LFS &#36719;&#20214;&#21253;&#37117;&#38656;&#35201;&#23427;&#12290;</p>
          </li>
          <li>
            <p>
              Procps            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#29992;&#20110;&#30417;&#35270;&#31995;&#32479;&#36827;&#31243;&#30340;&#31243;&#24207;&#12290;</p>
          </li>
          <li>
            <p>
              Psmisc            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#29992;&#20110;&#26174;&#31034;&#36827;&#31243;&#20449;&#24687;&#30340;&#31243;&#24207;&#12290;</p>
          </li>
          <li>
            <p>
              Readline            </p>
            <p>
              &#27492;&#21253;&#26159;&#19968;&#20010;&#25552;&#20379;&#21629;&#20196;&#34892;&#32534;&#36753;&#21644;&#21382;&#21490;&#32426;&#24405;&#21151;&#33021;&#30340;&#24211;&#38598;&#21512;&#12290;&#23427;&#34987;  Bash &#20351;&#29992;&#12290;           </p>
          </li>
          <li>
            <p>
              Sed            </p>
            <p>
              &#27492;&#21253;&#20801;&#35768;&#22312;&#27809;&#26377;&#29992;&#32534;&#36753;&#22120;&#25171;&#24320;&#30340;&#24773;&#20917;&#19979;&#32534;&#36753;&#25991;&#26412;&#25991;&#20214;&#12290;&#22823;&#22810;&#25968; LFS &#36719;&#20214;&#21253;&#37197;&#32622;&#33050;&#26412;&#20063;&#38656;&#35201;&#23427;&#12290;</p>
          </li>
          <li>
            <p>
              Shadow            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#22312;&#23433;&#20840;&#26041;&#24335;&#19979;&#22788;&#29702;&#23494;&#30721;&#30340;&#31243;&#24207;&#12290;</p>
          </li>
          <li>
            <p>
              Sysklogd            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#35760;&#24405;&#31995;&#32479;&#26085;&#24535;&#30340;&#31243;&#24207;&#65292;&#27604;&#22914;&#20869;&#26680;&#25110;&#23432;&#25252;&#36827;&#31243;&#22788;&#29702;&#24847;&#22806;&#20107;&#21153;&#30340;&#26085;&#24535;&#12290;              </p>
          </li>
          <li>
            <p>
              Sysvinit            </p>
            <p>
              &#27492;&#21253;&#25552;&#20379; init &#31243;&#24207;&#65292;&#23427;&#26159;Linux&#31995;&#32479;&#19978;&#25152;&#26377;&#20854;&#20182;&#36827;&#31243;&#30340;&#29238;&#36827;&#31243;&#12290;            </p>
          </li>
          <li>
            <p>
              Tar            </p>
            <p>
              &#27492;&#21253;&#20026; LFS &#20013;&#20351;&#29992;&#30340;&#20960;&#20046;&#25152;&#26377;&#36719;&#20214;&#21253;&#25552;&#20379;&#24402;&#26723;&#21644;&#23637;&#24320;&#21151;&#33021;&#12290;</p>
          </li>
          <li>
            <p>
              Tcl            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;LFS &#36719;&#20214;&#21253;&#20013;&#24456;&#22810;&#27979;&#35797;&#32452;&#20214;&#20250;&#29992;&#21040;&#30340;&#24037;&#20855;&#21629;&#20196;&#35821;&#35328;&#65288;Tool Command Language&#65289;&#12290; &#23427;&#20165;&#22312;&#20020;&#26102;&#24037;&#20855;&#38142;&#20013;&#23433;&#35013;&#12290;</p>
          </li>
          <li>
            <p>
              Texinfo            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#29992;&#20110;&#35835;&#21462;&#12289;&#20889;&#20837;&#12289;&#36716;&#25442; Info &#25991;&#26723;&#30340;&#31243;&#24207;&#12290;&#23427;&#29992;&#20110;&#24456;&#22810; LFS &#36719;&#20214;&#21253;&#30340;&#23433;&#35013;&#36807;&#31243;&#12290;</p>
          </li>
          <li>
            <p>
              Udev            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#29992;&#20110;&#21160;&#24577;&#24314;&#31435;&#35774;&#22791;&#33410;&#28857;&#30340;&#31243;&#24207;&#12290; &#23427;&#26159;&#22312; /dev &#30446;&#24405;&#19979;&#21019;&#24314;&#25968;&#20197;&#21315;&#35745;&#38745;&#24577;&#35774;&#22791;&#30340;&#19968;&#20010;&#26367;&#20195;&#21697;&#12290;            </p>
          </li>
          <li>
            <p>
              Util-linux-ng            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#24456;&#22810;&#24037;&#20855;&#31243;&#24207;&#12290; &#20854;&#20013;&#21253;&#25324;&#22788;&#29702;&#25991;&#20214;&#31995;&#32479;&#65292;&#25511;&#21046;&#21488;&#65292;&#20998;&#21306;&#21644;&#26085;&#24535;&#30340;&#24037;&#20855;            </p>
          </li>
          <li>
            <p>
              Vim            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#19968;&#20010;&#32534;&#36753;&#22120;&#12290;&#20043;&#25152;&#20197;&#36873;&#25321;&#23427;&#65292;&#26159;&#22240;&#20026;&#23427;&#19982;&#32463;&#20856;&#30340; vi &#32534;&#36753;&#22120;&#20860;&#23481;&#65292;&#20197;&#21450;&#23427;&#22823;&#37327;&#24378;&#22823;&#30340;&#21151;&#33021;&#12290;&#23545;&#24456;&#22810;&#29992;&#25143;&#26469;&#35828;&#65292;&#32534;&#36753;&#22120;&#26159;&#38750;&#24120;&#20010;&#24615;&#21270;&#30340;&#36873;&#25321;&#65292; &#22914;&#26524;&#38656;&#35201;&#65292;&#20320;&#21487;&#20197;&#23558;&#23427;&#26367;&#25442;&#25104;&#20219;&#20309;&#20854;&#20182;&#30340;&#32534;&#36753;&#22120;&#12290;</p>
          </li>
          <li>
            <p>
              Zlib            </p>
            <p>
              &#27492;&#21253;&#21253;&#21547;&#29992;&#20110;&#19968;&#20123;&#31243;&#24207;&#30340;&#21387;&#32553;&#21644;&#35299;&#21387;&#32553;&#24037;&#20855;&#12290;</p>
          </li>
        </ul>
      </div>
    </div>
    <div class="navfooter">
      <ul>
        <li class="prev">
          <a accesskey="p" href="standards.html" title=
          "LFS and Standards">&#21518;&#36864;</a>
          <p>
            LFS&#21450;&#26631;&#20934;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="prerequisites.html" title=
          "Prerequisites">&#21069;&#36827;</a>
          <p>
            &#20808;&#20915;&#26465;&#20214;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="preface.html" title="Preface">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
  </body>
</html>
