<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content=
    "application/xhtml+xml; charset=iso-8859-1" />
    <title>
      1.1.&nbsp;How to Build an LFS System
    </title>
    <link rel="stylesheet" href="../stylesheets/lfs.css" type="text/css" />
    <meta name="generator" content="DocBook XSL Stylesheets V1.73.2" />
    <link rel="stylesheet" href="../stylesheets/lfs-print.css" type=
    "text/css" media="print" />
  </head>
  <body class="lfs" id="lfs-6.6">
    <div class="navheader">
      <h4>
        Linux From Scratch - Version 6.6
      </h4>
      <h3>
        Chapter&nbsp;1.&nbsp;&#20171;&#32461;
      </h3>
      <ul>
        <li class="prev">
          <a accesskey="p" href="chapter01.html" title=
          "Introduction">&#21518;&#36864;</a>
          <p>
            &#20171;&#32461;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="whatsnew.html" title=
          "What's new since the last release">&#21069;&#36827;</a>
          <p>
            &#19982;&#19978;&#19968;&#29256;&#26377;&#20160;&#20040;&#19981;&#21516;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter01.html" title=
          "Chapter&nbsp;1.&nbsp;Introduction">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
    <div class="sect1" lang="en" xml:lang="en">
      <h1 class="sect1">
        <a id="ch-intro-how" name="ch-intro-how"></a>1.1. &#22914;&#20309;&#26500;&#24314;LFS&#31995;&#32479;
      </h1>
      <p>
        &#25105;&#20204;&#23558;&#29992;&#19968;&#20010;&#24050;&#23433;&#35013;&#22909;&#30340;Linux&#21457;&#24067;&#29256; (&#27604;&#22914; Debian, Mandriva, Red Hat, &#25110; SUSE) &#26469;&#26500;&#24314;LFS&#31995;&#32479;&#12290;&#36825;&#20010;&#29616;&#26377;&#30340;Linux&#31995;&#32479;&#65288;&#23487;&#20027;&#31995;&#32479;&#65289;&#23558;&#20316;&#20026;&#36215;&#28857;&#26469;&#25552;&#20379;&#21253;&#25324;&#32534;&#35793;&#22120;&#65292; &#38142;&#25509;&#22120;&#21644;shell&#65292;&#31561;&#26500;&#24314;&#26032;&#31995;&#32479;&#30340;&#24517;&#35201;&#31243;&#24207;&#12290;&#22312;&#23433;&#35013;&#36825;&#20010;&#21457;&#24067;&#29256;&#26102;&#65292;&#36873;&#25321;&ldquo;&#24320;&#21457;/&#32534;&#31243;&rdquo;&#36873;&#39033;&#65292; &#20197;&#20415;&#21487;&#20197;&#35775;&#38382;&#36825;&#20123;&#24037;&#20855;&#12290; </p>
      <p>&#21478;&#19968;&#31181;&#36873;&#25321;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992; Linux From Scratch&#30340; LiveCD &#25110;&#21830;&#19994;&#21457;&#24067;&#29256;&#30340;          LiveCD&#12290;LFS LiveCD   &#26159;&#19968;&#20010;&#24456;&#22909;&#30340;&#23487;&#20027;&#31995;&#32479;&#65292;&#23427;&#25552;&#20379;&#20102;&#25353;&#29031;&#26412;&#20070;&#25104;&#21151;&#26500;&#24314;LFS&#31995;&#32479;&#30340;&#25152;&#26377;&#24037;&#20855;&#12290;&#36951;&#25022;&#30340;&#26159;&#65292; &#26368;&#36817;&#27809;&#26377;&#24320;&#21457;&#26032;&#30340;          LiveCD&#65292;&#23427;&#21482;&#21253;&#21547;&#32769;&#29256;&#26412;&#30340;&#36164;&#28304;&#36719;&#20214;&#21253;&#21644;&#34917;&#19969;&#65288;&#36825;&#20010;&#29256;&#26412;&#27809;&#26377;&#26631;&#35760;&ldquo;-nosrc&rdquo;  &#25110;          &ldquo;-min&rdquo;&#65289;&#21644;&#26412;&#20070;&#12290;&#24819;&#35201;&#26356;&#22810;&#30340;&#20851;&#20110; LFS   LiveCD&#30340;&#20449;&#24687;&#65292;&#25110;&#24819;&#19979;&#36733;&#23427;&#65292;&#35831;&#35775;&#38382;&#65306; <a class="ulink" href=
        "http://www.linuxfromscratch.org/livecd/">http://www.linuxfromscratch.org/livecd/</a>.      </p>
      <div class="admon note">
        <img alt="[Note]" src="../images/note.png" />
        <h3>&#22791;&#27880;</h3>
        <p> LFS LiveCD &#22312;&#36739;&#26032;&#30340;&#30828;&#20214;&#37197;&#32622;&#20013;&#21487;&#33021;&#26080;&#27861;&#24037;&#20316;&#65292; &#19981;&#33021;&#24341;&#23548;&#25110;&#26080;&#27861;&#26816;&#27979;&#26576;&#20123;&#35774;&#22791;&#65292; &#22914;SATA&#30828;&#30424;&#12290; </p>
      </div>
      <p>
        <a class="xref" href="../chapter02/chapter02.html" title=
        "Chapter&nbsp;2.&nbsp;Preparing a New Partition">Chapter 2</a> &#34920;&#36848;&#20102;&#24590;&#26679;&#24314;&#31435;&#19968;&#20010;&#26032;&#30340;Linux&#26412;&#22320;&#20998;&#21306;&#21644;&#25991;&#20214;&#31995;&#32479;&#65292; &#26032;&#30340;LFS&#31995;&#32479;&#23558;&#22312;&#35813;&#20998;&#21306;&#19978;&#32534;&#35793;&#21644;&#23433;&#35013;&#12290; <a class="xref" href=
        "../chapter03/chapter03.html" title=
        "Chapter&nbsp;3.&nbsp;Packages and Patches">Chapter 3</a> &#35299;&#37322;&#26500;&#24314;LFS&#31995;&#32479;&#25152;&#38656;&#19979;&#36733;&#30340;&#36719;&#20214;&#21253;&#21644;&#34917;&#19969;&#65292; &#20197;&#21450;&#22914;&#20309;&#23558;&#23427;&#20204;&#20445;&#23384;&#21040;&#26032;&#30340;&#25991;&#20214;&#31995;&#32479;&#19978;&#12290; <a class="xref"
        href="../chapter04/chapter04.html" title=
        "Chapter&nbsp;4.&nbsp;Final Preparations">Chapter 4</a> &#35752;&#35770;&#24314;&#31435;&#19968;&#20010;&#36866;&#24403;&#30340;&#24037;&#20316;&#29615;&#22659;&#12290;&#35831;&#20180;&#32454;&#38405;&#35835; <a class=
        "xref" href="../chapter04/chapter04.html" title=
        "Chapter&nbsp;4.&nbsp;Final Preparations">Chapter 4</a> &#22240;&#20026;&#23427;&#35752;&#35770;&#20102;&#22312;&#24320;&#22987;  <a class="xref" href=
        "../chapter05/chapter05.html" title=
        "Chapter&nbsp;5.&nbsp;Constructing a Temporary System">Chapter 5</a>
        &#20043;&#21069;&#21450;&#20197;&#21518;&#30340;&#24037;&#20316;&#20013;&#20320;&#24212;&#35813;&#30693;&#36947;&#30340;&#19968;&#20123;&#37325;&#35201;&#38382;&#39064;&#12290;      </p>
      <p>
        <a class="xref" href="../chapter05/chapter05.html" title=
        "Chapter&nbsp;5.&nbsp;Constructing a Temporary System">Chapter 5</a>
        &#35299;&#37322;&#20102;&#32452;&#25104;&#22522;&#30784;&#24320;&#21457;&#24037;&#20855;&#65288;&#24037;&#20855;&#38142;&#65289;&#25152;&#38656;&#30340;&#19968;&#20123;&#36719;&#20214;&#21253;&#30340;&#23433;&#35013;&#12290;&#35813;&#24037;&#20855;&#38142;&#23558;&#29992;&#26469;&#22312; <a class="xref" href="../chapter06/chapter06.html"
        title="Chapter&nbsp;6.&nbsp;Installing Basic System Software">Chapter
        6</a> &#26500;&#24314;&#19968;&#20010;&#30495;&#23454;&#31995;&#32479;&#12290;&#36825;&#20123;&#36719;&#20214;&#21253;&#20013;&#65292;&#26377;&#20123;&#38656;&#35201;&#35299;&#20915;&#24490;&#29615;&#20381;&#36182;&#38382;&#39064;--&#20363;&#22914;&#65292; &#35201;&#32534;&#35793;&#19968;&#20010;&#32534;&#35793;&#22120;&#65292;&#20320;&#39318;&#20808;&#38656;&#35201;&#19968;&#20010;&#32534;&#35793;&#22120;&#12290;</p>
      <p>
        <a class="xref" href="../chapter05/chapter05.html" title=
        "Chapter&nbsp;5.&nbsp;Constructing a Temporary System">Chapter 5</a>
        &#20063;&#35753;&#24744;&#30475;&#21040;&#22914;&#20309;&#31532;&#19968;&#36941;&#32534;&#35793;&#24037;&#20855;&#38142;&#65292;&#21253;&#25324;Binutils &#21644; GCC   (&#31532;&#19968;&#36941;&#32534;&#35793;&#30340;&#24847;&#24605;&#23601;&#26159;&#36825;&#20004;&#20010;&#26680;&#24515;&#36719;&#20214;&#21253;&#36824;&#35201;&#37325;&#26032;&#32534;&#35793;)&#12290;&#19979;&#19968;&#27493;&#26159;&#32534;&#35793; C &#30340;&#36816;&#34892;&#24211;Glibc&#12290;
        Glibc &#20250;&#29992;&#31532;&#19968;&#36941;&#32534;&#35793;&#30340;&#24037;&#20855;&#38142;&#32534;&#35793;&#12290;&#28982;&#21518;&#65292;&#23558;&#31532;&#20108;&#36941;&#32534;&#35793;&#24037;&#20855;&#38142;&#12290;&#36825;&#26102;&#65292; &#24037;&#20855;&#38142;&#23558;&#20877;&#27425;&#21160;&#24577;&#38142;&#25509;&#21040;&#21018;&#32534;&#35793;&#30340;Glibc&#19978;&#12290;<a class="xref" href=
        "../chapter05/chapter05.html" title=
        "Chapter&nbsp;5.&nbsp;Constructing a Temporary System">Chapter 5</a>&#21097;&#19979;&#30340;&#36719;&#20214;&#21253;&#23558;&#29992;&#31532;&#20108;&#36941;&#21464;&#24322;&#30340;&#24037;&#20855;&#38142;&#32534;&#35793;&#12290; &#23436;&#25104;&#36825;&#20123;&#24037;&#20316;&#21518;&#65292; LFS&#30340;&#23433;&#35013;&#38500;&#20102;&#27491;&#22312;&#36816;&#34892;&#30340;&#20869;&#26680;&#22806;&#65292; &#23558;&#19981;&#20877;&#20381;&#38752;&#23487;&#20027;&#31995;&#32479;&#12290;</p>
      <p>
        &#20026;&#20102;&#20174;&#23487;&#20027;&#31995;&#32479;&#20998;&#31163;&#20986;&#26032;&#31995;&#32479;&#65292;&#30475;&#36215;&#26469;&#35201;&#20570;&#24456;&#22810;&#24037;&#20316;&#12290;&#20851;&#20110;&#20026;&#20160;&#20040;&#35201;&#36825;&#26679;&#20570;&#65292;<a class="xref" href=
        "../chapter05/toolchaintechnotes.html" title=
        "5.2.&nbsp;Toolchain Technical Notes">Section&nbsp;5.2,
        &ldquo;&#24037;&#20855;&#38142;&#25216;&#26415;&#35828;&#26126;&rdquo;</a> &#25552;&#20379;&#20102;&#19968;&#20221;&#23436;&#25972;&#30340;&#25216;&#26415;&#35828;&#26126;&#12290;</p>
      <p>
        &#22312; <a class="xref" href="../chapter06/chapter06.html" title=
        "Chapter&nbsp;6.&nbsp;Installing Basic System Software">Chapter
        6</a> &#20013;&#65292;&#23558;&#26500;&#24314;&#19968;&#20010;&#23436;&#25972;&#30340;LFS&#31995;&#32479;&#12290;<span class=
        "command"><strong>chroot</strong></span> (&#25913;&#21464; root) &#31243;&#24207;&#34987;&#29992;&#20110;&#36827;&#20837;&#19968;&#20010;&#34394;&#25311;&#29615;&#22659;&#65292; &#24182;&#21551;&#21160;&#19968;&#20010;&#26032;&#30340;shell&#65292;&#20854;&#36319;&#30446;&#24405;&#35774;&#32622;&#22312;LFS &#20998;&#21306;&#12290;&#36825;&#24456;&#31867;&#20284;&#20110;&#37325;&#26032;&#21551;&#21160;&#65292;&#24182;&#35753;&#20869;&#26680;&#35013;&#36733;LFS&#20998;&#21306;&#20316;&#20026;&#26681;&#20998;&#21306;&#12290;&#31995;&#32479;&#24182;&#27809;&#26377;&#30495;&#30340;&#37325;&#21551;&#65292; &#32780;&#26159;&#30001;chroot&#26367;&#20195;&#20102;&#65292;&#22240;&#20026;&#21019;&#24314;&#19968;&#20010;&#21487;&#21551;&#21160;&#30340;&#31995;&#32479;&#38656;&#35201;&#20570;&#20294;&#29616;&#22312;&#36824;&#19981;&#38656;&#35201;  &#20570;&#30340;&#39069;&#22806;&#24037;&#20316;&#12290;&#20027;&#35201;&#30340;&#26377;&#22909;&#22788;&#26159;&#65292;&#22312;&#21019;&#24314;LFS&#31995;&#32479;&#26102;&#65292;&ldquo;chrooting&rdquo;&#20801;&#35768;&#20320;&#32487;&#32493;&#20351;&#29992;&#23487;&#20027;&#31995;&#32479;&#12290; &#22312;&#31561;&#24453;&#36719;&#20214;&#21253;&#32534;&#35793;&#23436;&#25104;&#30340;&#26102;&#20505;&#65292;&#20320;&#21487;&#20197;&#20687;&#24179;&#24120;&#19968;&#26679;&#65292;&#32487;  &#32493;&#20351;&#29992;&#20320;&#30340;&#30005;&#33041;&#12290;</p>
      <p>
        &#20026;&#20102;&#23436;&#25104;&#23433;&#35013;&#65292;<a class="xref" href="../chapter07/chapter07.html" title=
        "Chapter&nbsp;7.&nbsp;Setting Up System Bootscripts">Chapter 7</a>
        &#35774;&#32622;&#20102;&#21551;&#21160;&#33050;&#26412;&#65292; <a class="xref" href=
        "../chapter08/chapter08.html" title=
        "Chapter&nbsp;8.&nbsp;Making the LFS System Bootable">Chapter 8</a> &#26159;&#20869;&#26680;&#21644;&#21551;&#21160;&#24341;&#23548;&#31243;&#24207;&#65292;<a class="xref" href="../chapter09/chapter09.html" title=
        "Chapter&nbsp;9.&nbsp;The End">Chapter 9</a>&#21253;&#21547;&#20102;&#26412;&#20070;&#20043;&#22806;&#65292;&#33719;&#24471;&#36827;&#19968;&#27493;LFS&#32463;&#39564;&#30340;&#20449;&#24687;&#12290;&#26412;&#20070;&#30340;&#25152;&#26377;&#27493;&#39588;&#34987;&#25191;&#34892;&#20197;&#21518;&#65292; &#35745;&#31639;&#26426;&#23601;&#20934;&#22791;&#22909;&#37325;&#21551;&#36827;&#20837;&#26032;&#30340;LFS&#31995;&#32479;&#20102;&#12290; </p>
      <p>&#36825;&#26159;&#27010;&#25324;&#30340;&#36807;&#31243;&#12290;&#22312;&#20197;&#21518;&#30340;&#31456;&#33410;&#21644;&#36719;&#20214;&#21253;&#20013;&#65292;&#35752;&#35770;&#20102;&#27599;&#19968;&#27493;&#30340;&#32454;&#33410;&#12290;&#30475;&#20284;&#22797;&#26434;&#30340;&#39033;&#30446;&#23558;&#26356;&#28165;&#26224;&#65292; &#38543;&#30528;&#20320;&#36367;&#19978;LFS&#20882;&#38505;&#20043;&#26053;&#65292;&#19968;&#20999;&#37117;&#20250;&#27700;&#21040;&#28192;&#25104;</p>
    </div>
    <div class="navfooter">
      <ul>
        <li class="prev">
          <a accesskey="p" href="chapter01.html" title=
          "Introduction">&#21518;&#36864;</a>
          <p>
            &#20171;&#32461;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="whatsnew.html" title=
          "What's new since the last release">&#21069;&#36827;</a>
          <p>
            &#19982;&#19978;&#19968;&#29256;&#26377;&#20160;&#20040;&#19981;&#21516;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter01.html" title=
          "Chapter&nbsp;1.&nbsp;Introduction">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
  </body>
</html>
