<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content=
    "application/xhtml+xml; charset=iso-8859-1" />
    <title>
      5.2.&nbsp;Toolchain Technical Notes
    </title>
    <link rel="stylesheet" href="../stylesheets/lfs.css" type="text/css" />
    <meta name="generator" content="DocBook XSL Stylesheets V1.73.2" />
    <link rel="stylesheet" href="../stylesheets/lfs-print.css" type=
    "text/css" media="print" /></head>
  <body class="lfs" id="lfs-6.6">
    <div class="navheader">
      <h4>
        Linux From Scratch - Version 6.6
      </h4>
      <h3>
        Chapter&nbsp;5.&nbsp;&#26500;&#24314;&#20020;&#26102;&#31995;&#32479; 
      </h3>
      <ul>
        <li class="prev">
          <a accesskey="p" href="introduction.html" title=
          "Introduction">&#21518;&#36864;</a>
          <p>
            &#20171;&#32461;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="generalinstructions.html" title=
          "General Compilation Instructions">&#21069;&#36827;</a>
          <p>
            &#24120;&#29992;&#32534;&#35793;&#22120;&#29992;&#27861;&#35828;&#26126;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter05.html" title=
          "Chapter&nbsp;5.&nbsp;Constructing a Temporary System">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
    <div class="sect1" lang="en" xml:lang="en">
      <h1 class="sect1">
        <a id="ch-tools-toolchaintechnotes" name=
        "ch-tools-toolchaintechnotes"></a>5.2. &#24037;&#20855;&#38142;&#25216;&#26415;&#35828;&#26126;
      </h1>
      <p>&#26412;&#33410;&#38416;&#36848;&#20102;&#25972;&#20010;&#26500;&#24314;&#26041;&#27861;&#30340;&#19968;&#20123;&#22522;&#26412;&#21407;&#29702;&#21644;&#25216;&#26415;&#32454;&#33410;&#65292; &#24744;&#19981;&#24517;&#39532;&#19978;&#23601;&#29702;&#35299;&#26412;&#33410;&#20013;&#30340;&#25152;&#26377;&#20869;&#23481;&#12290;   &#22312;&#24744;&#23454;&#38469;&#25805;&#20316;&#20043;&#21518;&#65292;&#23601;&#20250;&#20102;&#35299;&#22823;&#22810;&#25968;&#30340;&#19996;&#35199;&#65292;&#24744;&#21487;&#20197;&#22312;&#20219;&#20309;&#26102;&#20505;&#22238;&#39038;&#26412;&#33410;&#12290;</p>
      <p><a class="xref" href="chapter05.html" title=
        "Chapter&nbsp;5.&nbsp;Constructing a Temporary System">Chapter 5</a> &#30340;&#24635;&#20307;&#30446;&#26631;&#26159;&#25552;&#20379;&#19968;&#20010;&#20020;&#26102;&#29615;&#22659;&#65292;&#23427;&#21253;&#21547;&#19968;&#32452;&#24050;&#30693;&#33391;&#22909;&#30340;&#33073;&#31163;&#23487;&#20027;&#31995;&#32479;&#30340;&#24037;&#20855;&#12290; &#20026;&#21019;&#24314;&#19968;&#20010;&#24178;&#20928;&#12289; &#27809;&#26377;&#38382;&#39064;&#30340;&#30446;&#26631;LFS&#31995;&#32479;&#65292;&#36890;&#36807;&#20351;&#29992; <span class="command"><strong>chroot</strong></span>&#65292; &#21097;&#19979;&#31456;&#33410;&#20013;&#30340;&#21629;&#20196;&#23558;&#21253;&#21547;&#22312;&#36825;&#20010;&#29615;&#22659;&#20013;&#12290;&#36825;&#20010;&#21019;&#24314;&#36807;&#31243;&#34987;&#35774;&#35745;&#20026;&#23613;&#37327;&#20943;&#23569;&#26032;&#25163;&#29359;&#38169;&#35823;&#30340;&#21487;&#33021;&#65292; &#21516;&#26102;&#23613;&#21487;&#33021;&#22810;&#30340;&#25552;&#20379;&#25945;&#32946;&#20215;&#20540;&#12290;</p>
      <div class="admon important">
        <img alt="[Important]" src="../images/important.png" />
        <h3>
          &#37325;&#35201;
        </h3>
        <p>&#22312;&#32487;&#32493;&#20043;&#21069;&#65292;&#35201;&#20808;&#30693;&#36947;&#24037;&#20316;&#24179;&#21488;&#30340;&#21517;&#31216;&#65292;&#23601;&#26159;&#25152;&#35859;&#30340;&quot;target triplet&quot;(&#30446;&#26631;&#19977;&#20803;&#32452;)&#65292; &#35201;&#30830;&#23450; target triplet   &#30340;&#21517;&#31216;&#65292; &#26377;&#19968;&#20010;&#31616;&#21333;&#30340;&#26041;&#27861;&#65292; &#23601;&#26159;&#36816;&#34892;&#35768;&#22810;&#28304;&#30721;&#21253;&#37324;&#37117;&#26377;&#30340;<span class=
          "command"><strong> config.guess </strong></span>&#33050;&#26412;&#12290;&#35299;&#24320; Binutils &#30340;&#28304;&#30721;&#21253;&#65292;&#28982;&#21518;&#36816;&#34892;&#33050;&#26412; <strong class=
          "userinput"><code>./config.guess</code></strong>&#24182;&#27880;&#24847;&#36755;&#20986;&#30340;&#20869;&#23481;&#12290;&#20363;&#22914;&#65292; &#26368;&#26032;&#30340;32&#20301;Intel &#22788;&#29702;&#22120;&#30340;&#36755;&#20986;&#31867;&#20284;&#20110; <span class=
          "emphasis"><em>i686-pc-linux-gnu</em></span>&#12290;</p>
        <p>&#24037;&#20316;&#24179;&#21488;&#30340;&#21160;&#24577;&#36830;&#25509;&#22120;&#21517;&#31216;&#20063;&#38656;&#35201;&#30693;&#36947;&#65292;&#36825;&#37324;&#25351;&#30340;&#26159;&#21160;&#24577;&#21152;&#36733;&#22120;(&#19981;&#35201;&#19982; Binutils &#37324;&#30340; &#26631;&#20934;&#36830;&#25509;&#22120; <span class="command"><strong>ld</strong></span>
          &#28151;&#28102;&#20102;)&#12290;&#21160;&#24577;&#36830;&#25509;&#22120;&#30001; Glibc &#25552;&#20379;&#65292; &#29992;&#26469;&#25214;&#21040;&#24182;&#21152;&#36733;&#19968;&#20010; &#31243;&#24207;&#36816;&#34892;&#26102; &#25152;&#38656;&#30340;&#20849;&#20139;&#24211;&#65292; &#22312;&#20570;&#22909;&#31243;&#24207;&#36816;&#34892;&#30340;&#20934;&#22791;&#20043;&#21518;&#65292;&#36816;&#34892;&#36825;&#20010;&#31243;&#24207;&#12290;32&#20301;Intel&#30005;&#33041;&#30340;&#21160;&#24577;&#36830; &#25509;&#22120;&#30340;&#21517;&#31216;&#36890;&#24120;&#26159; <code class=
          "filename">ld-linux.so.2</code>&#12290;&#30830;&#23450;&#36825;&#20010;&#21517;&#31216;&#36824;&#26377;&#19968;&#20010;&#24517;&#26432;&#25216;&#65292; &#23601;&#26159;&#22312;&#23487;&#20027;&#31995;&#32479; &#19978;&#38543;&#20415;&#25214;&#19968;&#20010;&#20108;&#36827;&#21046;&#25991;&#20214;&#65292;&#36816;&#34892; <strong class="userinput"><code>readelf -l
          &lt;&#20108;&#36827;&#21046;&#25991;&#20214;&#21517;&gt; | grep interpreter</code></strong>&#24182;&#26597;&#30475;&#36755;&#20986;&#30340;&#20869;&#23481;&#12290;&#28085;&#30422;&#25152;&#26377;&#24179;&#21488;&#30340;&#26435;&#23041;&#21442;&#32771;&#35831;&#26597;&#30475; Glibc &#28304;&#30721;&#26681;&#30446;&#24405;&#37324;&#30340; <code class="filename">shlib-versions</code> &#25991;&#20214;&#12290;</p>
      </div>
      <p>
        &#20851;&#20110; <a class="xref" href=
        "chapter05.html" title=
        "Chapter&nbsp;5.&nbsp;Constructing a Temporary System">Chapter 5</a> &#20013;&#26500;&#24314;&#26041;&#27861;&#22914;&#20309;&#24037;&#20316;&#30340;&#19968;&#20123;&#25216;&#26415;&#35201;&#28857;&#65306;</p>
      <div class="itemizedlist">
        <ul>
          <li>
            <p>
              &#36890;&#36807;&#25913;&#21464; <code class="envar">LFS_TGT</code> &#21464;&#37327;&#30340;&ldquo;&#29983;&#20135;&#21830;&rdquo;&#23383;&#27573;&#65292;&#31245;&#24494;&#35843;&#25972;&#24037;&#20316;&#24179;&#21488;&#30340;&#21517;&#23383;&#65292;&#26469;&#30830;&#23450;&#39318;&#20808;&#23433;&#35013;&#30340;Binutils &#21644; GCC   &#29983;&#25104;&#20102;&#19968;&#20010;&#20860;&#23481;&#30340;&#20132;&#21449;&#36830;&#25509;&#22120;&#21644;&#20132;&#21449;&#32534;&#35793;&#22120;&#12290; &#20132;&#21449;&#38142;&#25509;&#22120;&#21644;&#20132;&#21449;&#32534;&#35793;&#22120;&#20250;&#20135;&#29983;&#20860;&#23481;&#24403;&#21069;&#30828;&#20214;&#30340;&#20108;&#36827;&#21046;&#25991;&#20214;&#65292;&#32780;&#19981;&#26159;&#21478;&#19968;&#20010;&#26550;&#26500;&#30340;&#20108;&#36827;&#21046;&#25991;&#20214;&#12290;</p>
          </li>
          <li>
            <p>
              &#20020;&#26102;&#24211;&#25991;&#20214;&#26159;&#20132;&#21449;&#32534;&#35793;&#30340;&#65292; &#22240;&#20026;&#26412;&#22320;&#30340;&#20132;&#21449;&#32534;&#35793;&#22120;&#19981;&#33021;&#23545;&#23487;&#20027;&#31995;&#32479;&#26377;&#20219;&#20309;&#20381;&#36182;&#20851;&#31995;&#65292;&#25152;&#20197;&#26412;&#26041;&#27861;&#36890;&#36807;&#20943;&#23569;&#23487;&#20027;&#31995;&#32479;&#30340;&#22836;&#25991;&#20214;&#25110;&#24211;&#36827;&#20837;&#26032;&#24037;&#20855;&#38142;&#30340;&#26426;&#20250;&#65292;&#28040;&#38500;&#20102;&#23545;&#30446;&#26631;&#31995;&#32479;&#30340;&#28508;&#22312;&#27745;&#26579;&#12290;
              &#20132;&#21449;&#32534;&#35793;&#36824;&#20351;&#22312;64&#20301;&#30828;&#20214;&#19978;&#21019;&#24314;32&#20301;&#21644;64&#20301;&#24211;&#25991;&#20214;&#25104;&#20026;&#21487;&#33021;&#24615;&#12290;</p>
          </li>
          <li>
            <p>
              &#23567;&#24515;&#22788;&#29702; <span class=
              "command"><strong>gcc</strong></span> &#30340; <code class=
              "filename">specs</code> &#25991;&#20214;&#65292;&#35813;&#25991;&#20214;&#21578;&#35785;&#32534;&#35793;&#22120;&#35201;&#20351;&#29992;&#21738;&#20010;&#21160;&#24577;&#36830;&#25509;&#22120;&#12290;</p>
          </li>
        </ul>
      </div>
      <p>
        &#39318;&#20808;&#23433;&#35013;&#30340;&#26159; Binutils&#65292; &#22240;&#20026; GCC &#21644; Glibc &#36816;&#34892;&#30340; <span class=
        "command"><strong>configure</strong></span> &#25991;&#20214;&#35201;&#22312;&#27719;&#32534;&#22120;&#21644;&#32852;&#25509;&#22120;&#19978;&#25191;&#34892;&#21508;&#31181;&#21508;&#26679;&#30340;&#29305;&#24615;&#27979;&#35797;&#65292; &#20197;&#30830;&#23450;&#36719;&#20214;&#30340;&#21738;&#20123;&#21151;&#33021;&#35201;&#21551;&#29992;&#65292; &#21738;&#20123;&#21151;&#33021;&#35201;&#31105;&#29992;&#12290; &#36825;&#26679;&#20570;&#27604;&#20320;&#24819;&#20687;&#30340;&#36824;&#35201;&#37325;&#35201;&#65292;&#37197;&#32622;&#19981;&#27491; &#30830;&#30340; GCC &#25110;&#32773; Glibc &#20250;&#23548;&#33268;&#24037;&#20855;&#38142;&#20986;&#29616;&#24494;&#22937;&#30340;&#38169;&#35823;&#65292;&#36825;&#26679;&#30340;&#38169;&#35823;&#36896;&#25104;&#30340;&#24433;&#21709;&#21487;&#33021;&#30452;&#21040;&#25972;&#20010;&#31995;&#32479;&#24555;&#35201;&#32534;&#35793;   &#23436;&#25104;&#30340;&#26102;&#20505;&#25165;&#26174;&#29616;&#20986;&#26469;&#12290; &#27979;&#35797;&#31243;&#24207;&#36890;&#24120;&#20250;&#22312;&#20854;&#23427;&#30340;&#35768;&#22810;&#24037;&#20316;&#36827;&#34892;&#20043;&#21069;&#32473;&#20986;&#38169;&#35823;&#35686;&#21578; &#12290;</p>
      <p>
        Binutils &#23558;&#23427;&#30340;&#27719;&#32534;&#22120;&#21644;&#36830;&#25509;&#22120;&#23433;&#35013;&#22312;&#20004;&#20010;&#20301;&#32622;&#65306;        <code class="filename">/tools/bin</code> &#21644; <code class=
        "filename">/tools/$LFS_TGT/bin</code>&#12290; &#19968;&#20010;&#20301;&#32622;&#30340;&#24037;&#20855;&#26159;&#21478;&#22806;&#19968;&#20010;&#20301;&#32622;&#30340;&#30828;&#38142;&#25509;&#12290; &#36830;&#25509;&#22120;&#30340;&#19968;&#20010;&#37325;&#35201;&#29992;&#36884;&#26159;&#23427;&#30340;&#24211;&#25628;&#32034;&#39034;&#24207;&#65292;&#23558; <em class="parameter"><code>--verbose</code></em> &#21442;&#25968;&#20256;&#36882;&#32473; <strong><span class="command"><strong>ld</strong></span></strong> &#21487;&#20197;&#33719;&#24471;&#35814;&#32454;&#30340;&#20449;&#24687;&#12290;&#27604;&#22914;&#65292;&#36755;&#20837; <strong class="userinput"><code>ld --verbose | grep
        SEARCH</code></strong> &#23558;&#26174;&#31034;&#24403;&#21069;&#25628;&#32034;&#36335;&#24452;&#21644;&#39034;&#24207;&#12290;&#35201;&#26174;&#31034; <span class=
        "command"><strong>ld </strong></span>&#36830;&#25509;&#30340;&#26159;&#21738;&#20123;&#25991;&#20214;&#65292;&#21487;&#20197;&#32534;&#35793;&#19968;&#20010;&#20266;(dummy)&#31243;&#24207;&#24182;&#25226; <em class="parameter"><code>--verbose</code></em> &#21442;&#25968;&#20256;&#36882;&#32473;&#36830;&#25509;&#22120;&#12290;&#20363;&#22914;&#65292;&#36755;&#20837; <strong class="userinput"><code>gcc
        dummy.c -Wl,--verbose 2&gt;&amp;1 | grep succeeded</code></strong>
        &#23558;&#26174;&#31034;&#25152;&#26377;&#36830;&#25509;&#36807;&#31243;&#20013;&#25104;&#21151;&#25171;&#24320;&#30340;&#25991;&#20214;&#12290;</p>
      <p>
        &#31532;&#20108;&#20010;&#23433;&#35013;&#30340;&#36719;&#20214;&#21253;&#26159; GCC&#12290; &#19979;&#38754;&#26159;&#36816;&#34892; <strong><span class=
        "command"><strong>configure</strong></span></strong> &#33050;&#26412;&#26102;&#65292;&#36755;&#20986;&#20869;&#23481;&#30340;&#19968;&#20010;&#31034;&#20363;&#65306;</p>
      <pre class="screen"><code class=
      "computeroutput">checking what assembler to use... /tools/i686-lfs-linux-gnu/bin/as
checking what linker to use... /tools/i686-lfs-linux-gnu/bin/ld</code></pre>
      <p>
        &#22522;&#20110;&#19978;&#38754;&#25552;&#21040;&#36807;&#30340;&#21407;&#22240;&#65292;&#36825;&#26159;&#37325;&#35201;&#30340;&#27493;&#39588;&#65292;&#23427;&#21516;&#26102;&#35777;&#26126;&#20102; GCC &#30340;&#37197;&#32622;&#33050;&#26412;&#24182;&#19981;&#26159;&#25628;&#32034; PATH
        &#37324;&#30340;&#30446;&#24405;&#26469;&#23547;&#25214;&#35201;&#20351;&#29992;&#21738;&#20010;&#24037;&#20855;&#30340;&#65292;&#32780;&#19988;&#65292;&#22312; <span class="command"><strong>gcc</strong></span>
        &#30340;&#23454;&#38469;&#25805;&#20316;&#20013;&#65292; &#19981;&#24517;&#20351;&#29992;&#30456;&#21516;&#30340;&#25628;&#32034;&#36335;&#24452;&#12290; &#35201;&#30693;&#36947; <span class=
        "command"><strong>gcc</strong></span>&#20250;&#20351;&#29992;&#21738;&#20010;&#26631;&#20934;&#36830;&#25509;&#22120;&#65292;&#35831;&#36816;&#34892;&#21629;&#20196;&#65306;<strong class=
        "userinput"><code>gcc -print-prog-name=ld</code></strong>&#12290;</p>
      <p>
        &#22312;&#32534;&#35793;&#19968;&#20010;&#20266;&#31243;&#24207;&#30340;&#26102;&#20505;&#65292;&#32473; <span class=
        "command"><strong>gcc</strong></span><strong> </strong>&#21629;&#20196;&#20256;&#36882; <em>-v</em> &#36873;&#39033;&#21487;&#20197;&#33719;&#24471;&#35814;&#32454;&#30340;&#20449;&#24687;&#12290;&#20030;&#20010;&#20363;&#23376;&#65306; <strong class="userinput"><code>gcc -v
        dummy.c</code></strong> &#23558;&#26174;&#31034;&#22312;&#39044;&#22788;&#29702;&#12289;&#32534;&#35793;&#21644;&#27719;&#32534;&#21508;&#20010;&#38454;&#27573;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#21253;&#25324; <span class="command"><strong>gcc</strong></span>&#25991;&#20214;&#21253;&#21547;&#30340;&#25628;&#32034;&#36335;&#24452;&#21450;&#20854;&#39034;&#24207;&#12290;</p>
      <p>
        &#25509;&#19979;&#26469;&#23433;&#35013;&#30340;&#36719;&#20214;&#21253;&#26159; Glibc&#12290;&#32534;&#35793; Glibc &#30340;&#26102;&#20505;&#65292; &#26368;&#38656;&#35201;&#27880;&#24847;&#30340;&#22320;&#26041;&#26159;&#32534;&#35793;&#22120;&#12289; &#20108;&#36827;&#21046;&#24037;&#20855;(Binutils)&#21644;&#20869;&#26680;&#22836;&#25991;&#20214;&#12290;&#32534;&#35793;&#22120;&#19968;&#33324;&#19981;&#26159;&#38382;&#39064;&#65292; &#22240;&#20026; Glibc &#24635;&#26159;&#23558;&#19982;&#32534;&#35793;&#22120;&#30456;&#20851;&#30340; <em> </em><em class=
        "parameter"><code>--host</code></em> &#21442;&#25968;&#20256;&#36882;&#32473;&#23427;&#30340;&#37197;&#32622;&#33050;&#26412;&#65292;&#22312;&#25105;&#20204;&#30340;&#20363;&#23376;&#37324;&#23601;&#26159; <span class=
        "command"><strong>i686-lfs-linux-gnu-gcc</strong></span>&#65292; &#32780;&#20108;&#36827;&#21046;&#24037;&#20855;&#21644;&#20869;&#26680;&#22836;&#25991;&#20214;&#21487;&#33021;&#26377;&#28857;&#22797;&#26434;&#12290;&#22240;&#27492;&#65292; &#20026;&#24910;&#37325;&#36215;&#35265;&#65292; &#35201;&#20351;&#29992;&#21487;&#29992;&#30340;&#37197;&#32622;&#24320;&#20851;(&#36873;&#39033;)&#26469;&#24378;&#21046;&#36827;&#34892;&#27491;&#30830;&#30340;&#36873;&#25321;&#12290;&#22312;&#36816;&#34892; <span class=
        "command"><strong>configure</strong></span> &#20043;&#21518;&#65292;&#35831;&#26816;&#26597; <code class="filename">glibc-build</code> &#30446;&#24405;&#19979;&#30340; <code class="filename">config.make</code> &#25991;&#20214;&#30340;&#20869;&#23481;&#65292;&#26597;&#30475;&#25152;&#26377;&#37325;&#35201;&#30340;&#32454;&#33410;&#12290; &#27880;&#24847; <em class=
        "parameter"><code>CC="i686-lfs-gnu-gcc"</code></em>&#30340;&#20316;&#29992;&#26159;&#25511;&#21046;&#35201;&#20351;&#29992;&#21738;&#20010;&#20108;&#36827;&#21046;&#24037;&#20855;&#65307; &#32780; <em class=
        "parameter"><code>-nostdinc</code></em> &#21644; <em class=
        "parameter"><code>-isystem</code></em> &#21442;&#25968;&#21017;&#26159;&#29992;&#26469;&#25511;&#21046;&#32534;&#35793;&#22120;&#30340; include &#25628;&#32034;&#36335;&#24452;&#12290; &#36825;&#20123;&#36873;&#39033;&#34920;&#26126;&#20102; Glibc &#36719;&#20214;&#21253;&#30340;&#19968;&#20010;&#37325;&#35201;&#29305;&#24449;&#65306;&#26681;&#25454;&#20854;&#32534;&#35793;&#26426;&#22120;&#30340;&#24773;&#20917;&#65292; &#23427;&#26159;&#38750;&#24120;&#33258;&#32473;&#33258;&#36275;&#30340;&#65292; &#32780;&#19988;&#19968;&#33324;&#19981;&#20381;&#36182;&#20110;&#24037;&#20855;&#38142;&#30340;&#40664;&#35748;&#20540;&#12290;</p>
      <p>
        &#23433;&#35013;&#23436; Glibc &#20197;&#21518;&#65292; &#35201;&#26356;&#25913; <span class=
        "command"><strong>gcc</strong></span> &#30340; specs &#25991;&#20214;&#65292;&#20197;&#20415;&#25351;&#21521; <code class="filename">/tools/lib</code> &#37324;&#26032;&#30340;&#21160;&#24577;&#36830;&#25509;&#22120;&#12290; &#26368;&#21518;&#19968;&#27493;&#26159;&#33267;&#20851;&#37325;&#35201;&#30340;&#65292;&#35201;&#30830;&#20445;&#25628;&#32034;&#21644;&#38142;&#25509;&#21482;&#22312;&#39044;&#35774;&#30340; <code class="filename">/tools</code> &#30446;&#24405;&#20869;&#36827;&#34892;&#12290; &#25351;&#21521;&#21160;&#24577;&#38142;&#25509;&#22120;&#30340;&#22266;&#21270;&#36335;&#24452;&#34987;&#23884;&#20837;&#21040;&#27599;&#20010;&#20849;&#20139;&#30340;&#21487;&#25191;&#34892;&#21644;&#38142;&#25509;&#26684;&#24335; &#65288;ELF&#65289;&#25991;&#20214;&#37324;&#12290; &#36825;&#21487;&#20197;&#36890;&#36807;&#36816;&#34892;&#65306; <strong class="userinput"><code>readelf -l &lt;name of
        binary&gt; | grep interpreter</code></strong> &#26469;&#26816;&#26597;&#12290;&#20462;&#25913; <span class=
        "command"><strong>gcc</strong></span>  &#30340;specs &#25991;&#20214;&#65292;&#30830;&#20445;&#20174;&#29616;&#22312;&#21040;&#26412;&#31456;&#32467;&#26463;&#65292;&#32534;&#35793;&#30340;&#27599;&#20010;&#31243;&#24207;&#37117;&#20351;&#29992;  <code class="filename">/tools/lib</code>&#12290;</p>
      <p>
        &#23545;&#20110;&#31532;&#20108;&#36941;&#32534;&#35793; GCC&#65292;&#20026;&#20102;&#21578;&#35785;GCC&#20351;&#29992;&#26032;&#30340;&#21160;&#24577;&#36830;&#25509;&#22120;&#65292;&#23427;&#30340;&#28304;&#20195;&#30721;&#20063;&#38656;&#35201;&#25913;&#21464;&#12290; &#19981;&#36825;&#26679;&#20570;&#30340; &#32467;&#26524;&#26159; GCC &#20250;&#25226;&#23487;&#20027;&#31995;&#32479; /lib &#30446;&#24405;&#19979;&#21160;&#24577;&#36830;&#25509;&#22120;&#30340;&#21517;&#23383;&#23884;&#20837;&#36827;&#26469;&#65292; &#36825;&#26679;&#26377;&#24726;&#20110;&#19982;&#23487;&#20027;&#31995;&#32479;&#38548;&#31163;&#30340;&#30446;&#26631;&#12290;</p>
      <p>&#31532;&#20108;&#36941;&#32534;&#35793; Binutils &#30340;&#36807;&#31243;&#20013;&#65292;&#25105;&#20204;&#21033;&#29992; <em class="parameter"><code>--with-lib-path</code></em> &#36873;&#39033;&#26469;&#25511;&#21046; <strong>ld</strong> &#30340;&#24211;&#25628;&#32034;&#36335;&#24452;&#12290; &#22914;&#21069;&#38754;&#25152;&#25351;&#20986;&#30340;&#65292;&#26680;&#24515;&#24037;&#20855;&#38142;&#26159;&#33258;&#21253;&#21547;&#21644;&#33258;&#20381;&#36182;&#30340;&#65292;&#25152;&#20197; <a class="xref"
        href="chapter05.html" title=
        "Chapter&nbsp;5.&nbsp;Constructing a Temporary System">Chapter 5</a>
        &#20313;&#19979;&#30340;&#36719;&#20214;&#21253;&#30340;&#32534;&#35793;&#23558;&#20381;&#36182;&#20110; <code class=
        "filename">/tools</code> &#19979;&#26032;&#30340; Glibc &#12290;</p>
      <p>
        &#22312; <a class="xref" href=
        "../chapter06/chapter06.html" title=
        "Chapter&nbsp;6.&nbsp;Installing Basic System Software">Chapter
        6</a> &#20013;&#36827;&#20837; chroot &#29615;&#22659;&#21518;&#65292;&#31532;&#19968;&#20010;&#23433;&#35013;&#30340;&#20027;&#35201;&#36719;&#20214;&#21253;&#23601;&#26159; Glibc&#65292; &#21407;&#22240;&#26159;&#19978;&#38754;&#25152;&#25552; &#21040;&#30340; Glibc &#33258;&#32473;&#33258;&#36275;&#30340;&#29305;&#24615;&#12290; &#19968;&#26086; Glibc &#23433;&#35013;&#21040; <code class="filename">/usr</code>  &#30446;&#24405;&#21518;&#65292; &#25105;&#20204;&#20250;&#39532;&#19978;&#25913;&#21464;&#24037;&#20855;&#38142;&#30340;&#40664;&#35748; &#20540;&#65292; &#28982;&#21518;&#26500;&#24314;&#30446;&#26631; LFS   &#31995;&#32479;&#30340;&#20854;&#23427;&#37096;&#20998;&#12290;</p>
    </div>
    <div class="navfooter">
      <ul>
        <li class="prev">
          <a accesskey="p" href="introduction.html" title=
          "Introduction">&#21518;&#36864;</a>
          <p>
            &#20171;&#32461;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="generalinstructions.html" title=
          "General Compilation Instructions">&#21069;&#36827;</a>
          <p>
            &#24120;&#29992;&#32534;&#35793;&#22120;&#29992;&#27861;&#35828;&#26126;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter05.html" title=
          "Chapter&nbsp;5.&nbsp;Constructing a Temporary System">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
  </body>
</html>
