<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content=
    "application/xhtml+xml; charset=iso-8859-1" />
    <title>
      4.5.&nbsp;About SBUs
    </title>
    <link rel="stylesheet" href="../stylesheets/lfs.css" type="text/css" />
    <meta name="generator" content="DocBook XSL Stylesheets V1.73.2" />
    <link rel="stylesheet" href="../stylesheets/lfs-print.css" type=
    "text/css" media="print" />
  </head>
  <body class="lfs" id="lfs-6.6">
    <div class="navheader">
      <h4>
        Linux From Scratch - Version 6.6
      </h4>
      <h3>
        Chapter&nbsp;4.&nbsp;&#26368;&#21518;&#30340;&#20934;&#22791;&#24037;&#20316; 
      </h3>
      <ul>
        <li class="prev">
          <a accesskey="p" href="settingenvironment.html" title=
          "Setting Up the Environment">&#21518;&#36864;</a>
          <p>
            &#35774;&#32622;&#29615;&#22659;&#21464;&#37327;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="abouttestsuites.html" title=
          "About the Test Suites">&#21069;&#36827;</a>
          <p>
            &#20851;&#20110;&#36719;&#20214;&#21253;&#27979;&#35797;&#22871;&#20214;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter04.html" title=
          "Chapter&nbsp;4.&nbsp;Final Preparations">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
    <div class="sect1" lang="en" xml:lang="en">
      <h1 class="sect1">
        <a id="prepare-aboutsbus" name="prepare-aboutsbus"></a>4.5. &#20851;&#20110; SBU
      </h1>
      <p>&#35768;&#22810;&#20154;&#37117;&#24819;&#30693;&#36947;&#32534;&#35793;&#21644;&#23433;&#35013;&#19968;&#20010;&#36719;&#20214;&#21253;&#39044;&#35745;&#38656;&#35201;&#22810;&#38271;&#26102;&#38388;&#12290;&#22240;&#20026; Linux From Scratch &#21487;&#20197;&#22312;&#22810;&#31181;&#19981;&#21516;&#30340;&#31995;&#32479;&#19978;&#21019;&#24314;&#65292;   &#20934;&#30830;&#20272;&#35745;&#25152;&#38656;&#30340;&#26102;&#38388;&#26159;&#19981;&#21487;&#33021;&#30340;&#12290; &#26368;&#24555;&#30340;&#31995;&#32479;&#19978;&#32534;&#35793;&#23433;&#35013;&#26368;&#22823;&#30340;&#36719;&#20214;&#21253;(Glibc)&#22823;&#32422;&#38656;&#35201;   20 &#20998;&#38047;&#65292;   &#20294;&#22312;&#24456;&#24930;&#30340;&#31995;&#32479;&#19978;&#21487;&#33021;&#32791;&#36153;&#38271;&#36798;&#19977;&#22825;&#26102;&#38388;&#12290; &#25105;&#20204;&#19981;&#25552;&#20379;&#20934;&#30830;&#26102;&#38388;&#65292; &#20195;&#20043;&#20197;&#26631;&#20934;&#32534;&#35793;&#26102;&#38388;&#21333;&#20301;(SBU)&#26469;&#24230;&#37327;&#12290;</p>
      <p>
        SBU &#24230;&#37327;&#20855;&#20307;&#35828;&#26126;&#22914;&#19979;&#65292;&#26412;&#20070;&#20013;&#31532;&#19968;&#20010;&#32534;&#35793;&#30340;&#36719;&#20214;&#21253;&#26159; <a class="xref" href=
        "../chapter05/chapter05.html" title=
        "Chapter&nbsp;5.&nbsp;Constructing a Temporary System">Chapter 5</a> &#20013;&#38745;&#24577;&#32534;&#35793;&#30340; Binutils &#12290;
        &#32534;&#35793;&#36825;&#20010;&#36719;&#20214;&#21253;&#25152;&#33457;&#36153;&#30340;&#26102;&#38388;&#23601;&#20316;&#20026;&#26631;&#20934;&#32534;&#35793;&#26102;&#38388;&#21333;&#20301;&#25110;SBU&#12290; &#25152;&#26377;&#20854;&#23427;&#36719;&#20214;&#30340;&#32534;&#35793;&#26102;&#38388;&#37117;&#29992;&#36825;&#20010;&#26102;&#38388;&#26469;&#34913;&#37327;&#12290;</p>
      <p>
        &#20363;&#22914;&#65292;&#23545;&#20110;&#19968;&#20010;&#32534;&#35793;&#26102;&#38388;&#20026; 4.5 SBU &#30340;&#36719;&#20214;&#21253;&#65292;&#36825;&#24847;&#21619;&#30528;&#22914;&#26524;&#19968;&#20010;&#31995;&#32479;&#38745;&#24577;&#32534;&#35793;&#23433;&#35013; Binutils &#38656;&#35201;&#33457;&#36153; 10   &#20998;&#38047;&#65292;&#37027;&#20040;&#32534;&#35793;&#36825;&#20010;&#36719;&#20214;&#21253;&#23558;<em>&#22823;&#32422;</em>&#38656;&#35201; 45 &#20998;&#38047;&#12290; &#24184;&#36816;&#30340;&#26159;&#65292; &#22823;&#22810;&#25968;&#36719;&#20214;&#21253;&#32534;&#35793;&#23433;&#35013;&#25152;&#38656;&#30340;&#26102;&#38388;&#37117;&#27604; Binutils     &#25152;&#38656;&#30340;&#26102;&#38388;&#35201;&#30701;&#12290; </p>
      <p>
        &#36890;&#24120;&#65292;SBU &#24182;&#19981;&#21313;&#20998;&#31934;&#30830;&#65292;&#22240;&#20026;&#23427;&#20381;&#36182;&#20110;&#35768;&#22810;&#22240;&#32032;&#65292;&#21253;&#25324;&#23487;&#20027;&#31995;&#32479; GCC &#30340;&#29256;&#26412;&#12290;&#21478;&#22806;&#65292; &#22312;&#22522;&#20110;&#23545;&#31216; &#22810;&#22788;&#29702;&#22120;(SMP)&#30340;&#26426;&#22120;&#19978;&#65292;SBU   &#26356;&#21152;&#19981;&#20934;&#30830;&#12290;&#25105;&#20204;&#25552;&#20379;SBU&#65292; &#20165;&#20165;&#26159;&#32473;&#20986;&#23433;&#35013;&#19968;&#20010;&#36719;&#20214;&#21253;&#25152;&#38656; &#26102;&#38388;&#30340;&#22823;&#27010;&#20272;&#35745;&#65292; &#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#23454;&#38469;&#33457;&#36153;&#30340;&#26102;&#38388;&#19982;&#39044;&#20272;&#35745;&#30340;&#26102;&#38388;&#20043;&#38388;&#21487;&#33021;&#26377;&#25968;&#21313;&#20998;&#38047;&#30340;&#24046;&#24322;&#12290;</p>
      <p>&#35201;&#26597;&#30475;&#22312;&#19968;&#20123;&#29305;&#23450;&#26426;&#22120;&#19978;&#30340;&#23454;&#38469;&#32534;&#35793;&#23433;&#35013;&#26102;&#38388;&#65292;&#25105;&#20204;&#25512;&#33616;&#24744;&#26597;&#30475; LinuxFromScratch SBU &#30340;&#20027;&#39029; <a class="ulink"
        href="http://www.linuxfromscratch.org/~sbu/">http://www.linuxfromscratch.org/~sbu/</a>.      </p>
      <div class="admon note">
        <img alt="[Note]" src="../images/note.png" />
        <h3>
          &#27880;&#24847;
        </h3>
        <p>
          &#23545;&#20110;&#24456;&#22810;&#20351;&#29992;&#22810;&#22788;&#29702;&#22120;&#65288;&#25110;&#26680;&#24515;&#65289;&#30340;&#29616;&#20195;&#31995;&#32479;&#65292; &#36890;&#36807;&#35774;&#32622;&#19968;&#20010;&#29615;&#22659;&#21464;&#37327;&#25110;&#21578;&#35785; <span class="command"><strong>make</strong></span> &#31243;&#24207;&#26377;&#20960;&#20010;&#21487;&#29992;&#30340;&#22788;&#29702;&#22120;&#65292;&#20197;&#25191;&#34892;&rdquo;&#24182;&#34892;&#32534;&#35793;&ldquo;&#21487;&#20197;&#20943;&#23569;&#32534;&#35793;&#19968;&#20010;&#36719;&#20214;&#21253;&#30340;&#26102;&#38388;&#65292;&#27604;&#22914;&#65292;&#19968;&#20010;  Core2Duo
          &#36890;&#36807;&#19979;&#38754;&#30340;&#35774;&#32622;&#65292;&#21487;&#20197;&#25903;&#25345;&#20004;&#20010;&#24182;&#34892;&#30340;&#22788;&#29702;&#22120;&#65306;</p>
        <pre class="userinput"><kbd class=
        "command">set MAKEFLAGS='-j 2'</kbd></pre>
        <p>
          &#25110;&#20165;&#20165;&#22312;&#32534;&#35793;&#26102;&#20351;&#29992;&#19979;&#21015;&#21442;&#25968;&#65306;
        </p>
        <pre class="userinput"><kbd class="command">make -j2</kbd></pre>
        <p>
          &#22240;&#27492;&#65292;&#24403;&#20351;&#29992;&#22810;&#22788;&#29702;&#22120;&#26102;&#65292;&#26412;&#20070;&#20013;&#24471; SBU &#21333;&#20301;&#20250;&#27604;&#36890;&#24120;&#24046;&#21035;&#26356;&#22823;&#12290;&#22240;&#20026;&#19981;&#21516;&#36827;&#31243;&#30340;&#32447;&#36335;&#30456;&#20114;&#20132;&#38169;&#65292;&#25152;&#20197;&#20998;&#26512;&#32534;&#35793;&#36807;&#31243;&#30340;&#36755;&#20986;&#20063;&#26356;&#21152;&#22256;&#38590;&#12290;&#22914;&#26524;&#20320;&#22312;&#32534;&#35793;&#36807;&#31243;&#20013;&#36935;&#21040;&#38382;&#39064;&#65292;&#20026;&#20102;&#27491;&#30830;&#20998;&#26512;&#36825;&#20123;&#38169;&#35823;&#20449;&#24687;&#65292;&#23601;&#38656;&#35201;&#24674;&#22797;&#21040;&#21333;&#20010;&#22788;&#29702;&#22120;&#26469;&#32534;&#35793;&#12290;</p>
      </div>
    </div>
    <div class="navfooter">
      <ul>
        <li class="prev">
          <a accesskey="p" href="settingenvironment.html" title=
          "Setting Up the Environment">&#21518;&#36864;</a>
          <p>
            &#35774;&#32622;&#29615;&#22659;&#21464;&#37327;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="abouttestsuites.html" title=
          "About the Test Suites">&#21069;&#36827;</a>
          <p>
            &#20851;&#20110;&#36719;&#20214;&#21253;&#27979;&#35797;&#22871;&#20214;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter04.html" title=
          "Chapter&nbsp;4.&nbsp;Final Preparations">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
  </body>
</html>
