<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content=
    "application/xhtml+xml; charset=iso-8859-1" />
    <title>
      4.6.&nbsp;About the Test Suites
    </title>
    <link rel="stylesheet" href="../stylesheets/lfs.css" type="text/css" />
    <meta name="generator" content="DocBook XSL Stylesheets V1.73.2" />
    <link rel="stylesheet" href="../stylesheets/lfs-print.css" type=
    "text/css" media="print" />
  </head>
  <body class="lfs" id="lfs-6.6">
    <div class="navheader">
      <h4>
        Linux From Scratch - Version 6.6
      </h4>
      <h3>
        Chapter&nbsp;4.&nbsp;&#26368;&#21518;&#30340;&#20934;&#22791;&#24037;&#20316; 
      </h3>
      <ul>
        <li class="prev">
          <a accesskey="p" href="aboutsbus.html" title="About SBUs">&#21518;&#36864;</a>
          <p>&#20851;&#20110; SBU
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="../chapter05/chapter05.html" title=
          "Constructing a Temporary System">&#21069;&#36827;</a>
          <p>
            &#26500;&#24314;&#20020;&#26102;&#31995;&#32479; 
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter04.html" title=
          "Chapter&nbsp;4.&nbsp;Final Preparations">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
    <div class="sect1" lang="en" xml:lang="en">
      <h1 class="sect1">
        <a id="prepare-abouttestsuites" name=
        "prepare-abouttestsuites"></a>4.6. &#20851;&#20110;&#36719;&#20214;&#21253;&#27979;&#35797;&#22871;&#20214;
      </h1>
      <p>
        &#22823;&#22810;&#25968;&#36719;&#20214;&#21253;&#25552;&#20379;&#27979;&#35797;&#22871;&#20214;&#12290;&#32534;&#35793;&#23436;&#19968;&#20010;&#36719;&#20214;&#21253;&#20043;&#21518;&#26368;&#22909;&#31435;&#21363;&#36816;&#34892;&#19968;&#19979;&#23427;&#25552;&#20379;&#30340;&#27979;&#35797;&#31243;&#24207;&#65292;   &#22240;&#20026;&#27979;&#35797;&#31243;&#24207;&#23558;&#36827;&#34892;&#19968;&#27425;&quot;&#20581;&#20840;&#26816;&#26597;&quot;&#26469;&#30830;&#35748;&#25152;&#26377;&#30340;&#20195;&#30721;&#26159;&#21542;&#37117;&#27491;&#30830;&#32534;&#35793;&#20102;&#12290; &#36890;&#36807;&#20102;&#27979;&#35797;&#31243;&#24207;&#30340;&#19968;&#31995;&#21015;&#26816;&#26597;&#65292;&#36890;&#24120;&#24847;&#21619;&#30528;&#36719;&#20214;&#21253;&#22312;&#25353;&#29031;&#24320;&#21457;&#32773;&#30340;&#39044;&#26399;&#36816;&#34892;&#65292;   &#20294;&#26159;&#36825;&#24182;&#19981;&#20445;&#35777;&#36825;&#20010;&#36719;&#20214;&#21253;&#23601;&#23436;&#20840;&#27809;&#26377;   bug &#20102;&#12290;</p>
      <p>
        &#26576;&#20123;&#36719;&#20214;&#21253;&#30340;&#27979;&#35797;&#31243;&#24207;&#26159;&#26497;&#20026;&#37325;&#35201;&#30340;&#65292;&#20363;&#22914;&#26680;&#24515;&#24037;&#20855;&#38142;&#36719;&#20214;&#21253; GCC &#12289;Binutils &#12289;Glibc   &#30340;&#27979;&#35797;&#31243;&#24207;&#65292;   &#36825;&#26159;&#22240;&#20026;&#36825;&#20123;&#36719;&#20214;&#21253;&#22312;&#19968;&#20010;&#33391;&#22909;&#24037;&#20316;&#30340;&#31995;&#32479;&#37324;&#30340;&#22788;&#20110;&#26680;&#24515;&#35282;&#33394;&#12290;GCC &#21644; Glibc     &#30340;&#27979;&#35797;&#31243;&#24207;&#38656;&#35201;&#36816;&#34892;&#24456;&#38271;&#26102;&#38388;&#65292;&#23588;&#20854;&#22312;&#36895;&#24230;&#24930;&#30340;&#30828;&#20214;&#19978;&#65292;&#20294;&#25105;&#20204;&#20173;&#28982;&#24378;&#28872;&#24314;&#35758;&#24744;&#36816;&#34892;&#36825;&#20123;&#27979;&#35797;&#31243;&#24207;&#12290;</p>
      <div class="admon note">
        <img alt="[Note]" src="../images/note.png" />
        <h3>
          &#27880;&#24847;
        </h3>
        <p>&#32463;&#39564;&#26174;&#31034;&#65292;&#36816;&#34892; <a class="xref" href=
          "../chapter05/chapter05.html" title=
          "Chapter&nbsp;5.&nbsp;Constructing a Temporary System">Chapter
          5 </a>&#20013;&#30340;&#27979;&#35797;&#31243;&#24207;&#26102;&#20250;&#26377;&#28857;&#23567;&#38382;&#39064;&#12290; &#19981;&#21487;&#36991;&#20813;&#30340;&#26159;&#65292; &#23487;&#20027;&#31995;&#32479;&#24635;&#26159;&#23545;&#36825;&#19968;&#31456;&#30340;&#27979;&#35797;&#31243;&#24207;&#26045;&#21152;&#26576;&#20123;&#24433;&#21709;&#65292; &#24120;&#24120;&#23548;&#33268;&#26080;&#27861;&#35299;&#37322;&#30340;&#27979;&#35797;&#22833;&#36133;&#12290;&#22240;&#20026; <a class=
          "xref" href="../chapter05/chapter05.html" title=
          "Chapter&nbsp;5.&nbsp;Constructing a Temporary System">Chapter
          5</a> &#20013;&#32534;&#35793;&#30340;&#24037;&#20855;&#26159;&#20020;&#26102;&#30340;&#65292; &#32780;&#19988;&#22312;&#26368;&#21518;&#20250;&#34987;&#20002;&#24323;&#65292; &#25105;&#20204;&#19981;&#25512;&#33616;&#20013;&#31561;&#27700;&#24179;&#30340;&#35835; &#32773;&#36816;&#34892; <a class="xref" href=
          "../chapter05/chapter05.html" title=
          "Chapter&nbsp;5.&nbsp;Constructing a Temporary System">Chapter
          5</a> &#20013;&#30340;&#27979;&#35797;&#31243;&#24207;&#65292; &#36825;&#20123;&#27979;&#35797;&#31243;&#24207;&#30340; &#25351;&#20196;&#26159;&#20026;&#24320;&#21457;&#21644;&#27979;&#35797;&#20154;&#21592;&#20934;&#22791;&#30340;&#65292; &#23427;&#20204;&#19981;&#26159;&#24517;&#38656;&#30340;&#12290; </p>
      </div>
      <p>Binutils &#21644; GCC &#30340;&#27979;&#35797;&#31243;&#24207;&#19968;&#20010;&#24120;&#35265;&#30340;&#38382;&#39064;&#23601;&#26159;&#22312;&#20266;&#32456;&#31471;(PTY)&#22806;&#36816;&#34892;&#65292; &#36825;&#26679;&#21487;&#33021;&#20250;&#20986;&#29616;&#22823; &#37327;&#30340;&#27979;&#35797;&#22833;&#36133;&#12290; &#21487;&#33021;&#30340;&#21407;&#22240;&#26377;&#20960;&#20010;&#65292;   &#20294;&#26368;&#21487;&#33021;&#30340;&#21407;&#22240;&#26159;&#23487;&#20027;&#31995;&#32479;&#27809;&#26377;&#27491;&#30830;&#30340;&#35774;&#32622; <code class="systemitem">devpts</code> &#25991;&#20214;&#31995;&#32479;&#65292;         &#20851;&#20110;&#36825;&#20010;&#38382;&#39064;&#26356;&#35814;&#32454;&#30340;&#35752;&#35770;&#35831;&#21442;&#32771; <a class="ulink" href=
        "http://www.linuxfromscratch.org//lfs/faq.html#no-ptys">http://www.linuxfromscratch.org//lfs/faq.html#no-ptys</a>.      </p>
      <p>&#26576;&#20123;&#36719;&#20214;&#21253;&#27979;&#35797;&#31243;&#24207;&#21487;&#33021;&#20250;&#32473;&#20986;&#38169;&#35823;&#30340;&#22833;&#36133;&#20449;&#24687;&#65292;&#35831;&#21442;&#32771; <a class="ulink" href=
        "http://www.linuxfromscratch.org/lfs/build-logs/6.6/">http://www.linuxfromscratch.org/lfs/build-logs/6.6/ </a>&#20197;&#30830;&#35748;&#24744;&#25152;&#36935;&#21040;&#30340; &#27979;&#35797;&#22833;&#36133;&#26159;&#21542;&#26159;&#39044;&#26399;&#20250;&#20986;&#29616;&#30340;&#12290;&#36825;&#20010;&#31449;&#28857;&#30340;&#20869;&#23481;&#23545;&#20110;&#26412;&#20070;&#25152;&#26377;&#30340;&#27979;&#35797;&#37117;&#26159;&#27491;&#30830;&#30340;&#12290;</p>
    </div>
    <div class="navfooter">
      <ul>
        <li class="prev">
          <a accesskey="p" href="aboutsbus.html" title="About SBUs">&#21518;&#36864;</a>
          <p>&#20851;&#20110; SBU
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="../chapter05/chapter05.html" title=
          "Constructing a Temporary System">&#21069;&#36827;</a>
          <p>
            &#26500;&#24314;&#20020;&#26102;&#31995;&#32479; 
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter04.html" title=
          "Chapter&nbsp;4.&nbsp;Final Preparations">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
  </body>
</html>
