<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content=
    "application/xhtml+xml; charset=iso-8859-1" />
    <title>
      6.1.&nbsp;Introduction
    </title>
    <link rel="stylesheet" href="../stylesheets/lfs.css" type="text/css" />
    <meta name="generator" content="DocBook XSL Stylesheets V1.73.2" />
    <link rel="stylesheet" href="../stylesheets/lfs-print.css" type=
    "text/css" media="print" />
  </head>
  <body class="lfs" id="lfs-6.6">
    <div class="navheader">
      <h4>
        Linux From Scratch - Version 6.6
      </h4>
      <h3>
        Chapter&nbsp;6.&nbsp;&#23433;&#35013;&#22522;&#30784;&#31995;&#32479;&#36719;&#20214;
      </h3>
      <ul>
        <li class="prev">
          <a accesskey="p" href="chapter06.html" title=
          "Installing Basic System Software">&#21518;&#36864;</a>
          <p>
            &#23433;&#35013;&#22522;&#30784;&#31995;&#32479;&#36719;&#20214;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="kernfs.html" title=
          "Preparing Virtual Kernel File Systems">&#21069;&#36827;</a>
          <p>
            &#20934;&#22791;&#34394;&#25311;&#20869;&#26680;&#25991;&#20214;&#31995;&#32479;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter06.html" title=
          "Chapter&nbsp;6.&nbsp;Installing Basic System Software">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
    <div class="sect1" lang="en" xml:lang="en">
      <h1 class="sect1">
        <a id="ch-system-introduction" name="ch-system-introduction"></a>6.1.
        &#20171;&#32461;
      </h1>
      <p>
        &#22312;&#26412;&#31456;&#65292;&#25105;&#20204;&#36827;&#20837;&#24314;&#31569;&#24037;&#22320;&#65288;building site&#65289;&#65292;&#24320;&#22987;&#31934;&#24515;&#26500;&#24314; LFS &#31995;&#32479;&#12290; &#20063;&#23601;&#26159;&#35828;&#25105;&#20204;&#36890;&#36807; chroot &#21629;&#20196;&#36827;&#20837;&#19968;&#20010;&#20020;&#26102;&#30340; mini Linux &#31995;&#32479;&#65292; &#24182;&#20316;&#19968;&#20123;&#26368;&#21518;&#30340;&#20934;&#22791;&#65292; &#28982;&#21518;&#24320;&#22987;&#23433;&#35013;&#36719;&#20214;&#21253;&#12290;</p>
      <p>
        &#36719;&#20214;&#30340;&#23433;&#35013;&#38750;&#24120;&#31616;&#21333;&#12290; &#23613;&#31649;&#35768;&#22810;&#24773;&#20917;&#19979;&#23545;&#23433;&#35013;&#36807;&#31243;&#30340;&#35828;&#26126;&#21487;&#20197;<span id="result_box"><span title="shorter and more generic" closure_uid_2h4oub="29">&#26356;&#30701;&#65292;&#26356;&#36890;&#29992;</span></span>&#65292; &#20294;&#20026;&#20102;&#28040;&#38500; &#21487;&#33021;&#20986;&#29616;&#30340;&#38169;&#35823;&#65292;&#25105;&#20204;&#20026;&#27599;&#19968;&#20010;&#21253;&#37117;&#25552;&#20379;&#20102;&#20840;&#38754;&#30340;&#23433;&#35013;&#35828;&#26126;&#12290; &#23398;&#20064; Linux &#31995;&#32479;&#26159;&#22914;&#20309;&#24037;&#20316;&#30340;&#65292; &#20851;&#38190;&#22312;&#20110;&#26126;&#30333;&#27599;&#20010;&#21253;&#30340;&#29992;&#36884;&#20197;&#21450;&#20026;&#20160;&#20040;&#29992;&#25143;(&#25110;&#31995;&#32479;)&#38656;&#35201;&#23427;&#12290;</p>
      <p>
        &#25105;&#20204;&#19981;&#24314;&#35758;&#36827;&#34892;&#32534;&#35793;&#22120;&#20248;&#21270;&#65292;&#34429;&#28982;&#32534;&#35793;&#22120;&#20248;&#21270;&#21487;&#20197;&#20351;&#31243;&#24207;&#36816;&#34892;&#30340;&#31245;&#24555;&#19968;&#20123;&#65292; &#20294;&#20063;&#20250;&#36896;&#25104;&#32534;&#35793;&#22256;&#38590;&#21644;&#38382;&#39064;&#12290;  &#22914;&#26524;&#26576;&#20010;&#21253;&#22312;&#20351;&#29992;&#20248;&#21270;&#30340;&#24773;&#20917;&#19979;&#26080;&#27861;&#36890;&#36807;&#32534;&#35793;&#65292; &#35797;&#35797;&#19981;&#29992;&#20248;&#21270;&#32534;&#35793;&#33021;&#19981;&#33021;&#35299;&#20915;&#38382;&#39064;&#12290; &#21363;&#20351;&#20351;&#29992;&#20248;&#21270;&#32534;&#35793;&#25104;&#21151;&#65292; &#30001;&#20110;&#28304;&#30721;&#19982;&#32534;&#35793;&#24037;&#20855;&#20043;&#38388;&#22797;&#26434;&#30340;&#30456;&#20114;&#20316;&#29992;&#65292; &#31243;&#24207;&#20173;&#26377;&#21487;&#33021;&#34987;&#38169;&#35823;&#30340;&#32534;&#35793;&#20102;&#12290; &#36824;&#35201;&#27880;&#24847;&#27809;&#26377;&#27979;&#35797;&#26410;&#20351;&#29992;&#26412;&#20070;&#25351;&#23450;&#20540;&#30340;  <code class="option">-march</code>
        &#21644; <code class="option">-mtune</code> &#21442;&#25968;&#65292;&#23427;&#20204;&#25110;&#35768;&#20250;&#23548;&#33268;&#19968;&#20123;&#24037;&#20855;&#38142;&#36719;&#20214;&#21253; (Binutils, GCC, Glibc)&#30340;&#38382;&#39064;&#12290;        &#20351;&#29992;&#32534;&#35793;&#22120;&#20248;&#21270;&#24471;&#21040;&#30340;&#23567;&#24133;&#24230;&#24615;&#33021;&#25552;&#21319;&#65292;  &#19982;&#23427;&#24102;&#26469;&#30340;&#39118;&#38505;&#30456;&#27604;&#24494;&#19981;&#36275;&#36947;&#12290; &#25152;&#20197;&#21021;&#27425;&#32534;&#35793; LFS &#30340;&#29992;&#25143;&#26368;&#22909;&#19981;&#35201;&#20351;&#29992;&#20219;&#20309;&#20248;&#21270;&#65292; &#21516;&#26102;&#20320;&#30340;&#31995;&#32479;&#20063;&#20250;&#36816;&#34892;&#30340;&#21448;&#24555;&#21448;&#31283;&#23450;&#12290;</p>
      <p>
        &#26412;&#31456;&#20013;&#36719;&#20214;&#21253;&#30340;&#23433;&#35013;&#39034;&#24207;&#24212;&#24403;&#20005;&#26684;&#36981;&#23432;&#65292;&#20197;&#30830;&#20445;&#27809;&#26377;&#19968;&#20010;&#31243;&#24207;&#20250;&#25226;  <code class="filename">/tools</code> &#20316;&#20026;&#36335;&#24452;&#30828;&#36830;&#25509;&#21040;&#20195;&#30721;&#20013;&#12290; &#30001;&#20110;&#21516;&#26679;&#30340;&#21407;&#22240;&#65292;&#19981;&#35201;&#24182;&#34892;&#32534;&#35793;&#36719;&#20214;&#21253;&#12290;&#24182;&#34892;&#32534;&#35793;&#21487;&#33021;&#20250;&#33410;&#30465;&#26102;&#38388; (&#29305;&#21035;&#26159;&#22312;&#21452;CPU&#30340;&#26426;&#22120;&#19978;)&#65292; &#20294;&#20063;&#21487;&#33021;&#36896;&#25104;&#31243;&#24207;&#21253;&#21547; <code class="filename">/tools</code>  &#30828;&#36830;&#25509;&#36335;&#24452;&#65292; &#20197;&#33268;&#22312;&#35813;&#30446;&#24405;&#34987;&#21024;&#38500;&#20043;&#21518;&#65292; &#31243;&#24207;&#26080;&#27861;&#36816;&#34892;&#12290;</p>
      <p>&#22312;&#27599;&#20010;&#36719;&#20214;&#21253;&#23433;&#35013;&#35828;&#26126;&#39029;&#30340;&#39318;&#37096;&#37117;&#25552;&#20379;&#20102;&#19982;&#35813;&#21253;&#30456;&#20851;&#30340;&#19968;&#20123;&#20449;&#24687;&#65292; &#21253;&#25324;&#65306; &#21253;&#20869;&#23481;&#30340;&#31616;&#35201;&#35828;&#26126;&#12289; &#32534;&#35793;&#22823;&#32422;&#25152;&#38656;&#26102;&#38388;&#12289; &#32534;&#35793;&#36807;&#31243;&#25152;&#38656;&#30913;&#30424;&#31354;&#38388;&#12290;   &#22312;&#23433;&#35013;&#35828;&#26126;&#20043;&#21518;&#36824;&#26377;&#35813;&#21253;&#25152;&#23433;&#35013;&#30340;&#31243;&#24207;&#21644;&#24211;&#30340;&#21015;&#34920; &#65288;&#20197;&#21450;&#23545;&#23427;&#20204;&#30340;&#31616;&#35201;&#35828;&#26126;&#65289;&#12290;</p>
    </div>
    <div class="navfooter">
      <ul>
        <li class="prev">
          <a accesskey="p" href="chapter06.html" title=
          "Installing Basic System Software">&#21518;&#36864;</a>
          <p>
            &#23433;&#35013;&#22522;&#30784;&#31995;&#32479;&#36719;&#20214;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="kernfs.html" title=
          "Preparing Virtual Kernel File Systems">&#21069;&#36827;</a>
          <p>
            &#20934;&#22791;&#34394;&#25311;&#20869;&#26680;&#25991;&#20214;&#31995;&#32479;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter06.html" title=
          "Chapter&nbsp;6.&nbsp;Installing Basic System Software">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
  </body>
</html>
