<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content=
    "application/xhtml+xml; charset=iso-8859-1" />
    <title>
      6.3.&nbsp;Package Management
    </title>
    <link rel="stylesheet" href="../stylesheets/lfs.css" type="text/css" />
    <meta name="generator" content="DocBook XSL Stylesheets V1.73.2" />
    <link rel="stylesheet" href="../stylesheets/lfs-print.css" type=
    "text/css" media="print" />
  </head>
  <body class="lfs" id="lfs-6.6">
    <div class="navheader">
      <h4>
        Linux From Scratch - Version 6.6
      </h4>
      <h3>
        Chapter&nbsp;6.&nbsp;&#23433;&#35013;&#22522;&#30784;&#31995;&#32479;&#36719;&#20214;
      </h3>
      <ul>
        <li class="prev">
          <a accesskey="p" href="kernfs.html" title=
          "Preparing Virtual Kernel File Systems">&#21518;&#36864;</a>
          <p>
            &#20934;&#22791;&#34394;&#25311;&#20869;&#26680;&#25991;&#20214;&#31995;&#32479;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="chroot.html" title=
          "Entering the Chroot Environment">&#21069;&#36827;</a>
          <p>
            &#36827;&#20837; Chroot &#29615;&#22659;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter06.html" title=
          "Chapter&nbsp;6.&nbsp;Installing Basic System Software">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
    <div class="sect1" lang="en" xml:lang="en">
      <h1 class="sect1">
        <a id="ch-system-pkgmgt" name="ch-system-pkgmgt"></a>6.3. &#21253;&#31649;&#29702; 
      </h1>
      <p>
        &#23545;&#20110; LFS BOOK&#65292;&#21253;&#31649;&#29702;&#36890;&#24120;&#34987;&#35831;&#27714;&#21152;&#36827;&#21435;&#12290; &#19968;&#20010;&#21253;&#31649;&#29702;&#22120;&#20801;&#35768;&#36319;&#36394;&#25991;&#20214;&#30340;&#23433;&#35013;&#65292; &#20351;&#21024;&#38500;&#25110;&#21319;&#32423;&#36719;&#20214;&#21253;&#21464;&#24471;&#31616;&#21333;&#12290; &#21253;&#31649;&#29702;&#22120;&#20250;&#22788;&#29702;&#37197;&#32622;&#25991;&#20214;&#20197;&#21450;&#20108;&#36827;&#21046;&#25991;&#20214;&#21644;&#24211;&#25991;&#20214;&#30340;&#23433;&#35013;&#12290;  &#22312;&#20320;&#24320;&#22987;&#24778;&#35766;&#20043;&#21069;&#65292; NO--&#22312;&#36825;&#19968;&#37096;&#20998;&#37324;&#65292;&#25105;&#20204;&#19981;&#20250;&#35752;&#35770;&#25110;&#32773;&#26159;&#25512;&#33616;&#20219;&#20309;&#19968;&#20010;&#29305;&#21035;&#30340;&#21253;&#31649;&#29702;&#22120;&#12290; &#25105;&#20204;&#35762;&#36848;&#30340;&#26159;&#19968;&#20123;&#27969;&#34892;&#30340;&#25216;&#26415;&#65292;&#20197;&#21450;&#20182; &#20204;&#26159;&#24590;&#20040;&#24037;&#20316;&#30340;&#12290; &#23545;&#20110;&#20320;&#26469;&#35828;&#65292;   &#19968;&#20010;&#23436;&#32654;&#30340;&#21253;&#31649;&#29702;&#22120;&#21487;&#33021;&#22312;&#36825;&#20123;&#25216;&#26415;&#20043;&#20013;&#65292; &#20063;&#21487;&#33021;&#26159;&#20004;&#20010;&#25110;&#26356;&#22810;&#12290; &#36825;&#19968;&#37096;&#20998;&#31616;&#26126;&#30340;&#25551;&#36848;&#20102;&#24403;&#21319;&#32423;&#36719;&#20214;&#21253;&#30340;&#26102;&#20505;&#20250;&#20986;&#29616;&#30340;&#20960;&#20010;&#38382;&#39064;&#12290;</p>
      <p>LFS &#21644; BLFS &#20013;&#27809;&#26377;&#28041;&#21450;&#21253;&#31649;&#29702;&#22120;&#30340;&#20960;&#20010;&#21407;&#22240;&#65306;</p>
      <div class="itemizedlist">
        <ul>
          <li>
            <p>&#25226;&#31934;&#21147;&#25343;&#26469;&#20570;&#21253;&#31649;&#29702;&#22120;&#65292;&#23601;&#20559;&#31163;&#20102;&#25105;&#20204;&#30340;LFS&#30340;&#21021;&#34935;&#65306;&#25351;&#23548;&#22914;&#26524;&#26500;&#24314;&#19968;&#20010;Linux&#31995;&#32479;&#12290;</p>
          </li>
          <li>
            <p>
              &#21253;&#31649;&#29702;&#26377;&#24456;&#22810;&#35299;&#20915;&#26041;&#26696;&#65292;&#27599;&#19968;&#20010;&#37117;&#26377;&#20248;&#28857;&#21644;&#32570;&#28857;&#12290;&#20219;&#20309;&#19968;&#20010;&#37117;&#24456;&#38590;&#20196;&#25152;&#26377;&#35835;&#32773;&#37117;&#28385;&#24847;&#12290;</p>
          </li>
        </ul>
      </div>
      <p>&#26377;&#19968;&#20123;hints&#26159;&#20851;&#20110;&#21253;&#31649;&#29702;&#12290;&#21487;&#20197;&#26597;&#30475; <a class="ulink" href=
        "http://www.linuxfromscratch.org/hints/list.html">Hints Project</a> &#26469;&#36873;&#25321;&#19968;&#20010;&#36866;&#21512;&#20320;&#30340;&#12290;</p>
      <div class="sect2" lang="en" xml:lang="en">
        <h2 class="sect2">
        6.3.1.&#21319;&#32423;&#38382;&#39064;        </h2>
        <p>&#21253;&#31649;&#29702;&#22120;&#20250;&#20351;&#21319;&#32423;&#19968;&#20010;&#36719;&#20214;&#21253;&#21040;&#26032;&#30340;&#29256;&#26412;&#65288;&#24403;&#23427;&#21457;&#24067;&#20197;&#21518;&#65289;&#21464;&#24471;&#24456;&#31616;&#21333;&#12290; &#36890;&#24120; LFS &#21644; BLFS &#25163;&#20876;&#20013;&#30340;&#35828;&#26126;&#21487;&#20197;&#29992;&#26469;&#21319;&#32423;&#21040;&#26356;&#26032;&#29256;&#30340;&#36719;&#20214;&#21253;&#12290; &#36825;&#37324;&#26377;&#20960;&#28857;&#20320;&#22312;&#21319;&#32423;&#36719;&#20214;&#21253;&#30340;&#26102;&#20505;&#24212;&#35813;&#27880;&#24847;&#65292; &#23588;&#20854;&#26159;&#22312;&#19968;&#20010;&#36816;&#34892;&#30528;&#30340;&#31995;&#32479;&#19978;&#12290;</p>
        <div class="itemizedlist">
          <ul>
            <li>
              <p>
                &#22914;&#26524;&#24037;&#20855;&#38142;&#20013;&#30340;&#19968;&#20010;&#36719;&#20214;&#21253; (Glibc, GCC &#25110; Binutils) &#38656;&#35201;&#21319;&#32423;&#21040;&#19968;&#20010;&#26032;&#30340;&#27425;&#29256;&#26412;&#65292; &#37325;&#26032;&#26500;&#24314;LFS&#20250;&#26356;&#23433;&#20840;&#12290; &#23613;&#31649;&#20320;<span class=
                "emphasis"><em>&#21487;&#20197;</em></span>&#25353;&#29031;&#20381;&#36182;&#20851;&#31995;&#65292; &#21482;&#26159;&#37325;&#26032;&#26500;&#24314;&#19968;&#37096;&#20998;&#30340;&#36719;&#20214;&#21253;&#12290; &#20294;&#25105;&#20204;&#24182;&#19981;&#25512;&#33616;&#36825;&#26679;&#20570;&#12290; &#20363;&#22914;&#65292;&#22914;&#26524; glibc-2.2.x &#38656;&#35201;&#21319;&#32423;&#21040; glibc-2.3.x&#65292; &#37325;&#26032;&#26500;&#24314;&#26159;&#27604;&#36739;&#23433;&#20840;&#30340;&#12290; &#23545;&#20110;&#23567;&#29256;&#26412;&#30340;&#21319;&#32423;&#65292; &#31616;&#21333;&#30340;&#37325;&#26032;&#23433;&#35013;&#36890;&#24120;&#21487;&#20197;&#27491;&#24120;&#30340;&#24037;&#20316;&#65292; &#20294;&#26159;&#19981;&#33021;&#22815;&#20445;&#35777;&#12290; &#20363;&#22914;&#65292;&#20174; glibc-2.3.4 &#21319;&#32423;&#21040; glibc-2.3.5 &#36890;&#24120;&#19981;&#20250;&#26377;&#38382;&#39064;&#12290;</p>
            </li>
            <li>
              <p>
                &#22914;&#26524;&#21253;&#21547;&#19968;&#20010;&#20849;&#20139;&#24211;&#30340;&#36719;&#20214;&#21253;&#21319;&#32423;&#65292;&#24182;&#19988;&#20849;&#20139;&#24211;&#30340;&#21517;&#23383;&#21457;&#29983;&#20102;&#21464;&#21270;&#12290;&#21160;&#24577;&#38142;&#25509;&#21040;&#36825;&#20010;&#24211;&#30340;&#25152;&#26377;&#30340; &#21253;&#37117;&#38656;&#35201;&#37325;&#26032;&#32534;&#35793;&#38142;&#25509;&#21040;&#26032;&#30340;&#24211; (&#27880;&#24847;&#21253;&#30340;&#29256;&#26412;&#21644;&#24211;&#30340;&#21517;&#23383;&#27809;&#26377;&#20851;&#31995;&#65289;&#12290;&#20363;&#22914;&#65292;&#19968;&#20010;&#36719;&#20214;&#21253; foo-1.2.3 &#23433;&#35013;&#20102;&#19968;&#20010;&#21517;&#20026; <code class=
                "filename">libfoo.so.1</code>  &#30340;&#20849;&#20139;&#24211;&#12290;&#20320;&#21319;&#32423;&#36825;&#20010;&#21253;&#21040;&#26032;&#29256;&#26412;   foo-1.2.4&#65292; &#36825;&#20010;&#26032;&#29256;&#26412;&#23433;&#35013;&#21517;&#20026; <code class="filename">libfoo.so.2</code>  &#30340;&#20849;&#20139;&#24211;&#12290;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#25152;&#26377;&#38142;&#25509;&#21040;  <code class=
                "filename">libfoo.so.1</code>&#30340;&#21253;&#37117;&#38656;&#35201;&#37325;&#26032;&#32534;&#35793;&#38142;&#25509;&#21040; <code class="filename">libfoo.so.2</code>&#12290; &#27880;&#24847;&#22312;&#20381;&#36182;&#30340;&#36719;&#20214;&#21253;&#27809;&#26377;&#32534;&#35793;&#23436;&#20043;&#21069;&#65292; &#19981;&#35201;&#21024;&#38500;&#21407;&#26469;&#30340;&#24211;&#12290;</p>
            </li>
          </ul>
        </div>
      </div>
      <div class="sect2" lang="en" xml:lang="en">
        <h2 class="sect2">
          6.3.2. &#21253;&#31649;&#29702;&#25216;&#26415;</h2>
        <p>
          &#19979;&#38754;&#26159;&#19968;&#20123;&#24120;&#29992;&#30340;&#21253;&#31649;&#29702;&#30340;&#25216;&#26415;&#12290;&#22312;&#20915;&#23450;&#23433;&#35013;&#21253;&#31649;&#29702;&#22120;&#20043;&#21069;&#65292;&#23545;&#22810;&#31181;&#21253;&#31649;&#29702;&#25216;&#26415;&#36827;&#34892;&#19968;&#19979;&#30740;&#31350;&#65292; &#25214;&#20986;&#26576;&#19968;&#31181;&#26041;&#26696;&#30340;&#32570;&#28857;&#12290;</p>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
            6.3.2.1. &#20840;&#37096;&#35760;&#22312;&#24515;&#37324;&#65281;</h3>
          <p>
            &#26159;&#30340;&#65292;&#36825;&#26159;&#19968;&#31181;&#21253;&#31649;&#29702;&#30340;&#25216;&#26415;&#12290;&#19968;&#20123;&#20154;&#19981;&#38656;&#35201;&#21253;&#31649;&#29702;&#22120;&#65292;&#22240;&#20026;&#20182;&#20204;&#23545;&#21253;&#37117;&#38750;&#24120;&#29087;&#24713;&#65292; &#30693;&#36947;&#27599;&#19968;&#20010;&#21253;&#25152;&#23433;&#35013;&#30340;&#25991;&#20214;&#12290;   &#19968;&#20123;&#20154;&#20063;&#19981;&#38656;&#35201;&#21253;&#31649;&#29702;&#22120;&#65292; &#26159;&#22240;&#20026;&#24403;&#19968;&#20010;&#36719;&#20214;&#21253;&#25913;&#21464;&#26102;&#65292; &#20182;&#20204;&#20250;&#37325;&#26032;&#26500;&#24314;&#25972;&#20010;&#31995;&#32479;&#12290;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
            6.3.2.2. &#20998;&#21035;&#23433;&#35013;&#21040;&#19981;&#21516;&#30446;&#24405;</h3>
          <p>
            &#36825;&#26159;&#19968;&#31181;&#26368;&#31616;&#21333;&#30340;&#21253;&#31649;&#29702;&#26041;&#24335;&#65292;&#19981;&#38656;&#35201;&#23433;&#35013;&#39069;&#22806;&#30340;&#36719;&#20214;&#21253;&#26469;&#31649;&#29702;&#23433;&#35013;&#36807;&#31243;&#12290; &#27599;&#19968;&#20010;&#36719;&#20214;&#21253;&#23433;&#35013;&#21040;&#19981;&#21516;&#30340;&#30446;&#24405;&#19979;&#12290;&#20363;&#22914;&#65292;&#21253; foo-1.1
            &#23433;&#35013;&#21040; <code class="filename">/usr/pkg/foo-1.1</code>
            &#30446;&#24405;&#65292;&#24182;&#21019;&#24314;&#19968;&#20010;&#20174; <code class=
            "filename">/usr/pkg/foo</code> &#21040; <code class=
            "filename">/usr/pkg/foo-1.1</code> &#30340;&#31526;&#21495;&#38142;&#25509;&#12290;&#24403;&#23433;&#35013;&#19968;&#20010;&#26032;&#29256;&#26412;            foo-1.2 &#26102;&#65292; &#23427;&#20250;&#23433;&#35013;&#22312; <code class=
            "filename">/usr/pkg/foo-1.2</code> &#30446;&#24405;&#65292;&#21069;&#38754;&#30340;&#31526;&#21495;&#38142;&#25509;&#20063;&#34987;&#25351;&#21521;&#26032;&#29256;&#26412;&#30340;&#31526;&#21495;&#38142;&#25509;&#21462;&#20195;&#12290;</p>
          <p>&#19968;&#20123;&#29615;&#22659;&#21464;&#37327;&#65292;&#20687; <code class="envar">PATH</code>,
            <code class="envar">LD_LIBRARY_PATH</code>, <code class=
            "envar">MANPATH</code>, <code class="envar">INFOPATH</code> &#21644;
            <code class="envar">CPPFLAGS</code> &#37117;&#38656;&#35201;&#22686;&#21152; <code class="filename">/usr/pkg/foo</code>&#12290;&#24403;&#36719;&#20214;&#21253;&#25968;&#37327;&#22823;&#20102;&#20043;&#21518;&#65292;&#23601;&#38590;&#20110;&#31649;&#29702;&#20102;&#12290; </p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
            6.3.2.3.&#31526;&#21495;&#36830;&#25509;&#39118;&#26684;&#30340;&#21253;&#31649;&#29702;          </h3>
          <p>&#36825;&#26159;&#21069;&#38754;&#21253;&#31649;&#29702;&#25216;&#26415;&#30340;&#19968;&#20010;&#21464;&#31181;&#12290;&#27599;&#19968;&#20010;&#21253;&#20063;&#26159;&#25353;&#29031;&#31867;&#20284;&#20110;&#21069;&#38754;&#26041;&#27861;&#36827;&#34892;&#23433;&#35013;&#12290;&#20294;&#26159;&#19981;&#26159;&#21019;&#24314;&#31526;&#21495;&#38142;&#25509;&#65292; &#32780;&#26159;&#27599;&#19968;&#20010;&#37117;&#34987;&#38142;&#25509;&#21040; <code class="filename">/usr</code>  &#30446;&#24405;&#12290;&#36825;&#26679;&#23601;&#19981;&#38656;&#35201;&#28155;&#21152;&#29615;&#22659;&#21464;&#37327;&#20102;&#12290;&#34429;&#28982;&#36825;&#20123;&#31526;&#21495;&#38142;&#25509;&#21487;&#20197;&#30001;&#29992;&#25143;&#33258;&#21160;&#21019;&#24314;&#65292;&#20294;&#36824;&#26159;&#26377;&#24456;&#22810;&#36719;&#20214;&#21253;&#26159;&#37319;&#29992;&#36825;&#31181;&#26041;&#27861;&#30340;&#12290;&#19968;&#20123;&#27604;&#36739;&#27969;&#34892;&#30340;&#36719;&#20214;&#21253;&#25324;&#65306;  Stow, Epkg, Graft, &#21644; Depot&#12290;</p>
          <p>&#23433;&#35013;&#36807;&#31243;&#38656;&#35201;&#20266;&#36896;&#65292;&#36825;&#26679;&#21253;&#23601;&#20250;&#35748;&#20026;&#33258;&#24049;&#34987;&#23433;&#35013;&#21040;&#20102;<code class="filename">/usr</code> &#30446;&#24405;&#65292;&#23613;&#31649;&#23454;&#38469;&#19978; &#23427;&#20204;&#23433;&#35013;&#21040; <code class=
            "filename">/usr/pkg</code> &#30446;&#24405;&#19979;&#12290;&#20197;&#36825;&#31181;&#39118;&#26684;&#23433;&#35013;&#24182;&#19981;&#26159;&#24456;&#40635;&#28902;&#30340;&#20107;&#24773;&#12290;&#27604;&#22914;&#65292;&#20320;&#35201; &#23433;&#35013;&#19968;&#20010;&#21253; libfoo-1.1 &#12290; &#29992;&#19979;&#38754;&#30340;&#25351;&#20196;&#23433;&#35013;&#23601;&#19981;&#21512;&#36866;&#65306;</p>
          <pre class="userinput"><kbd class=
          "command">./configure --prefix=/usr/pkg/libfoo/1.1
make
make install</kbd></pre>
          <p>
            &#23433;&#35013;&#26159;&#27809;&#26377;&#38382;&#39064;&#65292;&#20294;&#26159;&#20381;&#36182;&#30340;&#21253;&#19981;&#33021;&#22815;&#20687;&#20320;&#24819;&#20687;&#30340;&#37027;&#26679;&#38142;&#25509;&#21040;  libfoo&#65292; &#22914;&#26524;&#20320;&#32534;&#35793;&#19968;&#20010;&#38142;&#25509;&#21040; libfoo &#30340;&#21253;&#65292;&#20320;&#23601;&#35201;&#27880;&#24847;&#65292;&#35201;&#38142;&#25509;&#21040;            <code class="filename">/usr/pkg/libfoo/1.1/lib/libfoo.so.1</code>&#65292; &#32780;&#19981;&#26159;&#20687;&#20320;&#24819;&#20687;&#30340;&#37027;&#26679;&#38142;&#25509;&#21040; <code class="filename">/usr/lib/libfoo.so.1</code>&#12290;&#27491;&#30830;&#30340;&#26041;&#27861;&#26159;&#20351;&#29992;  <code class=
            "envar">DESTDIR</code>&#26469;&#20266;&#36896;&#21253;&#30340;&#23433;&#35013;&#12290; &#21487;&#20197;&#36825;&#26679;&#26469;&#20351;&#29992;&#36825;&#31181;&#26041;&#27861;&#65306;</p>
          <pre class="userinput"><kbd class=
          "command">./configure --prefix=/usr
make
make DESTDIR=/usr/pkg/libfoo/1.1 install</kbd></pre>
          <p>
            &#22823;&#22810;&#25968;&#30340;&#21253;&#37117;&#25903;&#25345;&#36825;&#31181;&#26041;&#27861;&#65292;&#20294;&#36824;&#26159;&#26377;&#19968;&#20123;&#19981;&#25903;&#25345;&#12290;&#23545;&#20110;&#36825;&#20123;&#19981;&#20860;&#23481;&#30340;&#21253;&#65292;&#20320;&#21487;&#20197;&#25163;&#24037;&#23433;&#35013;&#65292; &#25110;&#35768;&#25226;&#19968;&#20123;&#26377;&#38382;&#39064;&#30340;&#21253;&#23433;&#35013;&#21040; <code class=
            "filename">/opt</code>  &#21487;&#33021;&#26356;&#31616;&#21333;&#12290;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
          6.3.2.4. &#22522;&#20110;&#26102;&#38388;&#25139;          </h3>
          <p>
            &#36825;&#31181;&#25216;&#26415;&#37324;&#65292;&#22312;&#23433;&#35013;&#21253;&#20043;&#21069;&#65292;&#20250;&#21019;&#24314;&#19968;&#20010;&#26102;&#38388;&#25139;&#26631;&#35760;&#25991;&#20214;&#12290;&#23433;&#35013;&#20043;&#21518;&#65292;&#31616;&#21333;&#30340;&#20351;&#29992;&#30340; <strong> </strong> <span class="command"><strong>find</strong></span>&#21629;&#20196;&#30340;&#26576;&#20123;&#36873;&#39033;&#23601;&#33021;&#29983;&#25104;&#19968;&#20010;&#26102;&#38388;&#25139;&#26631;&#35760;&#25991;&#20214;&#21019;&#24314;&#20043;&#21518;&#23433;&#35013;&#30340;&#25991;&#20214;&#30340;&#26085;&#24535;&#12290;install-log &#23601;&#26159;&#21033;&#29992;&#36825;&#31181;&#25216;&#26415;&#20889;&#30340;&#21253;&#31649;&#29702;&#22120;&#12290;</p>
          <p>
            &#23613;&#31649;&#36825;&#31181;&#26041;&#27861;&#31616;&#21333;&#65292;&#20294;&#26159;&#23427;&#26377;&#20004;&#20010;&#32570;&#28857;&#12290; &#22914;&#26524;&#22312;&#23433;&#35013;&#30340;&#36807;&#31243;&#20013;&#65292; &#23433;&#35013;&#30340;&#25991;&#20214;&#30340;&#26102;&#38388;&#25139;&#19981;&#26159;&#24403;&#21069;&#30340;&#26102;&#38388;&#65292;  &#36825;&#20123;&#25991;&#20214;&#23558;&#19981;&#20250;&#34987;&#21253;&#31649;&#29702;&#22120;&#35760;&#24405;&#12290;   &#21478;&#22806;&#65292;&#36825;&#31181;&#26041;&#26696;&#21482;&#33021;&#29992;&#22312;&#19968;&#27425;&#21482;&#26377;&#19968;&#20010;&#21253;&#23433;&#35013;&#26102; &#12290;&#22914;&#26524;&#26377;&#20004;&#20010;&#21253;&#22312;&#20004;&#20010;&#32456;&#31471;&#19979;&#21516;&#26102;&#23433;&#35013;&#65292; &#37027;&#20040;&#36825;&#26102;&#30340;&#26085;&#24535;&#26159;&#19981;&#21487;&#38752;&#30340;&#12290;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
            6.3.2.5. &#36319;&#36394;&#23433;&#35013;&#33050;&#26412;</h3>
          <p>
            &#22312;&#36825;&#31181;&#25216;&#26415;&#20013;&#65292;&#23433;&#35013;&#33050;&#26412;&#25191;&#34892;&#30340;&#21629;&#20196;&#20250;&#34987;&#35760;&#24405;&#12290;&#26377;&#20004;&#31181;&#25216;&#26415;&#21487;&#20197;&#20351;&#29992;&#65306;</p>
          <p>
          &#22312;&#23433;&#35013;&#20043;&#21069;&#65292;<code class="envar">LD_PRELOAD</code>  &#29615;&#22659;&#21464;&#37327;&#20250;&#35774;&#32622;&#25104;&#25351;&#21521;&#19968;&#20010;&#34987;&#25552;&#21069;&#21152;&#36733;&#30340;&#24211;&#12290; &#22312;&#23433;&#35013;&#30340;&#36807;&#31243;&#20013;&#65292;   &#36825;&#20010;&#24211;&#23601;&#20250;&#36319;&#36394;&#27491;&#22312;&#23433;&#35013;&#30340;&#21253;&#65292;&#36890;&#36807;&#32473;&#33258;&#24049;&#38468;&#21152;&#19978;&#21508;&#31181;&#21487;&#25191;&#34892;&#24615;&#30340;&#21160;&#20316;&#65292;&#20687; <strong><span class=
            "command"><strong>cp</strong></span>, <span class=
            "command"><strong>install</strong></span>, <span class=
            "command"><strong>mv</strong></span></strong>&#65292; &#26469;&#36319;&#36394;&#37027;&#20123;&#20462;&#25913;&#25991;&#20214;&#31995;&#32479;&#31995;&#32479;&#35843;&#29992;&#12290;&#20026;&#20102;&#35753;&#36825;&#31181;&#26041;&#27861;&#27491;&#24120;&#30340;&#24037;&#20316;&#65292; &#25152;&#26377;&#30340;&#21487;&#25191;&#34892;&#25991;&#20214;&#38656;&#35201; &#37117;&#26159;&#21160;&#24577;&#38142;&#25509;&#30340;&#19988;&#27809;&#26377;&#35774;&#32622; suid   &#21644; sgid &#20301;&#12290; &#39044;&#20808;&#21152;&#36733;&#24211;&#21487;&#33021;&#20250;&#20135;&#29983;&#19968;&#20123;&#35752;&#21388;&#30340;&#21103;&#20316;&#29992;&#12290; &#22240;&#27492;&#65292; &#24314;&#35758;&#20570;&#19968;&#20123;&#27979;&#35797;&#65292; &#26469;&#30830;&#20445;&#21253;&#31649;&#29702;&#22120;&#19981;&#20250;&#30772;&#22351;&#20219;&#20309;&#19996;&#35199;&#65292; &#24182;&#19988;&#33021;&#22815;&#35760;&#24405;&#25152;&#26377;&#36866;&#24403;&#30340;&#25991;&#20214;&#12290;</p>
          <p>&#31532;&#20108;&#31181;&#25216;&#26415;&#26159;&#20351;&#29992; <strong><span class=
            "command"><strong>strace</strong></span></strong>&#65292;&#23427;&#35760;&#24405;&#25191;&#34892;&#23433;&#35013;&#33050;&#26412;&#36807;&#31243;&#20013;&#36827;&#34892;&#30340;&#25152;&#26377;&#31995;&#32479;&#35843;&#29992;&#12290;</p>
          </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
          6.3.2.6. &#21019;&#24314;&#21253;&#30340;&#24402;&#26723;          </h3>
          <p>
            &#22312;&#36825;&#31181;&#26041;&#26696;&#20013;&#65292;&#21253;&#34987;&#20551;&#35013;&#23433;&#35013;&#21040;&#19981;&#21516;&#30340;&#30446;&#24405;&#26641;&#19979;&#65292;&#23601;&#20687;&#31526;&#21495;&#36830;&#25509;&#39118;&#26684;&#30340;&#21253;&#31649;&#29702;&#25551;&#36848;&#30340;&#12290;&#23433;&#35013;&#20043;&#21518;&#65292;   &#31995;&#32479;&#23601;&#20250;&#20351;&#29992;&#23433;&#35013;&#30340;&#25991;&#20214;&#21019;&#24314;&#19968;&#20010;&#21253;&#30340;&#24402;&#26723;&#12290;&#36825;&#20010;&#24402;&#26723;&#21487;&#20197;&#22312;&#26412;&#26426;&#19978;&#23433;&#35013;&#21253;&#65292; &#29978;&#33267;&#21487;&#20197;&#22312;&#20854;&#20182;&#26426;&#22120;&#19978;&#23433;&#35013;&#21253;&#12290;</p>
          <p>
            &#36825;&#31181;&#26041;&#27861;&#34987;&#22823;&#22810;&#25968;&#21830;&#19994;&#21457;&#34892;&#29256;&#30340;&#21253;&#31649;&#29702;&#22120;&#37319;&#29992;&#12290; &#37319;&#29992;&#36825;&#31181;&#26041;&#27861;&#30340;&#21253;&#31649;&#29702;&#20363;&#23376;&#26377;RPM (&#39034;&#20415;&#25552;&#19968;&#21477;&#65292; &#26159; <a class="ulink" href=
            "http://www.linux-foundation.org/en/Specifications">Linux
            Standard Base Specification</a> &#38656;&#35201;&#30340;)&#65292; pkg-utils, Debian &#30340; apt, &#21644;
            Gentoo &#30340; Portage &#31995;&#32479;&#12290; &#26377;&#19968;&#20010;&#25551;&#36848;&#22312; LFS &#31995;&#32479;&#20013;&#22914;&#20309;&#24212;&#29992;&#36825;&#26679;&#30340;&#21253;&#31649;&#29702;&#22120;&#30340; hint&#65292;&#35831;&#21442;&#32771; <a class="ulink" href=
            "http://www.linuxfromscratch.org/hints/downloads/files/fakeroot.txt">http://www.linuxfromscratch.org/hints/downloads/files/fakeroot.txt</a>&#12290;</p>
          <p>&#21019;&#24314;&#21253;&#21547;&#20381;&#36182;&#20449;&#24687;&#30340;&#21253;&#25991;&#20214;&#24456;&#22797;&#26434;&#65292;&#24182;&#19988;&#36229;&#20986;&#20102; LFS &#30340;&#33539;&#22260;&#12290;</p>
          <p>
            Slackware &#20351;&#29992; <span class=
            "command"><strong>tar </strong></span>&#22522;&#30784;&#31995;&#32479;&#20316;&#20026;&#21253;&#24402;&#26723;&#12290; &#36825;&#20010;&#31995;&#32479;&#19981;&#20687;&#26356;&#22797;&#26434;&#30340;&#21253;&#31649;&#29702;&#22120;&#19968;&#26679;&#22788;&#29702;&#21253;&#20381;&#36182;&#12290; &#20851;&#20110;Slackware &#30340;&#21253;&#31649;&#29702;&#32454;&#33410;&#65292;&#35831;&#21442;&#32771; <a class="ulink" href=
            "http://www.slackbook.org/html/package-management.html">http://www.slackbook.org/html/package-management.html</a>.          </p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
          6.3.2.7. &#22522;&#20110;&#29992;&#25143;&#30340;&#31649;&#29702;</h3>
          <p>
            &#36825;&#31181;&#26041;&#26696;&#26159; LFS &#29305;&#26377;&#30340;&#65292;&#26159;&#30001;  Matthias Benkmann &#25552;&#20986;&#30340;&#65292;&#21487;&#20197;&#21442;&#32771;  <a class="ulink" href=
            "http://www.linuxfromscratch.org/hints/list.html">Hints
            Project</a>&#12290; &#22312;&#36825;&#31181;&#26041;&#26696;&#37324;&#65292;&#27599;&#19968;&#20010;&#21253;&#37117;&#26159;&#20197;&#19981;&#21516;&#30340;&#29992;&#25143;&#23433;&#35013;&#21040;&#26631;&#20934;&#30340;&#30446;&#24405;&#37324;&#12290;&#36890;&#36807;&#26816;&#39564; user ID   &#21487;&#20197;&#24456;&#23481;&#26131;&#30340;&#26631;&#35782;&#19968;&#20010;&#36719;&#20214;&#21253;&#12290; &#36825;&#31181;&#26041;&#27861;&#30340;&#29305;&#28857;&#21644;&#32570;&#28857;&#38750;&#24120;&#22797;&#26434;&#65292;&#36825;&#37324;&#23601;&#19981;&#25551;&#36848;&#20102;&#12290;&#35814;&#32454;&#20869;&#23481;&#21442;&#35265;<a class="ulink" href=
            "http://www.linuxfromscratch.org/hints/downloads/files/more_control_and_pkg_man.txt">
            http://www.linuxfromscratch.org/hints/downloads/files/more_control_ and_pkg_man.txt</a>.          </p>
        </div>
      </div>
      <div class="sect2" lang="en" xml:lang="en">
        <h2 class="sect2">
        6.3.3. &#22312;&#22810;&#31995;&#32479;&#19978;&#37096;&#32626;LFS        </h2>
        <p>LFS&#31995;&#32479;&#30340;&#19968;&#20010;&#20248;&#28857;&#26159;&#65292; &#20219;&#20309;&#25991;&#20214;&#37117;&#19981;&#20381;&#36182;&#20854;&#22312;&#30913;&#30424;&#31995;&#32479;&#19978;&#30340;&#20301;&#32622;&#12290; &#23558;LFS&#31995;&#32479;&#20811;&#38534;&#21040;&#21478;&#19968;&#20010;&#19982;   &#22522;&#30784;&#31995;&#32479;&#20307;&#31995;&#32467;&#26500;&#30456;&#20284;&#30340;&#35745;&#31639;&#26426;&#19978;&#65292;&#21644;&#22312;&#21253;&#21547;root&#30446;&#24405;&#30340;LFS&#20998;&#21306;&#19978;&#20351;&#29992; <span class=
          "command"><strong>tar</strong></span> (&#19968;&#20010;&#38750;&#21387;&#32553;&#30340; LFS &#22522;&#30784;&#31995;&#32479;&#22823;&#32422;250M)&#65292; &#36890;&#36807;&#32593;&#32476;&#20256;&#36755;&#25110;CD-ROM &#25335;&#36125;&#25991;&#20214;&#21040;&#26032;&#31995;&#32479;&#24182;&#23637;&#24320;&#23427;&#19968;&#26679;&#31616;&#21333;&#12290; &#36825;&#26102;&#65292;&#19968;&#20123;&#37197;&#32622;&#38382;&#39064;&#20214;&#24517;&#39035;&#35201;&#26356;&#25913;&#12290;&#21487;&#33021;&#38656;&#35201;&#21319;&#32423;&#30340;&#37197;&#32622;&#25991;&#20214;&#21253;&#25324;&#65306; <code class="filename">/etc/hosts</code>,
          <code class="filename">/etc/fstab</code>, <code class=
          "filename">/etc/passwd</code>, <code class=
          "filename">/etc/group</code>, <code class=
          "filename">/etc/shadow</code>, <code class=
          "filename">/etc/ld.so.conf</code>, <code class=
          "filename">/etc/scsi_id.config</code>, <code class=
          "filename">/etc/sysconfig/network</code> &#21644; <code class=
          "filename">/etc/sysconfig/network-devices/ifconfig.eth0/ipv4</code>&#12290;</p>
        <p>&#20026;&#20102;&#20351;&#36825;&#20010;&#26032;&#31995;&#32479;&#36866;&#21512;&#19981;&#21516;&#30340;&#31995;&#32479;&#30828;&#20214;&#21644;&#21407;&#22987;&#20869;&#26680;&#37197;&#32622;&#65292;&#25105;&#20204;&#21487;&#33021;&#38656;&#35201;&#32534;&#35793;&#19968;&#20010;&#23450;&#21046;&#30340;&#20869;&#26680;&#12290;</p>
        <p>&#26368;&#21518;&#65292;&#26032;&#31995;&#32479;&#24517;&#39035;&#21442;&#29031; <a class="xref"
          href="../chapter08/grub.html" title=
          "8.4.&nbsp;Using GRUB to Set Up the Boot Process">Section&nbsp;8.4,
          &ldquo;&#20351;&#29992; GRUB &#37197;&#32622;&#21551;&#21160;&#36807;&#31243;&rdquo;</a> &#37197;&#32622;&#25104;&#21487;&#21551;&#21160;&#12290;</p>
      </div>
    </div>
    <div class="navfooter">
      <ul>
        <li class="prev">
          <a accesskey="p" href="kernfs.html" title=
          "Preparing Virtual Kernel File Systems">&#21518;&#36864;</a>
          <p>
            &#20934;&#22791;&#34394;&#25311;&#20869;&#26680;&#25991;&#20214;&#31995;&#32479;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="chroot.html" title=
          "Entering the Chroot Environment">&#21069;&#36827;</a>
          <p>
            &#36827;&#20837; Chroot &#29615;&#22659;
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter06.html" title=
          "Chapter&nbsp;6.&nbsp;Installing Basic System Software">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
  </body>
</html>
