<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <meta http-equiv="Content-Type" content=
    "application/xhtml+xml; charset=iso-8859-1" />
    <title>
      7.9.&nbsp;Device and Module Handling on an LFS System
    </title>
    <link rel="stylesheet" href="../stylesheets/lfs.css" type="text/css" />
    <meta name="generator" content="DocBook XSL Stylesheets V1.73.2" />
    <link rel="stylesheet" href="../stylesheets/lfs-print.css" type=
    "text/css" media="print" />
  </head>
  <body class="lfs" id="lfs-6.6">
    <div class="navheader">
      <h4>
        Linux From Scratch - Version 6.6
      </h4>
      <h3>
        Chapter&nbsp;7.&nbsp;&#37197;&#32622;&#31995;&#32479;&#21551;&#21160;&#33050;&#26412;</h3>
      <ul>
        <li class="prev">
          <a accesskey="p" href="profile.html" title=
          "The Bash Shell Startup Files">&#21518;&#36864;</a>
          <p>
            Bash Shell &#21551;&#21160;&#25991;&#20214;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="symlinks.html" title=
          "Creating Custom Symlinks to Devices">&#21069;&#36827;</a>
          <p>
            &#20026;&#35774;&#22791;&#21019;&#24314;&#24815;&#29992;&#31526;&#21495;&#36830;&#25509; 
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter07.html" title=
          "Chapter&nbsp;7.&nbsp;Setting Up System Bootscripts">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
    <div class="sect1" lang="en" xml:lang="en">
      <h1 class="sect1">
        <a id="ch-scripts-udev" name="ch-scripts-udev"></a>7.9. LFS &#31995;&#32479;&#30340;&#35774;&#22791;&#21644;&#27169;&#22359;&#22788;&#29702;
      </h1>
      <p>
        &#22312;<a class="xref" href="../chapter06/chapter06.html" title=
        "Chapter&nbsp;6.&nbsp;Installing Basic System Software">Chapter
        6</a>&#20013;&#65292; &#25105;&#20204;&#23433;&#35013;&#20102; Udev &#36719;&#20214;&#21253;&#12290; &#22312;&#24320;&#22987;&#28145;&#20837;&#35752;&#35770;&#23427;&#22914;&#20309;&#24037;&#20316;&#20043;&#21069;&#65292; &#25105;&#20204;&#20808;&#31616;&#35201;&#22238;&#39038;&#19968;&#19979;&#20197;&#21069;&#22788;&#29702;&#35774;&#22791;&#30340;&#26041;&#27861;&#12290;</p>
      <p>&#20256;&#32479;&#19978;&#19968;&#33324; Linux &#31995;&#32479;&#20351;&#29992;&#21019;&#24314;&#38745;&#24577;&#35774;&#22791;&#30340;&#26041;&#27861;&#65292;&#22240;&#27492;&#22312; /dev&#30446;&#24405;&#19979;&#21019;&#24314;&#20102;&#22823;&#37327;&#30340;&#35774;&#22791;&#33410;&#28857;   (&#26377;&#26102;&#20250;&#26377;&#25968;&#21315;&#20010;&#33410;&#28857;)&#65292;&#32780;&#19981;&#31649;&#23545;&#24212;&#30340;&#30828;&#20214;&#35774;&#22791;&#23454;&#38469;&#19978;&#26159;&#21542;&#23384;&#22312;&#12290;&#36825;&#36890;&#24120;&#26159;&#30001;<strong>MAKEDEV</strong>&#33050;&#26412;&#23436;&#25104;&#30340;&#65292; &#36825;&#20010;&#33050;&#26412;&#21253;&#21547;&#35768;&#22810;&#35843;&#29992; <strong>mknod</strong> &#31243;&#24207;&#30340;&#21629;&#20196;&#65292; &#20026;&#36825;&#20010;&#19990;&#30028;&#19978;&#21487;&#33021;&#23384;&#22312;&#30340;&#27599;&#20010; &#35774;&#22791;&#21019;&#24314;&#30456;&#24212;&#30340;&#20027;&#35774;&#22791;&#21495;&#21644;&#27425;&#35774;&#22791;&#21495;&#12290;</p>
      <p>&#20351;&#29992; Udev &#26041;&#24335;&#30340;&#26102;&#20505;&#65292;&#21482;&#26377;&#34987;&#20869;&#26680;&#26816;&#27979;&#21040;&#30340;&#35774;&#22791;&#25165;&#20026;&#20854;&#21019;&#24314;&#35774;&#22791;&#33410;&#28857;&#12290; &#22240;&#20026;&#27599;&#27425;&#31995;&#32479;&#21551;&#21160;&#30340;&#26102;&#20505;&#37117;&#35201;&#37325;&#26032;&#21019;&#24314;&#36825;&#20123;&#35774;&#22791;&#33410;&#28857;&#65292; &#25152;&#20197;&#23427;&#20204;&#34987;&#23384;&#20648;&#22312;tmpfs&#25991;&#20214;&#31995;&#32479;(&#19968;&#31181;&#23436;&#20840;&#23384;&#22312;&#20110;&#20869;&#23384;&#37324;&#30340;&#34394;&#25311;&#25991;&#20214;&#31995;&#32479;)&#19978;&#65292; &#35774;&#22791;&#33410;&#28857;&#19981;&#38656;&#35201;&#24456;&#22810;&#30913;&#30424;&#31354;&#38388;&#65292;&#25152;&#21344;&#29992;&#30340;&#20869;&#23384;&#21487;&#20197;&#24573;&#30053;&#19981;&#35745;&#12290; </p>
      <div class="sect2" lang="en" xml:lang="en">
        <h2 class="sect2">
          7.9.1. &#21382;&#21490;
        </h2>
        <p>
          2000 &#24180; 2 &#26376;&#65292; 2.3.46 &#29256;&#26412;&#30340;&#20869;&#26680;&#24341;&#20837;&#20102;&#19968;&#31181;&#31216;&#20026;  <code class=
          "systemitem">devfs</code> &#30340;&#26032;&#25991;&#20214;&#31995;&#32479;&#65292;&#24182;&#19988;&#65292;&#23427;&#22312; 2.4 &#31995;&#21015;&#31283;&#23450;&#29256;&#26412;&#30340;&#20869;&#26680;&#20013;&#37117;&#26159;&#21487;&#29992;&#30340;&#12290;&#23613;&#31649;&#23427;&#23384;&#22312;&#20110;&#20869;&#26680;&#28304;&#20195;&#30721;&#20013;&#65292;  &#20294;&#36825;&#31181;&#21160;&#24577;&#21019;&#24314;&#35774;&#22791;&#30340;&#26041;&#27861;&#21364;&#20174;&#26410;&#24471;&#21040;&#26680;&#24515;&#20869;&#26680;&#24320;&#21457;&#32773;&#20204;&#30340;&#20840;&#21147;&#25903;&#25345;&#12290;</p>
        <p><code class=
          "systemitem">devfs</code>&#23384;&#22312;&#30340;&#20027;&#35201;&#30340;&#38382;&#39064;&#26159;&#23427;&#22788;&#29702;&#35774;&#22791;&#26816;&#27979;&#12289; &#21019;&#24314;&#21644;&#21629;&#21517;&#30340;&#26041;&#24335;&#65292; &#20854;&#20013;&#35774;&#22791;&#33410;&#28857;&#30340;&#21629;&#21517;&#21487;&#33021;&#26159;&#26368;&#20005; &#37325;&#30340;&#38382;&#39064;&#12290; &#19968;&#33324;&#21487;&#25509;&#21463;&#30340;&#26041;&#24335;&#26159;&#65292; &#22914;&#26524;&#35774;&#22791;&#21517;&#26159;&#21487;&#37197;&#32622;&#30340;&#65292;   &#37027;&#20040;&#35774;&#22791;&#21629;&#21517;&#31574;&#30053;&#24212;&#35813;&#30001;&#31995;&#32479;&#31649;&#29702;&#21592; &#20915;&#23450;&#65292; &#32780;&#19981;&#26159;&#30001;&#26576;&#20123;&#24320;&#21457;&#32773;&#24378;&#21046;&#35268;&#23450;&#12290;<code class=
          "systemitem">devfs</code>&#25991;&#20214;&#31995;&#32479;&#36824;&#23384;&#22312;&#31454;&#20105;&#26465;&#20214;(race conditions) &#30340;&#38382;&#39064;&#65292;&#36825;&#26159;&#23427;&#22825;&#29983;&#30340;&#35774;&#35745;&#32570;&#38519;&#65292;&#19981;&#23545;&#20869;&#26680;&#20570;&#24443;&#24213;&#30340;&#20462;&#25913;&#23601;&#26080;&#27861;&#20462;&#27491;&#36825;&#20010;&#38382;&#39064;&#12290;&#22240;&#20026;&#36817;&#26469;&#32570;&#20047;&#32500;&#25252;&#65292;   &#23427;&#24050;&#32463;&#34987;&#26631;&#35760;&#20026; deprecated(&#21453;&#23545;&#30340;)&#65292;&#26368;&#32456;&#22312;2006&#24180;6&#26376;&#20174;&#20869;&#26680;&#20013;&#31227;&#38500;&#12290;</p>
        <p>&#38543;&#30528;&#38750;&#31283;&#23450;&#30340; 2.5 &#20869;&#26680;&#26641;&#30340;&#24320;&#21457;&#65292;&#21363;&#21518;&#26469;&#21457;&#24067;&#30340; 2.6 &#31995;&#21015;&#31283;&#23450;&#29256;&#26412;&#20869;&#26680;&#65292;&#19968;&#31181;&#34987;&#31216;&#20026; <code class="systemitem">sysfs</code>&#30340;&#26032;&#34394;&#25311;&#25991;&#20214;&#31995;&#32479;&#35806;&#29983;&#20102;&#12290;<code class="systemitem">sysfs</code>&#30340;&#24037;&#20316;&#26159;&#25226;&#31995;&#32479;&#30340;&#30828;&#20214;&#37197;&#32622;&#35270;&#22270;&#23548;&#20986;&#32473;&#29992;&#25143;&#31354;&#38388;&#30340;&#36827;&#31243;&#12290; &#30001;&#20110;&#26377;&#20102;&#36825;&#20010;&#29992;&#25143;&#31354;&#38388;&#21487;&#35265;&#30340;&#34920;&#31034;&#65292; &#20195;&#26367;<code class=
          "systemitem">devfs</code>&#26041;&#26696;&#30340;&#26102;&#26426;&#23601;&#25104;&#29087;&#20102;&#12290;</p>
      </div>
      <div class="sect2" lang="en" xml:lang="en">
        <h2 class="sect2">
          7.9.2. Udev &#23454;&#29616;
        </h2>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
            7.9.2.1. Sysfs
          </h3>
          <p>&#19978;&#38754;&#31616;&#21333;&#30340;&#25552;&#21040;&#20102;<code class="systemitem">sysfs</code>&#25991;&#20214;&#31995;&#32479;&#65292; &#24744;&#21487;&#33021;&#24819;&#30693;&#36947;<code class=
            "systemitem">sysfs</code>&#26159;&#24590;&#20040;&#35748;&#20986;&#31995;&#32479;&#20013;&#23384;&#22312;&#30340;&#35774;&#22791;&#20197;&#21450;&#24212;&#35813;&#20351;&#29992;&#20160;&#20040;&#35774;&#22791;&#21495;&#12290; &#23545;&#20110;&#24050;&#32463;&#32534;&#20837;&#20869;&#26680;&#30340;&#39537;&#21160;&#31243;&#24207;&#65292;&#24403;&#34987;&#20869;&#26680;&#26816;&#27979;&#21040;&#30340;&#26102;&#20505;&#65292;&#20250;&#30452;&#25509;&#22312;<code class="systemitem"> sysfs</code>&#20013;&#27880;&#20876;&#20854;&#23545;&#35937;&#65307; &#23545;&#20110;&#32534;&#35793;&#25104;&#27169;&#22359;&#30340;&#39537;&#21160;&#31243;&#24207;&#65292;&#24403;&#27169;&#22359;&#36733;&#20837;&#30340;&#26102;&#20505;&#25165;&#20250;&#36825;&#26679;&#20570;&#12290;&#19968;&#26086;&#25346;&#36733;&#20102;<code class="systemitem">sysfs</code>&#25991;&#20214;&#31995;&#32479; (&#25346;&#36733;&#21040;/sys)&#65292;&#20869;&#24314;&#30340;&#39537;&#21160;&#31243;&#24207;&#22312;sysfs&#27880;&#20876;&#30340;&#25968;&#25454;&#23601;&#21487;&#20197;&#34987;&#29992;&#25143;&#31354;&#38388;&#30340;&#36827;&#31243;&#20351;&#29992;&#65292;   &#24182;&#25552;&#20379;&#32473;<strong>udevd</strong>&#20197;&#21019;&#24314;&#35774;&#22791;&#33410;&#28857;&#12290;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
            7.9.2.2. Udev &#21551;&#21160;&#33050;&#26412;
          </h3>
          <p><span class="command"><strong>S10udev</strong></span> &#21021;&#22987;&#21270;&#33050;&#26412;&#36127;&#36131;&#22312; Linux &#21551;&#21160;&#30340;&#26102;&#20505;&#21019;&#24314;&#35774;&#22791;&#33410;&#28857;&#65292;&#35813;&#33050;&#26412;&#23558;&#40664;&#35748;&#30340;<span class="command"><strong>/sbin/hotplug</strong></span> &#27880;&#20876;&#20026;&#28909;&#25554;&#25300;&#20107;&#20214;&#22788;&#29702;&#31243;&#24207;&#12290;&#20043;&#25152;&#20197;&#36825;&#26679;&#20570;&#65292;&#26159;&#22240;&#20026;&#20869;&#26680;&#19981;&#20877;&#38656;&#35201;&#35843;&#29992;&#22806;&#37096;&#30340;&#20108;&#36827;&#21046;&#25991;&#20214;&#12290;&#32780; <span class=
            "command"><strong>udevd</strong></span> &#23558;&#20250;&#30417;&#21548;&#20869;&#26680;&#21457;&#36215;&#30340;&#32593;&#32476;&#36830;&#25509;&#25509;&#21475;&#20107;&#20214;&#12290;&#28982;&#21518;&#65292;&#21551;&#21160;&#33050;&#26412;&#23558;<code class=
            "filename">/lib/udev/devices</code> &#30446;&#24405;&#37324;&#30340;&#25152;&#26377;&#38745;&#24577;&#35774;&#22791;&#33410;&#28857;&#25335;&#36125;&#21040; <code class=
            "filename">/dev</code> &#30446;&#24405;&#12290; &#36825;&#26159;&#24517;&#38656;&#30340;&#65292;&#22240;&#20026;&#22312;&#31995;&#32479;&#21551;&#21160;&#30340;&#26089;&#26399;&#65292;&#21160;&#24577;&#35774;&#22791;&#22788;&#29702;&#36827;&#31243;&#21487;&#29992;&#20043;&#21069;&#65292;&#38656;&#35201;&#19968;&#20123;&#35774;&#22791;&#65292;&#30446;&#24405;&#21644;&#31526;&#21495;&#38142;&#25509;&#65292; &#25110;<strong>udevd</strong>&#33258;&#24049;&#38656;&#35201;&#12290;&#22312;<code class="filename">/lib/udev/devices</code>&#30446;&#24405;&#24314;&#31435;&#38745;&#24577;&#35774;&#22791;&#33410;&#28857;&#36824;&#20026;&#19981;&#34987;&#21160;&#24577;&#35774;&#22791;&#22788;&#29702;&#31243;&#24207;&#25903;&#25345;&#30340;&#35774;&#22791;&#25552;&#20379;&#20102;&#19968;&#20010;&#26131;&#29992;&#30340;&#24037;&#20316;&#29615;&#22659;&#12290; &#28982;&#21518;&#21551;&#21160;&#33050;&#26412;&#21551;&#21160;Udev&#23432;&#25252;&#36827;&#31243; <span class=
            "command"><strong>udevd</strong></span>&#65292; &#23427;&#23545;&#25152;&#26377;&#25509;&#25910;&#30340;&#20107;&#20214;&#36215;&#20316;&#29992;&#12290;&#26368;&#21518;&#65292;&#21551;&#21160;&#33050;&#26412;&#24378;&#21046;&#20869;&#26680;&#37325;&#29616;&#25152;&#26377;&#24050;&#27880;&#20876;&#35774;&#22791;&#30340;&#20107;&#20214;&#65292;&#24182;&#31561;&#24453;<span class=
            "command"><strong>udevd</strong></span> &#22788;&#29702;&#12290;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
          7.9.2.3. &#35774;&#22791;&#33410;&#28857;&#30340;&#21019;&#24314;</h3>
          <p>&#20026;&#20102;&#24471;&#21040;&#27491;&#30830;&#30340;&#20027;&#27425;&#35774;&#22791;&#21495;&#65292;Udev &#20381;&#36182;&#20110; <code class="filename">/sys</code>&#30446;&#24405;&#19979;&#30340; <code class=
            "systemitem">sysfs</code>&#25552;&#20379;&#30340;&#20449;&#24687;&#12290;&#20363;&#22914; <code class="filename">/sys/class/tty/vcs/dev</code> &#21253;&#21547;&#23383;&#31526;&#20018; &ldquo;<span class="quote">7:0</span>&rdquo;&#65292;&#36825;&#20010;&#23383;&#31526;&#20018;&#34987; <span class=
            "command"><strong>udevd</strong></span> &#29992;&#26469;&#21019;&#24314;&#20027;&#35774;&#22791;&#21495;&#26159;7&#12289; &#27425;&#35774;&#22791;&#21495;&#26159;0&#30340;&#35774;&#22791;&#33410;&#28857;&#12290;&#22312;<code class=
            "filename">/dev</code>&#30446;&#24405;&#19979;&#21019;&#24314;&#30340;&#35774;&#22791;&#33410;&#28857;&#30340;&#21517;&#23383;&#21644;&#26435;&#38480;&#30001;<code class=
            "filename">/etc/udev/rules.d/</code>&#30446;&#24405;&#19979;&#30456;&#24212;&#30340;&#35268;&#21017;&#20915;&#23450;&#12290;&#36825;&#20123;&#20197;&#31867;&#20284;&#30340;&#24418;&#24335;&#21253;&#21547;&#22312; LFS-Bootscripts &#21253;&#20013;&#12290;&#22914;&#26524; <span class="command"><strong>udevd</strong></span> &#19981;&#33021;&#20026;&#23427;&#29616;&#22312;&#21019;&#24314;&#30340;&#35774;&#22791;&#21457;&#29616;&#19968;&#20010;&#35268;&#21017;&#65292;&#23427;&#20250;&#40664;&#35748;&#25226;&#26435;&#38480;&#35774;&#32622;&#20026; 660 &#65292;&#23646;&#20027;&#35774;&#32622;&#20026; <em>root:root&#12290;</em>Udev &#35268;&#21017;&#35821;&#27861;&#30340;&#25991;&#26723;&#21487;&#20197;&#26597;&#30475;<code class=
            "filename">/usr/share/doc/udev-151/writing_udev_rules/index.html</code>&#12290;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
            7.9.2.4. &#27169;&#22359;&#21152;&#36733;</h3>
          <p>&#34987;&#32534;&#35793;&#25104;&#27169;&#22359;&#30340;&#35774;&#22791;&#39537;&#21160;&#21487;&#33021;&#26377;&#32534;&#35793;&#36827;&#21435;&#30340;&#21035;&#21517;&#12290; &#21035;&#21517;&#21487;&#20197;&#36890;&#36807; <span class=
            "command"><strong>modinfo</strong></span> &#31243;&#24207;&#30340;&#36755;&#20986;&#26469;&#26597;&#30475;&#65292; &#36890;&#24120;&#19982;&#35774;&#22791;&#24635;&#32447;&#29305;&#26377;&#30340;&#26631;&#35782;&#26377;&#20851;&#65288;&#27169;&#22359;&#35201;&#25903;&#25345;&#65289;&#12290;&#20363;&#22914;&#65292; <span class=
            "emphasis"><em>snd-fm801</em></span> &#39537;&#21160;&#25903;&#25345; PCI &#35774;&#22791;&#65292; &#24102;&#26377;&#29983;&#20135;&#21830; ID 0x1319 &#21644;&#35774;&#22791; ID 0x0801&#65292;&#26377;&#19968;&#20010;&#21035;&#21517;            &ldquo;<span class=
            "quote">pci:v00001319d00000801sv*sd*bc04sc01i*</span>&rdquo;&#12290; &#23545;&#20110;&#22823;&#22810;&#25968;&#30340;&#35774;&#22791;&#65292;&#24635;&#32447;&#39537;&#21160;&#36890;&#36807;<code class=
            "systemitem">sysfs</code>&#23548;&#20986;&#21487;&#33021;&#20250;&#22788;&#29702;&#30340;&#35774;&#22791;&#39537;&#21160;&#30340;&#21035;&#21517;&#12290;&#20363;&#22914;&#65292;<code class=
            "filename">/sys/bus/pci/devices/0000:00:0d.0/modalias</code> &#25991;&#20214;&#21487;&#33021;&#21253;&#21547;&#23383;&#31526;&#20018; &ldquo;<span class=
            "quote">pci:v00001319d00000801sv00001319sd00001319bc04sc01i00</span>&rdquo;&#12290;Udev&#25552;&#20379;&#30340;&#40664;&#35748;&#35268;&#21017;&#20250;&#24341;&#36215; <span class=
            "command"><strong>udevd</strong></span> &#35843;&#29992; <span class="command"><strong>/sbin/modprobe</strong></span> &#22788;&#29702;&#29615;&#22659;&#21464;&#37327;&#20107;&#20214; <code class="envar">MODALIAS</code> &#30340;&#20869;&#23481; (&#24212;&#35813;&#19982; sysfs &#20013;&#30340;<code class="filename">modalias</code>&#25991;&#20214;&#30340;&#20869;&#23481;&#19968;&#26679;)&#65292; &#22240;&#27492;&#22312;&#36890;&#37197;&#31526;&#25193;&#23637;&#20043;&#21518;&#65292; &#21152;&#36733;&#25152;&#26377;&#30340;&#21035;&#21517;&#21305; &#37197;&#36825;&#20010;&#23383;&#31526;&#20018;&#30340;&#27169;&#22359;&#12290;</p>
          <p> &#22312;&#36825;&#20010;&#20363;&#23376;&#20013;&#65292; &#38500;&#20102; <em>snd-fm801</em>&#65292;&#33618;&#24223;&#30340;&#65288;&#19981;&#24819;&#35201;&#30340;&#65289; <em>forte</em> &#39537;&#21160;&#20250;&#34987;&#21152;&#36733; &#65288;&#22914;&#26524;&#23427;&#26159;&#26377;&#25928;&#30340;&#65289;&#12290;  &#26597;&#30475;&#19979;&#38754;&#30340;&#26041;&#27861;&#26469;&#36991;&#20813;&#21152;&#36733;&#19981;&#24819;&#35201;&#30340;&#27169;&#22359;&#12290;</p>
          <p> &#20869;&#26680;&#33021;&#22312;&#21518;&#21488;&#21152;&#36733;&#26377;&#20851;&#32593;&#32476;&#21327;&#35758;&#12289;&#25991;&#20214;&#31995;&#32479;&#21644; NLS&#65288;&#22269;&#38469;&#35821;&#35328;&#25903;&#25345;&#65289; &#25903;&#25345;&#30340;&#27169;&#22359;&#12290;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
            7.9.2.5. &#22788;&#29702;&#21487;&#28909;&#25554;&#25300;/&#21160;&#24577;&#35774;&#22791;
          </h3>
          <p>&#24403;&#24744;&#25554;&#20837;&#19968;&#20010;&#35774;&#22791;&#65292;&#20363;&#22914;&#19968;&#20010; USB &#25509;&#21475;&#30340; MP3 &#25773;&#25918;&#22120;&#65292; &#20869;&#26680;&#20250;&#26816;&#27979;&#21040;&#35774;&#22791;&#36830;&#25509;&#65292; &#24182;&#20135;&#29983;&#19968;&#20010;&#28909;&#25554;&#25300;&#20107;&#20214;&#65292;&#28982;&#21518;&#65292;&#20687;&#19978;&#38754;&#20171;&#32461;&#30340;&#19968;&#26679;&#65292;<span class="command"><strong>udevd</strong></span>&#22788;&#29702;&#36825;&#20010;&#20107;&#20214;&#12290;</p>
        </div>
      </div>
      <div class="sect2" lang="en" xml:lang="en">
        <h2 class="sect2">
          7.9.3. &#21152;&#36733;&#27169;&#22359;&#21644;&#21019;&#24314;&#35774;&#22791;&#30340;&#38382;&#39064;</h2>
        <p>
          &#24403;&#33258;&#21160;&#21019;&#24314;&#35774;&#22791;&#33410;&#28857;&#26102;&#65292;&#26377;&#19968;&#20123;&#21487;&#33021;&#30340;&#38382;&#39064;&#12290;</p>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
          7.9.3.1.&#20869;&#26680;&#27169;&#22359;&#27809;&#26377;&#33258;&#21160;&#21152;&#36733;          </h3>
          <p>
            &#22914;&#26524;&#26377;&#19968;&#20010;&#24635;&#32447;&#29305;&#26377;&#30340;&#21035;&#21517;&#65292;&#24182;&#19988;&#24635;&#32447;&#39537;&#21160;&#22120;&#23548;&#20986;&#24517;&#38656;&#30340;&#21035;&#21517;&#21040;<code class="systemitem">sysfs</code>&#65292;&#37027;&#20040;   Udev &#23558;&#21482;&#20250;&#21152;&#36733;&#19968;&#20010;&#27169;&#22359;&#12290; &#22312;&#20854;&#20182;&#24773;&#20917;&#19979;&#65292;&#38656;&#35201;&#23433;&#25490;&#20854;&#20182;&#30340;&#27169;&#22359;&#21152;&#36733;&#26041;&#24335;&#12290;&#22312; Linux-2.6.32.8 &#20013;&#65292;Udev
            &#20026; INPUT, IDE, PCI,
          USB, SCSI, SERIO &#21644; FireWire &#35774;&#22791;&#21152;&#36733;&#36866;&#24403;&#30340;&#39537;&#21160;&#12290; </p>
          <p> &#20026;&#20102;&#30830;&#23450;&#20320;&#35831;&#27714;&#30340;&#35774;&#22791;&#39537;&#21160; Udev&#26159;&#21542;&#25903;&#25345;&#65292;&#21487;&#20197;&#20197;&#27169;&#22359;&#30340;&#21517;&#23383;&#20026;&#21442;&#25968;&#36816;&#34892; <span class=
            "command"><strong>modinfo</strong></span> &#12290; &#29616;&#22312;&#25226;&#35774;&#22791;&#30446;&#24405;&#35774;&#32622;&#22312; <code class="filename">/sys/bus</code> &#30446;&#24405;&#19979;&#65292;&#24182;&#26816;&#26597;&#37027;&#37324;&#26159;&#21542;&#26377; <code class="filename">modalias</code> &#25991;&#20214;&#12290; </p>
          <p> &#22914;&#26524; <code class="filename">modalias</code> &#25991;&#20214;&#23384;&#22312;&#20110; <code class="systemitem">sysfs</code>&#20013;&#65292; &#39537;&#21160;&#31243;&#24207;&#25903;&#25345;&#35774;&#22791;&#21487;&#20197;&#30452;&#25509;&#36890;&#20449;&#65292; &#20294;&#26159;&#27809;&#26377;&#21035;&#21517;&#65292; &#36825;&#26159;&#39537;&#21160;&#20013;&#30340;&#19968;&#20010; bug&#12290;&#19981;&#21033;&#29992; Udev &#30340;&#24110;&#21161;&#21152;&#36733;&#39537;&#21160;&#65292;&#24076;&#26395;&#22312;&#20197;&#21518;&#36825;&#20010;&#38382;&#39064;&#20250;&#34987;&#20462;&#27491;&#12290;</p>
          <p> &#22914;&#26524;&#22312;<code class="filename">/sys/bus</code> &#19979;&#30340;&#30456;&#24212;&#30446;&#24405;&#20013;&#27809;&#26377; <code class="filename">modalias</code> &#25991;&#20214;&#65292; &#23601;&#24847;&#21619;&#30528;&#20869;&#26680;&#24320;&#21457;&#32773;&#27809;&#26377;&#28155;&#21152;&#23545;&#36825;&#31181;&#24635;&#32447;&#31867;&#22411;&#30340;&#27169;&#22359;&#21035;&#21517;&#25903;&#25345;&#12290; &#22312; Linux-2.6.32.8 &#20013;&#65292;ISA &#24635;&#32447;&#23601;&#26159;&#36825;&#31181;&#24773;&#20917;&#12290; &#24076;&#26395;&#22312;&#19979;&#20010;&#20869;&#26680;&#29256;&#26412;&#20013;&#20250;&#20462;&#27491;&#36825;&#20010;&#38382;&#39064;&#12290;</p>
          <p> Udev &#26681;&#26412;&#19981;&#21152;&#36733; &ldquo;<span class=
            "quote">&#23553;&#35013;</span>&rdquo; &#39537;&#21160;&#65292;&#22914; <span class=
            "emphasis"><em>snd-pcm-oss</em></span> &#21644; &#38750;&#30828;&#20214;&#39537;&#21160;&#22914; <span class="emphasis"><em>loop</em></span>&#12290;</p>
          <p>&nbsp;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
            7.9.3.2. &#20869;&#26680;&#27169;&#22359;&#27809;&#26377;&#33258;&#21160;&#21152;&#36733;&#65292; &#24182;&#19988;Udev &#20063;&#27809;&#26377;&#21152;&#36733;&#23427;</h3>
          <p>&#22914;&#26524; &ldquo;&#23553;&#35013;&rdquo; &#27169;&#22359;&#20165;&#20165;&#22686;&#24378;&#20854;&#20182;&#19968;&#20123;&#27169;&#22359;&#25552;&#20379;&#30340;&#21151;&#33021;
            (&#20363;&#22914;&#65292; <span class="emphasis"><em>snd-pcm-oss</em></span> &#36890;&#36807;&#20351;&#22768;&#21345;&#23545;&#20110;OSS&#24212;&#29992;&#21487;&#29992;&#26469;&#22686;&#24378; <span class=
            "emphasis"><em>snd-pcm</em></span> &#30340;&#21151;&#33021;)&#65292;&#23601;&#37197;&#32622; <span class=
            "command"><strong>modprobe</strong></span> &#20351;&#20854;&#22312;&#21152;&#36733;&#20102;&#30456;&#24212;&#27169;&#22359;&#21518;&#21152;&#36733;&#20854;&#23553;&#35013;&#27169;&#22359;&#12290; &#35201;&#36825;&#26679;&#20570;&#65292;&#23601;&#22312;<code class="filename">/etc/modprobe.d/<em>&lt;filename&gt;</em>.conf </code>&#25991;&#20214;&#20013;&#65292;&#21152;&#20837;
          &ldquo;<span class="quote">install</span>&rdquo; &#34892;&#12290;&#20363;&#22914; &#65306;</p>
          <pre class="screen"><code class=
          "literal">install snd-pcm /sbin/modprobe -i snd-pcm ; \
    /sbin/modprobe snd-pcm-oss ; true</code></pre>
          <p>&#22914;&#26524;&#27169;&#22359;&#19981;&#26159;&#19968;&#20010;&#23553;&#35013;&#65292;&#32780;&#26159;&#23545;&#33258;&#24049;&#26412;&#36523;&#26377;&#29992;&#65292;&#37197;&#32622;<span class=
            "command"><strong>S05modules</strong></span> &#21551;&#21160;&#33050;&#26412;&#20351;&#20854;&#22312;&#31995;&#32479;&#21551;&#21160;&#30340;&#26102;&#20505;&#21152;&#36733;&#12290; &#35201;&#36825;&#26679;&#20570;&#65292;&#23601;&#25226;&#27169;&#22359;&#21517;&#21152;&#20837;&#21040;<code class="filename">/etc/sysconfig/modules</code>&#25991;&#20214;&#30340;&#19968;&#20010;&#21333;&#29420;&#30340;&#34892;&#12290;&#36825;&#23545;&#20110;&#23553;&#35013;&#27169;&#22359;&#20063;&#26377;&#29992;&#65292;&#20294;&#19981;&#26159;&#26368;&#20248;&#30340;&#12290;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
          7.9.3.3. Udev&#21152;&#36733;&#20102;&#19968;&#20123;&#19981;&#38656;&#35201;&#30340;&#27169;&#22359;          </h3>
          <p>
            &#22312;&#19979;&#38754;&#20363;&#23376;&#20013;&#65292;&#23545;&#20110; <em>forte &#27169;&#22359;&#65292;&#21487;&#20197;</em>&#19981;&#32534;&#35793;&#23427;&#25110;&#32773;&#26159;&#22312; <code class=
            "filename">/etc/modprobe.d/blacklist.conf</code>  &#25991;&#20214;&#20013;&#21015;&#20837;&#40657;&#21517;&#21333;&#65306;</p>
          <pre class="screen"><code class=
          "literal">blacklist forte</code></pre>
          <p>&#21015;&#20837;&#40657;&#21517;&#21333;&#30340;&#27169;&#22359;&#36824;&#21487;&#20197;&#20351;&#29992; <span class="command"><strong>modprobe </strong></span>&#21629;&#20196;&#25163;&#24037;&#21152;&#36733;&#12290;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
            7.9.3.4. Udev &#21019;&#24314;&#20102;&#38169;&#35823;&#30340;&#35774;&#22791;&#65292;&#25110;&#21019;&#24314;&#20102;&#38169;&#35823;&#30340;&#31526;&#21495;&#38142;&#25509;</h3>
          <p>&#22914;&#26524;&#35268;&#21017;&#21305;&#37197;&#19981;&#26159;&#39044;&#24819;&#30340;&#35774;&#22791;&#65292;&#37027;&#20040;&#36825;&#31181;&#24773;&#20917;&#23601;&#20250;&#32463;&#24120;&#21457;&#29983;&#12290;&#20363;&#22914;&#65292; &#19968;&#20010;&#20889;&#30340;&#24456;&#31967;&#31957;&#30340;&#35268;&#21017;&#36890;&#36807;&#35745;&#31639;&#26426;&#25552;&#20379;&#21830;&#21305;&#37197;&#21040;&#19968;&#20010; SCSI &#30828;&#30424;&#65288;&#26399;&#26395;&#30340;&#65289;&#21644;&#19968;&#20010;&#19968;&#33324;&#30340; SCSI &#35774;&#22791;&#65288;&#38169;&#35823;&#30340;&#65289;&#12290;&#20351;&#29992;<span class="command"><strong>udevadm
            info</strong></span>&#21629;&#20196;&#65292;&#24110;&#21161;&#25214;&#20986;&#36825;&#20123;&#19981;&#21512;&#26684;&#30340;&#35268;&#21017;&#65292; &#26356;&#27491;&#20182;&#20204;&#12290;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
            7.9.3.5. Udev &#35268;&#21017;&#24037;&#20316;&#19981;&#21487;&#38752;</h3>
          <p>
            &#36825;&#25110;&#35768;&#26159;&#21069;&#38754;&#38382;&#39064;&#30340;&#19968;&#20010;&#34920;&#29616;&#12290;&#22914;&#26524;&#19981;&#26159;&#24182;&#19988;&#20320;&#30340;&#35268;&#21017;&#20351;&#29992; <code class="systemitem">sysfs</code> &#23646;&#24615;&#65292; &#36825;&#21487;&#33021;&#26159;&#19968;&#20010;&#20869;&#26680;&#35745;&#26102;&#38382;&#39064;&#65292;&#22312;&#20197;&#21518;&#30340;&#20869;&#26680;&#29256;&#26412;&#20013;&#20250;&#34987;&#20462;&#27491; &#12290;&#29616;&#22312;&#65292;&#20320;&#21487;&#20197;&#36890;&#36807;&#21019;&#24314;&#19968;&#20010;&#31561;&#24453;&#20351;&#29992; sysfs &#23646;&#24615;&#30340;&#35268;&#21017;&#65292;&#25226;&#23427;&#28155;&#21152;&#21040; <code class=
            "filename">/etc/udev/rules.d/10-wait_for_sysfs.rules</code>&#25991;&#20214;&#20013;&#65288;&#22914;&#26524;&#36825;&#20010;&#25991;&#20214;&#19981;&#23384;&#22312;&#65292;&#23601;&#21019;&#24314;&#23427;&#65289;&#12290; &#22914;&#26524;&#20320;&#36825;&#26679;&#20570;&#20102;&#65292;&#35831;&#36890;&#30693; LFS   &#24320;&#21457;&#37038;&#20214;&#21015;&#34920; &#65292;&#23545;&#20182;&#20204;&#26377;&#25152;&#24110;&#21161;&#12290;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
          7.9.3.6. Udev &#27809;&#26377;&#21019;&#24314;&#35774;&#22791;</h3>
          <p>&#21518;&#38754;&#30340;&#25991;&#26412;&#20551;&#35774;&#39537;&#21160;&#24050;&#32463;&#34987;&#38745;&#24577;&#30340;&#32534;&#35793;&#36827;&#20102;&#20869;&#26680;&#25110;&#32773;&#26159;&#20316;&#20026;&#27169;&#22359;&#24050;&#32463;&#34987;&#21152;&#36733;&#65292;&#20320;&#24050;&#32463;&#26816;&#26597;&#20102; Udev &#27809;&#26377;&#21019;&#24314;&#38169;&#35823;&#30340;&#35774;&#22791;&#12290;</p>
          <p>&#22914;&#26524;&#19968;&#20010;&#20869;&#26680;&#39537;&#21160;&#27809;&#26377;&#23558;&#23427;&#30340;&#25968;&#25454;&#36755;&#20986;&#21040; <code class=
            "systemitem">sysfs</code>&#65292; Udev &#23601;&#27809;&#26377;&#24517;&#35201;&#30340;&#20449;&#24687;&#26469;&#21019;&#24314;&#35774;&#22791;&#33410;&#28857;&#65292; &#36825;&#20010;&#38382;&#39064;&#22312;&#20869;&#26680;&#28304;&#20195;&#30721;&#26641;&#20043;&#22806;&#30340;&#31532;&#19977;&#26041;&#39537;&#21160;&#31243;&#24207;&#19978;&#23588;&#20854;&#24120;&#35265;&#12290;&#20351;&#29992;&#20027;/&#27425;&#35774;&#22791;&#21495;&#65288;&#21442;&#32771;&#20869;&#26680;&#25991;&#26723;&#20013;&#30340;<code class=
            "filename"> devices.txt</code>&#25991;&#20214;&#25110;&#31532;&#19977;&#26041;&#39537;&#21160;&#25552;&#20379;&#21830;&#30340;&#25991;&#26723;&#65289;&#65292;&#22312;  <code class="filename">/lib/udev/devices</code> &#20013;&#24314;&#31435;&#38745;&#24577;&#35774;&#22791;&#33410;&#28857;&#12290; &#38745;&#24577;&#35774;&#22791;&#33410;&#28857;&#20250;&#34987;<strong>S10udev</strong> &#25335;&#36125;&#21040; <code class=
            "filename">/dev</code> &#30446;&#24405;&#12290;</p>
        </div>
        <div class="sect3" lang="en" xml:lang="en">
          <h3 class="sect3">
          7.9.3.7. &#37325;&#21551;&#21518;&#35774;&#22791;&#21517;&#23383;&#39034;&#24207;&#21464;&#21270;          </h3>
          <p>&#36825;&#26159;&#30001;&#20110; Udev&#35774;&#35745;&#30340;&#38382;&#39064;&#65292;&#23427;&#20197;&#24182;&#34892;&#26041;&#24335;&#22788;&#29702;&#20107;&#20214;&#21644;&#21152;&#36733;&#27169;&#22359;&#12290;&#22240;&#27492;&#21517;&#23383;&#30340;&#39034;&#24207;&#23601;&#20250;&#19981;&#21487;&#39044;&#27979;&#12290; &#36825;&#23558;&#19981;&#20250;&#34987;&ldquo;<span class=
            "quote">&#20462;&#22797;</span>&rdquo;&#12290; &#20320;&#19981;&#24212;&#24403;&#20381;&#36182;&#31283;&#23450;&#30340;&#20869;&#26680;&#35774;&#22791;&#21517;&#12290;&#32780;&#26159;&#26681;&#25454;&#35774;&#22791;&#30340;&#19968;&#20123;&#31283;&#23450;&#30340;&#23646;&#24615;&#65292;&#27604;&#22914;&#24207;&#21015;&#21495;&#25110; Udev &#23433;&#35013;&#30340;&#21508;&#31181; *_id &#24037;&#20855;&#30340;&#36755;&#20986;&#65292; &#20889;&#33258;&#24049;&#30340;&#35268;&#21017;&#26469;&#21019;&#24314;&#31526;&#21495;&#38142;&#25509;&#12290;&#35831;&#21442;&#32771; <a class="xref" href=
            "symlinks.html" title=
            "7.10.&nbsp;Creating Custom Symlinks to Devices">Section&nbsp;7.10,
            &ldquo;&#20026;&#35774;&#22791;&#21019;&#24314;&#24815;&#29992;&#31526;&#21495;&#36830;&#25509; &rdquo;</a> &#21644;
            <a class="xref" href="network.html" title=
            "7.13.&nbsp;Configuring the network Script">Section&nbsp;7.13,
            &ldquo;&#37197;&#32622;&#32593;&#32476;&#33050;&#26412; &rdquo;</a> &#12290; </p>
        </div>
      </div>
      <div class="sect2" lang="en" xml:lang="en">
        <h2 class="sect2">
        7.9.4. &#26377;&#29992;&#30340;&#35835;&#29289;</h2>
        <p>&#19968;&#20123;&#26377;&#29992;&#30340;&#34917;&#20805;&#25991;&#26723;&#21487;&#20197;&#22312;&#19979;&#21015;&#32593;&#31449;&#24471;&#21040;&#65306;</p>
        <div class="itemizedlist">
          <ul>
            <li>
              <p><code class=
                "systemitem">devfs</code> &#30340;&#29992;&#25143;&#31354;&#38388;&#23454;&#29616;<a class="ulink" href=
                "http://www.kroah.com/linux/talks/ols_2003_udev_paper/Reprint-Kroah-Hartman-OLS2003.pdf"> </a><a class="ulink" href=
                "http://www.kroah.com/linux/talks/ols_2003_udev_paper/Reprint-Kroah-Hartman-OLS2003.pdf">
              http://www.kroah.com/linux/talks/ols_2003_udev_paper/Reprint-Kroah-Hartman-OLS2003.pdf</a>              </p>
            </li>
            <li>
              <p><code class="systemitem">sysfs</code> &#25991;&#20214;&#31995;&#32479;
                <a class="ulink" href=
                "http://www.kernel.org/pub/linux/kernel/people/mochel/doc/papers/ols-2005/mochel.pdf">
                http://www.kernel.org/pub/linux/kernel/people/mochel/doc/papers/ols-2005/mochel.pdf</a>              </p>
            </li>
            <li>
              <p>&#36827;&#19968;&#27493;&#38405;&#35835;&#25351;&#21335;<a class="ulink" href=
                "http://www.kernel.org/pub/linux/utils/kernel/hotplug/udev.html">
                http://www.kernel.org/pub/linux/utils/kernel/hotplug/udev.html</a>              </p>
            </li>
          </ul>
        </div>
      </div>
    </div>
    <div class="navfooter">
      <ul>
        <li class="prev">
          <a accesskey="p" href="profile.html" title=
          "The Bash Shell Startup Files">&#21518;&#36864;</a>
          <p>
            Bash Shell &#21551;&#21160;&#25991;&#20214;
          </p>
        </li>
        <li class="next">
          <a accesskey="n" href="symlinks.html" title=
          "Creating Custom Symlinks to Devices">&#21069;&#36827;</a>
          <p>
            &#20026;&#35774;&#22791;&#21019;&#24314;&#24815;&#29992;&#31526;&#21495;&#36830;&#25509; 
          </p>
        </li>
        <li class="up">
          <a accesskey="u" href="chapter07.html" title=
          "Chapter&nbsp;7.&nbsp;Setting Up System Bootscripts">&#19978;&#19968;&#32423;</a>
        </li>
        <li class="home">
          <a accesskey="h" href="../index.html" title=
          "Linux From Scratch - Version 6.6">&#39318;&#39029;</a>
        </li>
      </ul>
    </div>
  </body>
</html>
